var MemoryStore = function(successCallback, errorCallback) {

	this.findByNameWithFilter = function(searchKey,filterIds,callback) {
			if (searchKey=="全部"){
				searchKey="";
			}
			
			if(filterIds!=undefined&&filterIds.length>0){
				var filterList=window.filterList;
				var filterString="";
				for(var i=0;i<filterIds.length;i++){
						for(var j=0;j<filterList.length;j++){
							if(filterList[j].id==filterIds[i]){
								filterString+=filterList[j].content;
							}
						}
				}
				var employees = window.employees.filter(function(element) {
					var fullName = element.name +""+ element.belonging +""+element.goodfor;	
					if(filterString!=""){
						if((fullName.toLowerCase().indexOf(searchKey.toLowerCase()) > -1)&&(filterString.toLowerCase().indexOf(element.name.toLowerCase())>-1)){
							return true;
						}
					}
				});
				callLater(callback, employees);
				
			}else{
				var employees = window.employees.filter(function(element) {
					var fullName = element.name +""+ element.belonging +""+element.goodfor;
					return fullName.toLowerCase().indexOf(searchKey.toLowerCase()) > -1;
				});
				callLater(callback, employees);
			}
			
			
    }
	

    this.findById = function(id, callback) {
        var employees = window.employees;
        var employee = null;
        var l = employees.length;
        for (var i=0; i < l; i++) {
            if (employees[i].id === id) {
                employee = employees[i];
                break;
            }
        }
        callLater(callback, employee);
    }
	
	//filter list
	this.findFilterById = function(id,callback){
		var filterList= window.filterList;
		var fItem = null;
		var l = filterList.length;
        for (var i=0; i < l; i++) {
            if (filterList[i].id === id) {
                fItem = filterList[i];
                break;
            }
        }
        callLater(callback, fItem);
	}
	
	this.findAllFilter = function(callback){
		var filterList= window.filterList;
        callLater(callback, filterList);
	}
	

    // Used to simulate async calls. This is done to provide a consistent interface with stores (like WebSqlStore)
    // that use async data access APIs
    var callLater = function(callback, data) {
        if (callback) {
            setTimeout(function() {
                callback(data);
            });
        }
    }
	
	window.filterList=[
			{"id":1,"selected":0,"title":"30个考试穴位","content":"下关 尺泽 少冲 翳风 腰阳关 血海 丘墟 丰隆 外劳宫 耳门 曲泽 肩髎 颊车 公孙 少泽 梁门 中府 风池 条口 章门 合谷 梁丘 后溪 申脉 气海 中脘 太渊 印堂 百会 地仓 昆仑"}
	];

    /*this.employees = [
            {"id": 1,"firstName":"Ryan","lastName":"Howard","title":"Vice President, North East","managerId": 0,"city":"New York, NY","cellPhone":"212-999-8888","officePhone":"212-999-8887","email":"ryan@dundermifflin.com"},
            {"id": 2,"firstName":"Michael","lastName":"Scott","title":"Regional Manager","managerId": 1,"city":"Scranton, PA","cellPhone":"570-865-2536","officePhone":"570-123-4567","email":"michael@dundermifflin.com"},
            {"id": 3,"firstName":"Dwight","lastName":"Schrute","title":"Assistant Regional Manager","managerId": 2,"city":"Scranton, PA","cellPhone":"570-865-1158","officePhone":"570-843-8963","email":"dwight@dundermifflin.com"},
            {"id": 4,"firstName":"Jim","lastName":"Halpert","title":"Assistant Regional Manager","managerId": 2,"city":"Scranton, PA","cellPhone":"570-865-8989","officePhone":"570-968-5741","email":"dwight@dundermifflin.com"},
            {"id": 5,"firstName":"Pamela","lastName":"Beesly","title":"Receptionist","managerId": 2,"city":"Scranton, PA","cellPhone":"570-999-5555","officePhone":"570-999-7474","email":"pam@dundermifflin.com"},
            {"id": 6,"firstName":"Angela","lastName":"Martin","title":"Senior Accountant","managerId": 2,"city":"Scranton, PA","cellPhone":"570-555-9696","officePhone":"570-999-3232","email":"angela@dundermifflin.com"},
            {"id": 7,"firstName":"Kevin","lastName":"Malone","title":"Accountant","managerId": 6,"city":"Scranton, PA","cellPhone":"570-777-9696","officePhone":"570-111-2525","email":"kmalone@dundermifflin.com"},
            {"id": 8,"firstName":"Oscar","lastName":"Martinez","title":"Accountant","managerId": 6,"city":"Scranton, PA","cellPhone":"570-321-9999","officePhone":"570-585-3333","email":"oscar@dundermifflin.com"},
            {"id": 9,"firstName":"Creed","lastName":"Bratton","title":"Quality Assurance","managerId": 2,"city":"Scranton, PA","cellPhone":"570-222-6666","officePhone":"570-333-8585","email":"creed@dundermifflin.com"},
            {"id": 10,"firstName":"Andy","lastName":"Bernard","title":"Sales Director","managerId": 4,"city":"Scranton, PA","cellPhone":"570-555-0000","officePhone":"570-646-9999","email":"andy@dundermifflin.com"},
            {"id": 11,"firstName":"Phyllis","lastName":"Lapin","title":"Sales Representative","managerId": 10,"city":"Scranton, PA","cellPhone":"570-241-8585","officePhone":"570-632-1919","email":"phyllis@dundermifflin.com"},
            {"id": 12,"firstName":"Stanley","lastName":"Hudson","title":"Sales Representative","managerId": 10,"city":"Scranton, PA","cellPhone":"570-700-6464","officePhone":"570-787-9393","email":"shudson@dundermifflin.com"},
            {"id": 13,"firstName":"Meredith","lastName":"Palmer","title":"Supplier Relations","managerId": 2,"city":"Scranton, PA","cellPhone":"570-588-6567","officePhone":"570-981-6167","email":"meredith@dundermifflin.com"},
            {"id": 14,"firstName":"Kelly","lastName":"Kapoor","title":"Customer Service Rep.","managerId": 2,"city":"Scranton, PA","cellPhone":"570-123-9654","officePhone":"570-125-3666","email":"kelly@dundermifflin.com"},
            {"id": 15,"firstName":"Toby","lastName":"Flenderson","title":"Human Resources","managerId": 1,"city":"Scranton, PA","cellPhone":"570-485-8554","officePhone":"570-699-5577","email":"toby@dundermifflin.com"}
        ];*/
		//alert(dataxue);
	window.employees = [{
		"id":"LU1",
		"belonging":"手太阴肺经",
		"name":"中府",
		"pos":"在胸外侧部，云门下1寸，平第一肋间隙处，距前正中线6寸",
		"anatomy":"当胸大肌、胸小肌处，内侧深层为第一 肋间内、外肌；上外侧有腋动、静脉， 胸肩峰动、静脉；布有锁骨上神经中间支，胸前神经分支及第一肋间神经外侧皮支",
		"goodfor":"咳嗽 ，气喘，肺胀满，胸痛等肺部疾病；肩背痛",
		"method":"向外斜刺或平刺0．5—0．8寸，不可向 内深刺，以免伤及肺脏",
		"extra":"肺的募穴，手足太阴经交会穴"
	}, {
		"id":"LU2",
		"belonging":"手太阴肺经",
		"name":"云门",
		"pos":"在胸外侧部，肩胛骨喙突上方，锁骨下窝凹陷处，距前正中线6寸",
		"anatomy":"有胸大肌，皮下有头静脉通过，深部有胸肩峰动脉分支；布有胸前神经的分支臂丛外侧束、锁骨上神经中后支",
		"goodfor":"咳嗽，气喘，胸痛，肩背痛，胸中烦痛",
		"method":"向外斜刺0.5-0.8寸，可灸",
		"extra":""
	}, {
		"id":"LU3",
		"belonging":"手太阴肺经",
		"name":"天府",
		"pos":"在臂内侧面，肱二头肌桡侧缘，腋前纹头下3寸处",
		"anatomy":"肱二头肌外侧沟中；有头静脉及肱动、静脉分支；分布着臂外侧皮神经及肌皮神经",
		"goodfor":"气喘，鼻衄，瘿气，臂痛",
		"method":"直刺0.5-1寸",
		"extra":""
	}, {
		"id":"LU4",
		"belonging":"手太阴肺经",
		"name":"侠白",
		"pos":"在臂内侧面，肱二头肌桡侧缘，腋前纹头下4寸，或肘横纹上5寸处",
		"anatomy":"肱二头肌外侧沟中；当头静脉及桡动、静脉分支；分布有臂外侧皮神经，当肌皮神经经过处",
		"goodfor":"咳嗽，气喘，干呕，烦满，臑痛",
		"method":"直刺0.5-1寸",
		"extra":""
	}, {
		"id":"LU5",
		"belonging":"手太阴肺经",
		"name":"尺泽",
		"pos":"在肘横纹中，肱二头肌腱桡侧凹陷处",
		"anatomy":"在肘关节，当肘二头肌腱之外方，肱桡 肌起始部；有桡侧返动、静脉分支及头静脉；布有前臂外侧皮神经，直下为桡神经",
		"goodfor":"①咳嗽，气喘，咳血②咽喉肿痛  ③肘臂挛痛",
		"method":"直刺0.8-1.2寸；或点刺出血",
		"extra":"手太阴经所入为[合]"
	}, {
		"id":"LU6",
		"belonging":"手太阴肺经",
		"name":"孔最",
		"pos":"在前臂掌面桡侧，当尺泽与太渊连线上，腕横纹上7寸处",
		"anatomy":"有肱桡肌，在旋前圆肌上端之外缘，桡侧腕长、短伸肌的内缘；有头静脉、桡动、静脉；布有前臂外侧皮神经，桡神经浅支",
		"goodfor":"咳嗽，气喘，咯血（首选），咽喉肿痛，失音等肺系疾病；肘臂挛病，痔疾",
		"method":"直刺0.5 - 1寸",
		"extra":"手太阴经郄穴"
	}, {
		"id":"LU7",
		"belonging":"手太阴肺经",
		"name":"列缺",
		"pos":"在前臂桡侧缘，桡骨茎突上方，腕横纹上1.5寸，当肱桡肌与拇长展肌腱之间",
		"anatomy":"在肱桡肌腱与拇长展肌腱之间，桡侧腕长伸肌腱内侧；有头静脉，桡动、静脉分支；布有前臂外侧皮神经和桡神经浅支的混合支",
		"goodfor":"①头痛项强 面瘫 落枕（独取）②伤风 咳嗽 气喘 ③咽喉肿痛 ④手腕疼痛无力 ",
		"method":"向上斜刺0.3 - 0.5寸",
		"extra":"手太阴经络穴；八脉交会穴之一，通于任脉"
	}, {
		"id":"LU8",
		"belonging":"手太阴肺经",
		"name":"经渠",
		"pos":"在前臂掌面桡侧，桡骨茎突与桡动脉之间凹陷处，腕横纹上1寸",
		"anatomy":"桡侧腕屈肌腱的外侧，有旋前方肌当桡动、静脉外侧处；布有前臂外侧皮神经和桡神经浅支混合支",
		"goodfor":"咳嗽，气喘，胸痛，咽喉肿痛，手腕痛",
		"method":"避开桡动脉，直刺0.3 - 0.5寸",
		"extra":"手太阴经所行为[经]"
	}, {
		"id":"LU9",
		"belonging":"手太阴肺经",
		"name":"太渊",
		"pos":"在腕掌侧横纹桡侧，桡动脉搏动处",
		"anatomy":"桡侧腕屈肌腱的外侧，拇展长肌腱内测；有桡动、静脉；布有前臂外侧皮神经和桡神经浅支混合支",
		"goodfor":"①咳嗽 气喘 咳血 ②咽喉肿痛 ③无脉症 （首选） ④手腕痛无力 胸痛 ",
		"method":"避开桡动脉，直刺0.3 - 0.5寸",
		"extra":"手太阴经所注为[输]；肺经原穴；脉会太渊"
	}, {
		"id":"LU10",
		"belonging":"手太阴肺经",
		"name":"鱼际",
		"pos":"在手拇指本节（第1掌指关节）后凹陷处，约当第１掌骨中点桡侧，赤白肉际处",
		"anatomy":"有拇短展肌和拇指对掌肌；血管当拇指静脉回流支；布有前臂外侧皮神经和桡神经浅支混合支",
		"goodfor":"①咳嗽 气喘 咳血 ②咽喉肿痛 失音 等肺系热病③热病 掌中热 ",
		"method":"直刺0.5 - 0.8寸",
		"extra":"手太阴经所溜为[荥]"
	}, {
		"id":"LU11",
		"belonging":"手太阴肺经",
		"name":"少商",
		"pos":"在手拇指末节桡侧，距指甲角0.1寸",
		"anatomy":"有指掌固有动、静脉所形成的动、静脉网；布有前臂外侧皮神经和桡神经浅支混合支，正中神经的掌侧固有神经的末梢神经网",
		"goodfor":"①咽喉肿痛（首选） 咳喘等肺系热病②急救：中风 昏迷 中暑 ③高热抽搐 癫狂痫",
		"method":"浅刺0.1寸，或点刺出血",
		"extra":"手太阴经所出为[井]"
	}, {
		"id":"LI1",
		"belonging":"手阳明大肠经",
		"name":"商阳",
		"pos":"在手食指末节桡侧，距指甲角0.1寸",
		"anatomy":"有指及掌背动、静脉网；布有来自正中神经的指掌侧固有神经，桡神经的指背侧神经",
		"goodfor":"①咽喉肿痛 齿痛等五官疾患②急救：中暑 昏迷 热病③手指麻木",
		"method":"浅刺0.1寸，或点刺出血",
		"extra":"手阳明经所出为[井]"
	}, {
		"id":"LI2",
		"belonging":"手阳明大肠经",
		"name":"二间",
		"pos":"微握拳，当手食指本节（第2掌指关节）前桡侧凹陷中",
		"anatomy":"有指屈浅、深肌腱；有来自桡动脉的指背及掌侧动、静脉，布有桡神经的指背侧固有神经，正中神经的指掌侧固有神经",
		"goodfor":"目昏，鼻衄，齿痛，口歪，咽喉肿痛，热病",
		"method":"直刺0.2 - 0.3寸",
		"extra":"手阳明经所溜为[荥]"
	}, {
		"id":"LI3",
		"belonging":"手阳明大肠经",
		"name":"三间",
		"pos":"微握拳，在手食指本节（第2掌指关节）后，桡侧凹陷处",
		"anatomy":"有第一骨间背侧肌，深层为拇内收肌横头；有手背静脉网（头静脉其示部），指掌侧有固有动脉；布有桡神经浅支",
		"goodfor":"咽喉肿痛，牙痛，腹胀，眼痛，肠泻，洞泄",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手阳明经所注为[输]"
	}, {
		"id":"LI4",
		"belonging":"手阳明大肠经",
		"name":"合谷",
		"pos":"在手背，第1、2掌骨间，当第2掌骨桡侧的中点处",
		"anatomy":"在第一、二掌骨之间，第一骨间背侧肌中，深层有拇收肌横头；有手背静脉网，为头静脉的起部，腧穴近侧正当桡动脉从手背穿向手掌之处；布有桡神经浅支的掌背侧神经，深部有正中神经的指掌侧固有神经",
		"goodfor":"①头痛 眩晕 面瘫 面肿 齿痛 牙关紧闭 目赤肿痛 鼻渊 鼻衄 咽喉肿痛 耳聋　耳鸣 ②热病　多汗　无汗③妇科病：闭经　滞产④上肢痿痹　手指挛痛⑤腹痛　便秘 ",
		"method":"直刺0.5 - 1寸，针刺时手呈半握拳状孕妇不宜针",
		"extra":"(l)手阳明经所过为[原](2)《神应经》：孕妇不宜针别名：虎口"
	}, {
		"id":"LI5",
		"belonging":"手阳明大肠经",
		"name":"阳溪",
		"pos":"在腕背横纹桡侧，手拇指向上翘时，当拇短伸肌腱与拇长伸肌腱之间的凹陷中",
		"anatomy":"当拇短、长伸肌腱之间；有头静脉、桡动脉的腕背支；布有桡神经浅支",
		"goodfor":"头痛，目赤肿痛，耳聋，耳鸣，齿痛， 咽喉肿痛；手腕痛",
		"method":"直刺0.5 - 0.8寸",
		"extra":"手阳明经所行为[经]"
	}, {
		"id":"LI6",
		"belonging":"手阳明大肠经",
		"name":"偏历",
		"pos":"屈肘，在前臂背面桡侧，当阳溪与曲池连线上 ，腕横纹上3寸处",
		"anatomy":"在桡骨远端，桡侧腕伸肌腱与拇长展肌腱之间；有头静脉；掌侧为前臂外侧皮神经和桡神经浅支，背侧为前臂背侧皮神经和前臂骨间背侧神经",
		"goodfor":"目赤，耳鸣，鼻衄，喉痛，手臂酸痛，水肿",
		"method":"直刺或斜刺0.5 - 0.8寸",
		"extra":"手阳明经络穴"
	}, {
		"id":"LI7",
		"belonging":"手阳明大肠经",
		"name":"温溜",
		"pos":"屈肘，在前臂背面桡侧，当阳溪与曲池连线上，腕横纹上5寸处",
		"anatomy":"在桡侧腕伸肌肌腹与拇长展肌之间；有桡动脉分支及头静脉；布有前臂背侧皮神经与桡神经深支",
		"goodfor":"头痛 ，面肿 ，咽喉肿痛 ，疔疮，肩背酸痛，肠鸣腹痛",
		"method":"直刺0.5 - l寸",
		"extra":"手阳明经郄穴"
	}, {
		"id":"LI8",
		"belonging":"手阳明大肠经",
		"name":"下廉",
		"pos":"在前臂背面桡侧，当阳溪与曲池连线上，肘横纹下4寸处",
		"anatomy":"在桡骨的桡侧，桡侧有腕伸短肌及腕伸长肌，深层有旋后肌；有桡动脉分支；布有前臂背侧皮神经及桡神经深支",
		"goodfor":"头痛，眩晕，目痛，肘臂痛，腹胀，腹痛",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"LI9",
		"belonging":"手阳明大肠经",
		"name":"上廉",
		"pos":"在前臂背面桡侧，当阳溪与曲池连线上，肘横纹下３寸处",
		"anatomy":"在桡侧腕伸肌肌腹与拇长展肌之间；有桡动脉分支及头静脉；布有前臂背侧皮神经与桡神经深支",
		"goodfor":"头痛，肩膊酸痛，半身不遂，手臂麻木， 肠鸣腹痛",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"LI10",
		"belonging":"手阳明大肠经",
		"name":"手三里",
		"pos":"在前臂背面桡侧，当阳溪与曲池连线上，肘横纹下2寸处",
		"anatomy":"肌肉、神经同下廉穴，血管为桡返动脉的分支",
		"goodfor":"①上肢瘫痪 肘臂痛　肩背痛②齿痛　颊肿 ",
		"method":"直刺0.8 - 1.2寸",
		"extra":""
	}, {
		"id":"LI11",
		"belonging":"手阳明大肠经",
		"name":"曲池",
		"pos":"在肘横纹外侧端，屈肘，当尺泽与肱骨外上髁连线中点",
		"anatomy":"桡侧腕长伸肌起始部，肱桡肌的挠侧；有桡返动脉的分支；布有前臂背侧皮神经，内侧深层为桡神经本干",
		"goodfor":"①咽喉肿痛 齿痛 目赤痛 面瘫②皮肤病：荨麻疹 全身瘙痒 湿疹等③热病（ + 大椎）高血压（收缩压升高者优）④上肢不遂，肘臂疼痛无力⑤腹痛　腹泻 ",
		"method":"直刺1 - 1.5寸",
		"extra":"手阳明经所入为[合]"
	}, {
		"id":"LI12",
		"belonging":"手阳明大肠经",
		"name":"肘髎",
		"pos":"在臂外侧，屈肘，曲池上方l寸，当肱骨边缘处",
		"anatomy":"在桡骨外上髁上缘肱肌起始部，肱三头肌外缘；有桡侧副动脉；布有前臂背侧皮神经及桡神经",
		"goodfor":"肘臂部痪痛，麻木，挛急",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"LI13",
		"belonging":"手阳明大肠经",
		"name":"手五里",
		"pos":"在臂外侧，当曲池与肩髃连线上，曲池上3寸处",
		"anatomy":"在肱骨桡侧，为肱桡肌起点，外侧为肱三头肌前缘；稍深为桡侧副动脉；布有前臂背侧皮神经，深层内侧为桡神经",
		"goodfor":"肘臂挛痛，瘰疬",
		"method":"避开动脉，直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"LI14",
		"belonging":"手阳明大肠经",
		"name":"臂臑",
		"pos":"在臂外侧，三角肌止点处，当曲池与肩髃连线上，曲池上七寸处",
		"anatomy":"在肱骨桡侧，三角肌下端，肱三头肌外侧头的前缘；有旋肱后动脉的分支及肱深动脉；布有前臂背侧皮神经，深层有桡神经本干",
		"goodfor":"肩臂痛，颈项拘挛，瘰疬，目疾",
		"method":"直刺或向上斜刺0.8 - 1.5寸",
		"extra":""
	}, {
		"id":"LI15",
		"belonging":"手阳明大肠经",
		"name":"肩髃",
		"pos":"在臂外侧，三角肌上，臂外展，或向前平伸时，当肩峰前下方向凹陷处",
		"anatomy":"有旋肱后动、静脉；布有锁骨上神经，腋神经",
		"goodfor":"肩臂挛痛不遂，瘾疹，瘰病",
		"method":"直刺或向下斜刺0.8 - 1.5寸",
		"extra":"手阳明经与阳跷脉交会穴"
	}, {
		"id":"LI16",
		"belonging":"手阳明大肠经",
		"name":"巨骨",
		"pos":"在肩上部，当锁骨肩峰端与肩胛冈之间凹陷处",
		"anatomy":"在斜方肌与冈上肌中；深层有肩胛上动、静脉；布有锁骨上神经分支，副神经分支，深层有肩胛上神经",
		"goodfor":"肩臂挛痛不遂，瘰疬，瘿气",
		"method":"直刺，微斜向外下方，进针0.5 - 1寸",
		"extra":"手阳明经与阳跷脉交会穴"
	}, {
		"id":"LI17",
		"belonging":"手阳明大肠经",
		"name":"天鼎",
		"pos":"在颈外侧部，胸锁乳突肌后缘，当结喉旁，扶突与缺盆连线中点",
		"anatomy":"在胸锁乳突肌下部后缘，浅层为颈阔肌，深层为中斜角肌起点；有颈外浅静脉；为副神经、颈皮神经在胸锁乳突肌后缘穿出处，深层为膈神经的起点",
		"goodfor":"暴喑气梗，咽喉肿痛，瘰疬，瘿气",
		"method":"直刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"LI18",
		"belonging":"手阳明大肠经",
		"name":"扶突",
		"pos":"在颈外侧部，结喉旁，当胸锁乳突肌前、后缘之间",
		"anatomy":"在胸锁乳突肌胸骨头间颈阔肌中，深层为肩胛提肌起始点；深层内侧有颈升动脉；布有耳大神经，颈皮神经，枕小神经及副神经",
		"goodfor":"咳嗽 ，气喘 ，咽喉肿痛，暴喑，瘰疬，瘿气",
		"method":"直刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"LI19",
		"belonging":"手阳明大肠经",
		"name":"口禾髎",
		"pos":"在上唇部，鼻孔外缘直下，平水沟穴",
		"anatomy":"在上颌骨犬齿窝部，上唇方肌止端；有面动、静脉的上唇支；布有面神经、三叉神经第二支下支与眶下神经的吻合丛",
		"goodfor":"鼻塞，鼽衄，口歪，口噤",
		"method":"直刺或斜刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"LI20",
		"belonging":"手阳明大肠经",
		"name":"迎香",
		"pos":"在鼻翼外缘中点旁，当鼻唇沟中间",
		"anatomy":"在上唇方肌中，深部为梨状孔的边缘； 有面动、静脉及眶下动、静脉分支；布有面神经与眶下神经的吻合丛",
		"goodfor":"①鼻塞 鼻衄 鼻渊 鼻鼽②面瘫 面肿 面痒 面肌瞤动③胆道蛔虫症 ",
		"method":"斜刺或平刺0.3 - 0.5寸",
		"extra":"(l)手、足阳明经交会穴(2)《外台》：不宜灸"
	}, {
		"id":"ST1",
		"belonging":"足阳明胃经",
		"name":"承泣",
		"pos":"在面部，瞳孔直下，当眼球与眶下缘之间",
		"anatomy":"在眶下缘上方，眼轮匝肌中，深层眶内有眼球下直肌，下斜肌；有眶下动、静脉分支，眼动、静脉的分支；布有眶下神经分支及动眼神经下支的肌支，面神经分支",
		"goodfor":"目赤肿痛，迎风流泪，夜盲等目疾；眼睑瞤动，口眼歪斜",
		"method":"以左手拇指向上轻推眼球，紧靠眶缘缓慢直刺0.5 - 1.0寸，不宜提插，以防刺破血管引起血肿出针时稍加按压，以防出血",
		"extra":"足阳明经、阳跷、任脉交会穴"
	}, {
		"id":"ST2",
		"belonging":"足阳明胃经",
		"name":"四白",
		"pos":"在面部，瞳孔直下，当眶下孔凹陷处",
		"anatomy":"在眶下孔处，当眼轮匝肌和上唇方肌之间；有面动、静脉分支，眶下动、静脉 有面神经分支，当眶下神经处",
		"goodfor":"①目疾　　　②面瘫　眼睑瞤动③胆道蛔虫 ",
		"method":"直刺或斜刺0.3 - 0.5寸不可深刺",
		"extra":""
	}, {
		"id":"ST3",
		"belonging":"足阳明胃经",
		"name":"巨髎",
		"pos":"在面部，瞳孔直下，平鼻翼下缘处，当鼻唇沟外侧",
		"anatomy":"浅层为上唇方肌，深层为犬齿肌；有面动、静脉及眶下动、静脉；布有面神经及眶下神经的分支",
		"goodfor":"口眼歪斜，眼睑瞤动，鼻衄，齿痛，唇颊肿",
		"method":"斜刺或平刺0.3 - 0.5寸",
		"extra":"足阳明胃经与阳跷脉交会穴"
	}, {
		"id":"ST4",
		"belonging":"足阳明胃经",
		"name":"地仓",
		"pos":"口角旁约0.4寸，上直对瞳孔",
		"anatomy":"在口轮匝肌中，深层为颊肌；有面动、静脉；布有面神经和眶下神经分支，深层为颊肌神经的末支",
		"goodfor":"面瘫，齿痛，面痛，颊肿",
		"method":"斜刺或平刺0.5 - 0.8寸",
		"extra":"手足阳明经，阳跷脉交会穴"
	}, {
		"id":"ST5",
		"belonging":"足阳明胃经",
		"name":"大迎",
		"pos":"在下颌角前方，咬肌附着部前缘，当面动脉搏动处",
		"anatomy":"在咬肌附着部前缘；前方有面动、静脉；布有面神经及颊神经",
		"goodfor":"口歪，口噤，颊肿，齿痛",
		"method":"避开动脉，斜刺或平刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"ST6",
		"belonging":"足阳明胃经",
		"name":"颊车",
		"pos":"在面颊部，下颌角前上方约1横指(中指)，当咀嚼时咬肌隆起，按之凹陷处",
		"anatomy":"在下颌角前方，有咬肌；有咬肌动、静脉；布有耳大神经，面神经及咬肌神经",
		"goodfor":"口歪，齿痛，颊肿，口噤不语",
		"method":"直刺0.3 - 0.5寸，平刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"ST7",
		"belonging":"足阳明胃经",
		"name":"下关",
		"pos":"在面部耳前方，当颧弓与下颌切迹所形成的凹陷中",
		"anatomy":"当颧弓下缘，皮下有腮腺，为咬肌起始部；有面横动、静脉，最深层为上颌动、静脉；正当面神经颧眶支及耳颞神经分支，最深层为下颌神经",
		"goodfor":"耳聋，耳鸣，聤耳；齿痛，口噤，口眼歪斜",
		"method":"直刺0.5 - 1寸",
		"extra":"足阳明、足少阳经交会穴"
	}, {
		"id":"ST8",
		"belonging":"足阳明胃经",
		"name":"头维",
		"pos":"在头侧部，当额角发际上0.5寸，头正中线旁4.5寸",
		"anatomy":"在颞肌上缘帽状腱膜中；有颞浅动、静脉的额支；布有耳额神经的分支及面神经额 颖支",
		"goodfor":"头痛，目眩，口痛，流泪，眼睑瞤动",
		"method":"平刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"ST9",
		"belonging":"足阳明胃经",
		"name":"人迎",
		"pos":"在颈部，喉结旁，当胸锁乳突肌的前缘，颈总动脉搏动处",
		"anatomy":"有颈阔肌，在胸锁乳突肌前缘与甲状软骨接触部；有甲状腺上动脉；当颈内、外动脉分歧处，有颈前浅静脉，外为颈内静脉；布有颈皮神经，面神经颈支，深层颈动脉球，最深层为交感神经干，外侧有舌下神经降支及迷走神经",
		"goodfor":"咽喉肿痛，气喘，瘰疬，瘿气，高血压",
		"method":"避开颈总动脉，直刺0.3 - 0.8寸",
		"extra":"(l)足阳明、足少阳经交会穴(2)《甲乙》：禁不可灸"
	}, {
		"id":"ST10",
		"belonging":"足阳明胃经",
		"name":"水突",
		"pos":"在颈部，胸锁乳突肌的前缘，当人迎与气舍连线的中点",
		"anatomy":"有颈阔肌，在甲状软骨外侧，胸锁乳突肌与肩胛舌骨肌上腹的交叉点；外侧为颈总动脉；布有颈皮神经，深层为交感神经发出的心上神经及交感干",
		"goodfor":"咽喉肿痛，咳嗽，气喘",
		"method":"直刺0.3 - 0.8寸",
		"extra":""
	}, {
		"id":"ST11",
		"belonging":"足阳明胃经",
		"name":"气舍",
		"pos":"在颈部，当锁骨内侧端的上缘，胸锁乳突肌的胸骨头与锁骨头之间",
		"anatomy":"有颈阔肌，胸锁乳突肌起始部；有颈前浅静脉，深部为颈总动脉；布有锁骨上神经前支，舌下神经的分支",
		"goodfor":"咽喉肿病，气喘，呃逆，瘿瘤，瘰疬，颈项强",
		"method":"直刺0.3 - 0.5寸",
		"extra":"本经气舍至乳根诸穴，深部有大动脉及肺、肝等重要脏器不可深刺"
	}, {
		"id":"ST12",
		"belonging":"足阳明胃经",
		"name":"缺盆",
		"pos":"在锁骨上窝中央，距前正中线4寸",
		"anatomy":"在锁骨上窝之中点，有颈阔肌，肩胛舌骨肌；上方有颈横动脉；布有锁骨上神经中支，深层正当肩丛的锁骨上部",
		"goodfor":"咳嗽 ，气喘，咽喉肿痛，缺盆中痛，瘰疬",
		"method":"直刺或斜刺0.3 - 0.5寸",
		"extra":"《图翼》：孕妇禁针"
	}, {
		"id":"ST13",
		"belonging":"足阳明胃经",
		"name":"气户",
		"pos":"在胸部，当锁骨中点下缘，距前正中线4寸",
		"anatomy":"在锁骨下方，胸大肌起始部，深层上方的锁骨下肌；有胸肩峰动、静脉分支，外上方为锁骨下静脉；为锁骨上神经，胸前神 经分支分布处",
		"goodfor":"咳嗽，气喘，呃逆，胸胁支满，胸痛",
		"method":"斜刺或平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"ST14",
		"belonging":"足阳明胃经",
		"name":"库房",
		"pos":"在胸部，当第1肋间隙，距前正中线4寸",
		"anatomy":"在第一肋间隙有胸大肌、胸小肌，深层为肋间内、外肌，有胸肩峰动、静减及胸外侧动、静脉分支；布有胸前神经分支",
		"goodfor":"咳嗽，气喘，咳唾脓血，胸肋胀痛",
		"method":"斜刺或平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"ST15",
		"belonging":"足阳明胃经",
		"name":"屋翳",
		"pos":"在胸部，当第2肋间隙，距前正中线4寸",
		"anatomy":"在第二肋间隙，有胸大肌，胸小肌，深层为肋间内外肌；有胸肩峰动、静脉分支；布有胸前神经分支",
		"goodfor":"咳嗽，气喘，咳唾脓血，胸肋胀痛，乳痈",
		"method":"斜刺或平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"ST16",
		"belonging":"足阳明胃经",
		"name":"膺窗",
		"pos":"在胸部，当第3肋间隙，距前正中线4寸",
		"anatomy":"第三肋间隙，有胸大肌，深层为肋间内、外肌；有胸外侧动、静脉；布有胸前神经分支",
		"goodfor":"咳嗽，气喘，胸肋胀痛，乳痈",
		"method":"斜刺或平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"ST17",
		"belonging":"足阳明胃经",
		"name":"乳中",
		"pos":"在胸部，当第4肋间隙，乳头中央，距前正中线4寸",
		"anatomy":"本穴不针不灸，只作胸腹部腧穴的定位标志",
		"goodfor":"",
		"method":"",
		"extra":""
	}, {
		"id":"ST18",
		"belonging":"足阳明胃经",
		"name":"乳根",
		"pos":"在胸部，当乳头直下，乳房根部，当第5肋间隙，距前正中线4寸",
		"anatomy":"在第五肋间隙，胸大肌下部，深层有肋间内、外肌；有肋间动脉，胸壁浅静脉；有第五肋间神经外侧皮支，深层为肋间神经干",
		"goodfor":"咳嗽 ，气喘，呃逆，胸痛，乳痈，乳汁少",
		"method":"斜刺或平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"ST19",
		"belonging":"足阳明胃经",
		"name":"不容",
		"pos":"在上腹部，当脐中上6寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处，探层为腹横肌；有第七肋间动、静脉分支及腹壁上动、静脉；当第七肋间神经分支处",
		"goodfor":"呕吐，胃病，食欲不振，腹胀",
		"method":"直刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"ST20",
		"belonging":"足阳明胃经",
		"name":"承满",
		"pos":"在上腹部，当脐中上5寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处，深层为腹横肌；有第七肋间动、静脉分支及腹壁上动、静脉；分布；当第七肋间神经分支处",
		"goodfor":"胃痛，吐血，食欲不振，腹胀",
		"method":"直刺0.8 - 1寸",
		"extra":""
	}, {
		"id":"ST21",
		"belonging":"足阳明胃经",
		"name":"梁门",
		"pos":"在上腹部，当脐中上4寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处，深层为腹横肌；有第七肋间动、静脉分支及腹壁上动、静脉；当第八肋间神经分支处(右侧深部当肝下缘，胃幽门部)",
		"goodfor":"胃痛，呕吐，食欲不振，腹胀，泄泻",
		"method":"直刺0.8 - 1.2寸",
		"extra":""
	}, {
		"id":"ST22",
		"belonging":"足阳明胃经",
		"name":"关门",
		"pos":"在上腹部，当脐中上3寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处；有第八肋间动、静脉分支及腹壁上动、静脉分支；布有第八肋间神经分支(内部为横结肠)",
		"goodfor":"腹胀，腹痛，肠鸣泄泻，水肿",
		"method":"直刺0.8 - 1.2寸",
		"extra":""
	}, {
		"id":"ST23",
		"belonging":"足阳明胃经",
		"name":"太乙",
		"pos":"在上腹部，当脐中上2寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处；有第八肋间动、静脉分支及其腹壁下动、静脉分支；布有第八肋间神经分支(内部为横结肠)",
		"goodfor":"胃病，心烦，癫狂",
		"method":"直刺0.8 - 1.2寸",
		"extra":""
	}, {
		"id":"ST24",
		"belonging":"足阳明胃经",
		"name":"滑肉门",
		"pos":"在上腹部，当脐中上1寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处；有第九肋间动、静脉分支及腹壁下动、静分支；布有第九肋间神经分支(内部为小肠)",
		"goodfor":"胃痛，呕吐，癫狂",
		"method":"直刺0.8 - 1.2寸",
		"extra":""
	}, {
		"id":"ST25",
		"belonging":"足阳明胃经",
		"name":"天枢",
		"pos":"脐中旁开2寸",
		"anatomy":"当腹直肌及其鞘处；有第九肋间动、静脉分支及腹壁下动、静脉分支；布有第十肋间神经分支(内部为小肠)",
		"goodfor":"腹胀肠鸣 ，绕脐痛 ，便秘 ，泄泻，痢疾； 月经不调痛经等妇科疾患",
		"method":"直刺1 - 1.5寸",
		"extra":"(l)大肠的募穴；(2)《千金》孕妇不可灸"
	}, {
		"id":"ST26",
		"belonging":"足阳明胃经",
		"name":"外陵",
		"pos":"在下腹部，当脐中下1寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处；布有第十肋间动、静脉分支及腹壁下动、静脉分支；布有第十肋间神经分支(内部为小肠)",
		"goodfor":"腹痛，疝气，痛经",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"ST27",
		"belonging":"足阳明胃经",
		"name":"大巨",
		"pos":"在下腹部，当脐中下2寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处；有第十一肋间动、静脉分支，外侧为腹壁下动、静脉；布有第十一肋间神经(内部为小肠)",
		"goodfor":"小腹胀满，小便不利，疝气，遗精，早泄",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"ST28",
		"belonging":"足阳明胃经",
		"name":"水道",
		"pos":"在下腹部，当脐中下3寸，距前正中线2寸",
		"anatomy":"当腹直肌及其鞘处；有第十二肋间动、静脉分支，外侧为腹壁下动、静脉；布有第十二肋间神经(内部为小肠)",
		"goodfor":"小腹胀满，小便不利，痛经，不孕，疝气",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"ST29",
		"belonging":"足阳明胃经",
		"name":"归来",
		"pos":"当脐中下4寸，距前正中线2寸",
		"anatomy":"在腹直肌外缘，有腹内斜肌，腹横肌腱膜；外侧有腹壁下动、静脉；布有髂腹下神经",
		"goodfor":"①阴挺 闭经 带下 月经不调 不孕不育 遗精 阳萎 阴痛 ②下腹痛 疝气",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"ST30",
		"belonging":"足阳明胃经",
		"name":"气冲",
		"pos":"在腹股沟稍上方，当脐中下5寸，距前正中线2寸",
		"anatomy":"在耻骨结节外上方，有腹外斜肌腱膜，在腹内斜肌、腹膜肌下部；有腹壁浅动、静脉分支，外壁为腹壁下动、静脉；布有髂腹股沟神经",
		"goodfor":"肠鸣腹痛 ，疝气，月经不调，不孕，阳萎，阴肿",
		"method":"直刺0.5 - 1寸",
		"extra":"冲脉所起"
	}, {
		"id":"ST31",
		"belonging":"足阳明胃经",
		"name":"髀关",
		"pos":"在大腿前面，当髂前上棘与髌底外侧端的连线上，屈髋时，平会阴，居缝匠肌外侧凹陷处",
		"anatomy":"在缝匠肌和阔筋膜张肌之间；深层有旋股外侧动、静脉分支；布有股外侧皮神经",
		"goodfor":"腰痛膝冷，痿痹，腹痛",
		"method":"直刺1 - 2寸",
		"extra":""
	}, {
		"id":"ST32",
		"belonging":"足阳明胃经",
		"name":"伏兔",
		"pos":"当髂前上棘与髌底外侧端的连线上，髌骨外上缘上6寸",
		"anatomy":"在股直肌的肌腹中有旋股外侧动、静脉分支；布有股前皮神经，股外侧皮神经",
		"goodfor":"腰痛膝冷，下肢麻痹等下肢病症；疝气，脚气",
		"method":"直刺l - 2寸",
		"extra":""
	}, {
		"id":"ST33",
		"belonging":"足阳明胃经",
		"name":"阴市",
		"pos":"在大腿前面，当髂前上棘与髌底外侧端的连线上，髌底上3寸",
		"anatomy":"在股直肌和股外侧肌之间；有旋股外侧动脉降支；布有股前皮神经，股外侧皮神经",
		"goodfor":"腿膝痿痹，屈伸不利、疝气，腹胀腹痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"ST34",
		"belonging":"足阳明胃经",
		"name":"梁丘",
		"pos":"当髂前上棘与髌底外侧端的连线上，髌骨外上缘上3寸",
		"anatomy":"在股直肌和股外侧肌之间；有旋股外侧动脉降支；布有股前皮神经，股外侧皮神经",
		"goodfor":"膝肿痛，下肢不遂，胃痛，乳痈",
		"method":"直刺1 - 1.2寸",
		"extra":"足阳明经郄穴"
	}, {
		"id":"ST35",
		"belonging":"足阳明胃经",
		"name":"犊鼻",
		"pos":"屈膝，在膝部，髌骨与髌韧带外侧凹陷中",
		"anatomy":"在髌韧带外缘；有膝关节动、静脉网；布有腓肠外侧皮神经及腓总神经关节支",
		"goodfor":"膝痛，下肢麻痹，屈伸不利，脚气",
		"method":"向后内斜刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"ST36",
		"belonging":"足阳明胃经",
		"name":"足三里",
		"pos":"在小腿前外侧，当犊鼻下3寸，距胫骨前嵴外一横指",
		"anatomy":"在胫骨前肌，趾长伸肌之间；有胫前动、静脉；为腓肠外侧皮神经及隐神经的 皮支分布处，深层当腓深神经",
		"goodfor":"①胃痛　腹痛 腹胀　呕吐 泄泻　痢疾　便秘　肠痈②下肢痿痹　瘫痪　脚气水肿③强壮保健穴　虚劳赢瘦④眩晕　癲狂痫⑤乳痈　乳汁少",
		"method":"直刺1 - 2寸",
		"extra":"(l)足阳明经所入为[合](2)本穴有强壮作用，为保健要穴"
	}, {
		"id":"ST37",
		"belonging":"足阳明胃经",
		"name":"上巨虚",
		"pos":"在小腿前外侧，当犊鼻下6寸，足三里下3寸",
		"anatomy":"在胫骨前肌中；有胫前动、静脉；布有腓肠外侧皮神经及隐神经的皮支，深层当腓深神经",
		"goodfor":"①腹痛　肠鸣　泄泻　痢疾②下肢痿痹　瘫痪　脚气 ③便秘　肠痈",
		"method":"直刺1 - 2寸",
		"extra":"大肠经下合穴"
	}, {
		"id":"ST38",
		"belonging":"足阳明胃经",
		"name":"条口",
		"pos":"在小腿前外侧，当犊鼻下8寸，上巨虚下2寸",
		"anatomy":"在胫骨前肌中；有胫前动、静脉；布有腓肠外侧皮神经及隐神经的皮支，深层当腓深神经",
		"goodfor":"脘腹疼痛，下肢痿痹，转筋，跗肿，肩臂痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"ST39",
		"belonging":"足阳明胃经",
		"name":"下巨虚",
		"pos":"在小腿前外侧，当犊鼻下9寸，上巨虚下3寸",
		"anatomy":"在胫骨前肌与趾长伸肌之间，深层为胫长伸肌；有胫前动、静脉；布有腓浅神经分支，深层为腓深神经",
		"goodfor":"①腹痛　肠鸣　泄泻　痢疾②下肢痿痹　瘫痪　脚气",
		"method":"直刺1 - 1.5寸",
		"extra":"小肠经下合穴"
	}, {
		"id":"ST40",
		"belonging":"足阳明胃经",
		"name":"丰隆",
		"pos":"在小腿前外侧，当外踝尖上8寸，条口外，距胫骨前嵴两横指（中指）",
		"anatomy":"在趾长伸肌外侧和腓骨短肌之间；有胫前动脉分支；当腓浅神经处",
		"goodfor":"①治痰的要穴：痰多咳嗽 头痛 眩晕 癫狂痫 ②下肢痿痹 水肿",
		"method":"直刺1 - 1.5寸",
		"extra":"足阳明经络穴治痰要穴"
	}, {
		"id":"ST41",
		"belonging":"足阳明胃经",
		"name":"解溪",
		"pos":"足背踝关节横纹中央凹陷处，当拇长伸肌踺与趾长伸肌腱之间",
		"anatomy":"在拇长伸肌膜与趾长伸肌胫之间；有胫前动、静脉；浅部当腓浅神经，深层当腓深神经",
		"goodfor":"①下肢痿痹 瘫痪 垂足 足踝肿痛②脘腹胀痛　便秘",
		"method":"直刺0.5 - 1寸",
		"extra":"足阳明经所行为[经]"
	}, {
		"id":"ST42",
		"belonging":"足阳明胃经",
		"name":"冲阳",
		"pos":"在足背最高处，当拇长伸肌腱和趾长伸肌腱之间，足背动脉搏动处",
		"anatomy":"在趾长伸肌腱外侧；有足背动、静脉及足背静脉网；当腓浅神经的足背内侧皮神经第二支本干处，深层为腓深神经",
		"goodfor":"口眼歪斜，面肿，齿痛，癫狂痫，胃病，足痿无力",
		"method":"避开动脉，直刺0.3 - 0.5寸",
		"extra":"足阳明经所过为[原]"
	}, {
		"id":"ST43",
		"belonging":"足阳明胃经",
		"name":"陷谷",
		"pos":"在足背，当第2、3跖骨结合部前方凹陷处",
		"anatomy":"有第二跖骨间肌；有足背静脉网；布有足背内侧皮神经",
		"goodfor":"面目浮肿，水肿，肠鸣腹痛，足背肿痛",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"足阳明经所注为[输]"
	}, {
		"id":"ST44",
		"belonging":"足阳明胃经",
		"name":"内庭",
		"pos":"在足背当第2、3趾间缝纹端",
		"anatomy":"有足背静脉网；布有腓浅神经足背支",
		"goodfor":"①齿痛　咽喉痛　口糜 鼻衄 面瘫　面痛　热病 ②胃痛吐酸　腹痛腹胀 泄泻　痢疾　便秘　③足背肿痛",
		"method":"直刺或斜刺0.5 - 0.8寸",
		"extra":"足阳明经所溜为[荥]"
	}, {
		"id":"ST45",
		"belonging":"足阳明胃经",
		"name":"厉兑",
		"pos":"在足第2趾末节外侧，距趾甲角0.1寸",
		"anatomy":"有趾背动脉形成的动脉网；布有腓浅神经的足背支",
		"goodfor":"鼻衄，齿痛，咽喉肿痛，腹胀，热病，多梦， 癫狂",
		"method":"浅刺0.1寸",
		"extra":"足阳明经所出为[井]"
	}, {
		"id":"SP1",
		"belonging":"足太阴脾经",
		"name":"隐白",
		"pos":"在足大趾内侧趾甲根角旁0.1寸",
		"anatomy":"有趾背动脉；为腓浅神经的足背支及足底内侧神经",
		"goodfor":"①崩漏 月经过多 便血　尿血②胃痛　呕吐 腹胀　泄泻③癫狂痫 惊风 多梦",
		"method":"浅刺0.1寸",
		"extra":"足太阴经所出为[井]"
	}, {
		"id":"SP2",
		"belonging":"足太阴脾经",
		"name":"大都",
		"pos":"在足内侧缘，当足大趾本节（第1跖趾关节）前下方赤白肉际凹陷处",
		"anatomy":"在拇展肌止点；有足底内侧动、静脉的分支；布有足底内侧神经的趾底固有神经",
		"goodfor":"腹胀，胃痛，呕吐，泄泻，便秘，热病",
		"method":"直刺0.3 - 0.5寸",
		"extra":"足太阴经所溜为[荥]"
	}, {
		"id":"SP3",
		"belonging":"足太阴脾经",
		"name":"太白",
		"pos":"在足内侧缘，当足大趾本节（第1跖骨关节）后下方赤白肉际凹陷处",
		"anatomy":"在拇展肌中；有足背静脉网，足底内侧动脉及足跗内侧动脉分支；布有隐神经及腓浅神经分支",
		"goodfor":"胃痛，腹胀，肠鸣，泄泻，便秘，痔漏，脚气，体重节痛",
		"method":"直刺0.5 - 0.8寸",
		"extra":"足太阴经所注为[输]；脾经原穴"
	}, {
		"id":"SP4",
		"belonging":"足太阴脾经",
		"name":"公孙",
		"pos":"当第一跖骨基底部的前下方，赤白肉际处",
		"anatomy":"在拇展肌中；有跗内侧动脉分支及足背静脉网；布有隐神经及腓浅神经分支",
		"goodfor":"胃痛，呕吐，腹痛，泄泻，痢疾",
		"method":"直刺0.6 - 1.2寸",
		"extra":"足太阴经络穴；八脉交会穴之一，通于冲脉"
	}, {
		"id":"SP5",
		"belonging":"足太阴脾经",
		"name":"商丘",
		"pos":"在足内踝前下方凹陷中，当舟骨结节与内踝尖连线的中点处",
		"anatomy":"有跗内侧动脉，大隐静脉；布有隐神经及腓浅神经分支丛",
		"goodfor":"腹胀，泄泻，便秘，黄疸，足踝痛",
		"method":"直刺0.5 - 0.8寸",
		"extra":"足太阴经所行为[经]"
	}, {
		"id":"SP6",
		"belonging":"足太阴脾经",
		"name":"三阴交",
		"pos":"足内踝尖上3寸，胫骨内侧缘后方",
		"anatomy":"在胫骨后缘和比目鱼肌之间，深层有屈趾长肌；有大隐静脉，胫后动、静脉；有小腿内侧皮神经，深层后方有胫神经",
		"goodfor":"①腹胀肠鸣　泄泻　②月经不调　痛经 闭经 带下 阴挺 难产 不孕 不育 阳萎 遗精　遗尿 小便不利　水肿③下肢痿痹　脚气　疝气　　④失眠",
		"method":"直刺1 - 1.5寸",
		"extra":"(1)足太阴、少阴、厥阴经交会穴(2)孕妇禁针"
	}, {
		"id":"SP7",
		"belonging":"足太阴脾经",
		"name":"漏谷",
		"pos":"在小腿内侧，当内踝尖与阴陵泉的连线上，距内踝尖6寸，胫骨内侧缘后方",
		"anatomy":"在胫骨后缘与比目鱼肌之间，深层有屈趾长肌；有大隐静脉，肢后动、静脉；有小腿内侧皮神经，深层内侧后方有胫神经",
		"goodfor":"腹胀，肠鸣，小便不利，遗精，下肢痿痹",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"SP8",
		"belonging":"足太阴脾经",
		"name":"地机",
		"pos":"在小腿内侧，当内踝尖与阴陵泉的连线上，阴陵泉下3寸",
		"anatomy":"在胫骨后缘与比目鱼肌之间；前方有大隐静脉及膝最上动脉的末支，深层有胫后动、静脉；布有小腿内侧皮神经，深层后方有胫神经",
		"goodfor":"腹痛，泄泻，小便不利，水肿，月经不调，痛经，遗精",
		"method":"直刺1 - 1.5寸",
		"extra":"足太阴经郄穴"
	}, {
		"id":"SP9",
		"belonging":"足太阴脾经",
		"name":"阴陵泉",
		"pos":"在小腿内侧，当胫骨内侧踝下方凹陷处",
		"anatomy":"在胫骨后缘和腓肠肌之间，比目鱼肌起点上；前方有大隐静脉，膝最上动脉，最深层有胫后动、静脉；布有小腿内侧皮神经本干，最深层有胫神经",
		"goodfor":"①腹胀 泄泻 黄疸②水肿 小便不利或失禁③膝关节痛",
		"method":"直刺1 - 2寸",
		"extra":"足太阴经所入为[合]祛湿要穴"
	}, {
		"id":"SP10",
		"belonging":"足太阴脾经",
		"name":"血海",
		"pos":"屈膝，髌底内上缘上2寸，当股四头肌内侧头的隆起处",
		"anatomy":"在股骨内上髁上缘，股内侧肌中间；有股动、静脉肌支；布有股前皮神经及股神经肌支",
		"goodfor":"①月经不调 崩漏　闭经痛经②皮肤病：瘾疹　湿疹　③膝股内侧痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"SP11",
		"belonging":"足太阴脾经",
		"name":"箕门",
		"pos":"在大腿内侧，当血海与冲门连线上，血海上6寸",
		"anatomy":"在缝匠肌内侧缘，深层有大收肌；有大隐静脉，深层之外方有股动、静脉；布有股前皮神经，深部有隐神经",
		"goodfor":"小便不利，遗尿，腹股沟肿痛",
		"method":"避开动脉，直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"SP12",
		"belonging":"足太阴脾经",
		"name":"冲门",
		"pos":"在腹股沟外侧，距耻骨联合上缘中点3.5寸，当髂外动脉搏动处的外侧",
		"anatomy":"在腹股沟韧带中点外侧的上方，在腹外斜肌腱膜及内斜肌下部；内侧为股动、静脉；布有股神经",
		"goodfor":"腹痛，疝气，崩漏，带下",
		"method":"避开动脉，直刺0.5 - 1寸",
		"extra":"足太阴、厥阴经交会穴"
	}, {
		"id":"SP13",
		"belonging":"足太阴脾经",
		"name":"府舍",
		"pos":"在下腹部，当脐中下4寸，冲门上方0.7寸，距前正中线4寸",
		"anatomy":"在腹股沟韧带上方外侧，腹外斜肌腱膜及腹内斜肌下部，深层为腹横肌下部；布有腹壁浅动脉，肋间动、静脉；布有髂腹股沟神经(右当盲肠下部，左当乙状结肠下部)",
		"goodfor":"腹痛，疝气，积聚",
		"method":"直刺1 - 1.5寸",
		"extra":"足太阴、厥阴经与阴维脉交会穴"
	}, {
		"id":"SP14",
		"belonging":"足太阴脾经",
		"name":"腹结",
		"pos":"在下腹部，大横下1.3寸，距前正中线4寸",
		"anatomy":"在腹内、外斜肌及腹横肌肌部；有第十一肋间动、静脉；布有第十一肋间神经",
		"goodfor":"腹痛，泄泻，疝气",
		"method":"直刺1 - 2寸",
		"extra":""
	}, {
		"id":"SP15",
		"belonging":"足太阴脾经",
		"name":"大横",
		"pos":"在腹中部，距脐中4寸",
		"anatomy":"在腹外斜肌肌部及腹横肌肌部；布有第十一肋间动、静脉；布有第十二肋间神经",
		"goodfor":"泄泻，便秘，腹痛",
		"method":"直刺1 - 2寸",
		"extra":"足太阴与阴维脉交会穴"
	}, {
		"id":"SP16",
		"belonging":"足太阴脾经",
		"name":"腹哀",
		"pos":"在上腹部，当脐中上3寸，距前正中线4寸",
		"anatomy":"在腹内外斜肌及腹横肌肌部；布有第八肋间动、静脉；布有第八肋间神经",
		"goodfor":"消化不良，腹痛，便秘，痢疾",
		"method":"避开腋动脉，直刺或斜刺0.3 - 0.5寸",
		"extra":"足太阴与阴维脉交会穴"
	}, {
		"id":"SP17",
		"belonging":"足太阴脾经",
		"name":"食窦",
		"pos":"在胸外侧部，当第5肋间隙，距前正中线6寸",
		"anatomy":"在第五肋间隙，前锯肌中，深层有肋间内、外肌；布有胸外侧动、静脉，胸腹壁动、静脉；布有第五肋间神经外侧皮支",
		"goodfor":"胸胁胀痛，噫气，翻胃，腹胀，水肿",
		"method":"斜刺或向外平刺0.5 - 0.8寸",
		"extra":"本经食窦至大包诸穴，深部为肺脏，不可深刺"
	}, {
		"id":"SP18",
		"belonging":"足太阴脾经",
		"name":"天溪",
		"pos":"在胸外侧部，当第4肋间隙，距前正中线6寸",
		"anatomy":"在第四肋间隙，胸大肌外下缘，下层为前锯肌，再深层为肋间内、外肌；有胸外侧动、静脉分支，胸腹壁动、静脉；第四肋间动、静脉；布有第四肋间神经",
		"goodfor":"胸胁疼痛，咳嗽，乳痛，乳汁少",
		"method":"斜刺或向外平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"SP19",
		"belonging":"足太阴脾经",
		"name":"胸乡",
		"pos":"在胸外侧部，当第3肋间隙，距前正中线6寸",
		"anatomy":"在第三肋间隙，胸大肌、胸小肌外缘，前锯肌中，下层为肋间内、外肌；有胸外侧动、静脉，第三肋间动、静脉；布有第三肋间神经",
		"goodfor":"胸胁胀痛",
		"method":"斜刺或向外平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"SP20",
		"belonging":"足太阴脾经",
		"name":"周荣",
		"pos":"在胸外侧部，当第２肋间隙，距前正中线6寸",
		"anatomy":"在第二肋间隙，胸大肌中，下层为胸小肌，肋间内、外肌；有胸外侧动、静脉，第二肋间动、静脉；布有胸前神经分又，正当第一肋间神经",
		"goodfor":"咳嗽，气逆，胸胁胀满",
		"method":"斜刺或向外平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"SP21",
		"belonging":"足太阴脾经",
		"name":"大包",
		"pos":"在侧胸部，腋中线上，当第6肋间隙处",
		"anatomy":"在第六肋间隙，前锯肌中；有胸背动、静脉及第六肋间动、静脉；布有第六肋间神经，当胸长神经直系的末端",
		"goodfor":"气喘，胸胁病，全身疼痛，四肢无力",
		"method":"斜刺或向后平刺0.5 - 0.8寸",
		"extra":"脾之大络"
	}, {
		"id":"HT1",
		"belonging":"手少阴心经",
		"name":"极泉",
		"pos":"在腋窝正中，腋动脉搏动处",
		"anatomy":"在胸大肌的外下缘，深层为喙肱肌；外侧为腋动脉；布有尺神经，正中神经，前臂内侧皮神经及臂内侧皮神经",
		"goodfor":"①上肢瘫痪 肩臂痛 胁肋疼痛 ②瘰疬",
		"method":"避开腋动脉，直刺或斜刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"HT2",
		"belonging":"手少阴心经",
		"name":"青灵",
		"pos":"在臂内侧，当极泉与少海的连线上，肘横纹上3寸，肱二头肌的内侧沟中",
		"anatomy":"当肱二头肌内侧沟处，有肱三头肌；有贵要静脉，尺侧上副动脉；布有前臂内侧皮神经，尺神经",
		"goodfor":"头痛振寒，目黄，胁痛，肩臂疼痛",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"HT3",
		"belonging":"手少阴心经",
		"name":"少海",
		"pos":"屈肘，当肘横纹内侧端与肱骨内上髁连线的中点处",
		"anatomy":"有旋前圆肌，肱肌；有贵要静脉，尺侧上下副动脉，尺返动脉；布有前臂内侧皮神经，外前方有正中神经",
		"goodfor":"心痛，肘臂挛痛，瘰疬，头项痛，腋胁痛",
		"method":"直刺0.5 - 1寸",
		"extra":"手少阴经所人为[合]"
	}, {
		"id":"HT4",
		"belonging":"手少阴心经",
		"name":"灵道",
		"pos":"在前臂掌侧，当尺侧腕屈肌腱的桡侧缘，腕横纹上1.5寸",
		"anatomy":"在尺侧腕屈肌与指浅屈肌之间，深层为指深屈肌；有尺动脉通过；布有前臂内侧皮神经，尺侧为尺神经",
		"goodfor":"心痛，暴喑，肘臂挛痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手少阴经所行为[经]"
	}, {
		"id":"HT5",
		"belonging":"手少阴心经",
		"name":"通里",
		"pos":"在前臂掌侧，当尺侧腕屈肌腱的桡侧缘，腕横纹上1寸",
		"anatomy":"在尺侧腕屈肌与指浅屈肌之间，深层为指深屈肌；有尺动脉通过；布有前臂内侧皮神经，尺侧为尺神经",
		"goodfor":"①心悸　怔忡　心痛　心烦 ②健忘　失眠　癫狂痫③腕臂痛 ④暴喑 哑症 舌强不语",
		"method":"直刺0.3 - 0.5寸不宜深刺，以免伤及血管和神经留针时，不可做屈腕动作",
		"extra":"手少阴经络穴"
	}, {
		"id":"HT6",
		"belonging":"手少阴心经",
		"name":"阴郄",
		"pos":"在前臂掌侧，当尺侧腕屈肌腱的桡侧缘， 腕横纹上1.5寸",
		"anatomy":"在尺侧腕屈肌与指浅屈肌之间，深层为指深屈肌；有尺动脉通过；布有前臂内侧皮神经，尺侧为尺神经",
		"goodfor":"①心悸　怔忡　心痛　心烦 ②健忘　失眠　癫狂痫 ③腕臂痛 ④吐血　衄血 骨蒸盗汗",
		"method":"直刺0.3 - 0.5寸同上",
		"extra":"手少阴经郄穴"
	}, {
		"id":"HT7",
		"belonging":"手少阴心经",
		"name":"神门",
		"pos":"在腕部，腕掌侧横纹尺侧端，尺侧腕屈肌腱的桡侧凹陷处",
		"anatomy":"在尺侧腕屈肌与指浅屈肌之间，深层为指深屈肌；有尺动脉通过；布有前臂内侧皮神经，尺侧为尺神经",
		"goodfor":"①心悸　怔忡　心痛　心烦 ②健忘　失眠　癫狂痫 ③腕臂痛 ④胸胁痛",
		"method":"同上",
		"extra":"手少阴经所注为[输]，心经原穴"
	}, {
		"id":"HT8",
		"belonging":"手少阴心经",
		"name":"少府",
		"pos":"在手掌面，第4、5掌骨之间，握拳时，当小指尖处",
		"anatomy":"在第四、五掌骨间，有第四蚓状肌，指浅、深屈肌腱，深部为骨间肌；有指掌侧总动、静脉；布有第四指掌侧固有神经",
		"goodfor":"心悸，胸痛，小便不利，遗尿，阴痒痛，小指挛痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手少阴经所溜为[荥]"
	}, {
		"id":"HT9",
		"belonging":"手少阴心经",
		"name":"少冲",
		"pos":"在小指末节桡侧，距指甲角0.1寸",
		"anatomy":"有指掌侧固有动、静脉所形成的动、静脉网；布有指掌侧固有神经",
		"goodfor":"心悸，心痛，胸胁痛，癫狂，热病，昏迷",
		"method":"浅刺0.1寸或点刺出血",
		"extra":"手少阴经所出为[井]"
	}, {
		"id":"SI1",
		"belonging":"手太阳小肠经",
		"name":"少泽",
		"pos":"在小指尺侧指甲根角旁0.1寸",
		"anatomy":"有指掌侧固有动、静脉，指背动脉形成的动、静脉网；布有尺神经手背支",
		"goodfor":"①乳汁少　乳痈 ②头痛　咽喉肿痛 ③昏迷　热病",
		"method":"浅刺0.1寸或点刺出血孕妇慎用",
		"extra":"手太阳经所出为[井]"
	}, {
		"id":"SI2",
		"belonging":"手太阳小肠经",
		"name":"前谷",
		"pos":"在手掌尺侧，微握拳，当小指本节(第5指掌关节）前的掌指横纹头赤白肉际",
		"anatomy":"在手掌尺侧，微握拳，当小指本节(第5指掌关节）前的掌指横纹头赤白肉际",
		"goodfor":"头痛，目痛，耳鸣，咽喉肿痛，乳少，热病",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手太阳经所溜为[荥]"
	}, {
		"id":"SI3",
		"belonging":"手太阳小肠经",
		"name":"后溪",
		"pos":"微握拳，第5指掌关节后的尺侧远侧掌横纹头赤白肉际",
		"anatomy":"在小指尺侧，第五掌骨小头后方，当小指展肌起点外缘；有指背动、静脉，手背静脉网；布有尺神经手背支",
		"goodfor":"①头项强痛　目赤痛 耳聋 咽喉肿痛　②肘臂挛痛　手指麻木　腰背痛 ③疟疾　癫狂痫",
		"method":"直刺0.5 - 1寸治手指挛痛可透刺合谷",
		"extra":"手太阳经所注为[输]；八脉交会穴之一，通督脉"
	}, {
		"id":"SI4",
		"belonging":"手太阳小肠经",
		"name":"腕骨",
		"pos":"在手掌尺侧，当第5掌骨基底与钩骨之间的凹陷处，赤白肉际",
		"anatomy":"在手背尺侧，小指展肌起点外缘；有腕背侧动脉(尺动脉分支)，手背静脉网；布有尺神经手背支",
		"goodfor":"头项强痛，耳鸣，目翳，黄疸，热病，疟疾，指挛腕痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手太阳经所过为[原]"
	}, {
		"id":"SI5",
		"belonging":"手太阳小肠经",
		"name":"阳谷",
		"pos":"在手腕尺侧，当尺骨茎突与三角骨之间的凹陷处",
		"anatomy":"当尺侧腕伸肌腱的尺侧缘；有腕背侧动脉；布有尺神经手背支",
		"goodfor":"头痛，目眩，耳鸣，耳聋，热病，癫狂痫，腕痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手太阳经所行为[经]"
	}, {
		"id":"SI6",
		"belonging":"手太阳小肠经",
		"name":"养老",
		"pos":"以手掌面向胸，当尺骨茎突桡侧骨缝凹陷中",
		"anatomy":"左尺骨背面，尺骨茎突上方，尺侧腕伸肌腱和小指固有伸肌腱之间；布有前臂骨间背侧动、静脉的末支，腕静脉网；有前臂背侧皮神经和尺神经",
		"goodfor":"目视不明，肩、背、肘、臂酸痛",
		"method":"直刺或斜刺0.5 - 0.8寸强身保健可用温和灸",
		"extra":"手太阳经郄穴"
	}, {
		"id":"SI7",
		"belonging":"手太阳小肠经",
		"name":"支正",
		"pos":"在前臂背面尺侧，当阳谷与小海的连线上，腕背横纹上5寸",
		"anatomy":"在尺骨背面，尺侧腕伸肌的尺侧缘；布有骨间背侧动、静脉；布有前臂内侧皮神经分支",
		"goodfor":"头痛，目眩，热病，癫狂，项强，肘臂酸痛",
		"method":"直刺或斜刺0.5 - 0.8寸",
		"extra":"手太阳经络穴"
	}, {
		"id":"SI8",
		"belonging":"手太阳小肠经",
		"name":"小海",
		"pos":"在肘内侧，当尺骨鹰嘴与肱骨内上髁之间凹陷处",
		"anatomy":"尺神经沟中，为尺侧腕屈肌的起始部；有尺侧上、下副动脉和副静脉以及尺返动、静脉；布有前臂内侧皮神经，尺神经本干",
		"goodfor":"肘臂疼痛，癫痫",
		"method":"直刺0.3 - 0.5寸",
		"extra":"手太阳经所入为[合]"
	}, {
		"id":"SI9",
		"belonging":"手太阳小肠经",
		"name":"肩贞",
		"pos":"在肩关节后下方，臂内收时，腋后纹头上l寸",
		"anatomy":"在肩关节后下方，肩胛骨外侧缘，三角肌后缘，下层是大圆肌；有旋肩胛动、静脉；布有腋神经分支，最深部上方为桡神经",
		"goodfor":"肩臂疼痛，瘰疬，耳鸣",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"SI10",
		"belonging":"手太阳小肠经",
		"name":"臑俞",
		"pos":"在肩部，当腋后纹头直上，肩胛冈下缘凹陷中",
		"anatomy":"在肩胛骨关节窝后方三角肌中，深层为岗下肌；有旋肱后动、静脉；布有腋神经，深层为肩胛上神经",
		"goodfor":"肩臂疼痛，瘰疬",
		"method":"直刺或斜刺0.5 - 1.5寸",
		"extra":"手、足太阳，阳维脉与阳跷脉交会穴"
	}, {
		"id":"SI11",
		"belonging":"手太阳小肠经",
		"name":"天宗",
		"pos":"在肩胛部，当冈下窝中央凹陷处，与第４胸椎相平，约当肩胛冈下缘与减价下角之间的上1 / 3与下2 / 3交点",
		"anatomy":"在岗下窝中央岗下肌中；有旋肩胛动、静脉肌支；布有肩胛神经",
		"goodfor":"肩胛疼痛，气喘，乳痈",
		"method":"直刺或斜刺0.5 - 1寸遇到阻力不可强行进针",
		"extra":""
	}, {
		"id":"SI12",
		"belonging":"手太阳小肠经",
		"name":"秉风",
		"pos":"在肩胛部，岗上窝中央，天宗直上，举臂有凹陷处",
		"anatomy":"在肩胛岗上缘中央，表层为斜方肌，再下为岗上肌；有肩胛动、静脉；布有锁骨上神经和副神经，深层为肩胛上神经",
		"goodfor":"肩胛疼痛，上肢酸麻",
		"method":"直刺或斜刺0.5 - 1寸",
		"extra":"手三阳与足少阳经交会穴"
	}, {
		"id":"SI13",
		"belonging":"手太阳小肠经",
		"name":"曲垣",
		"pos":"在肩胛部，岗上窝内侧端，当臑俞与第２胸椎棘突连线的中点处",
		"anatomy":"在肩胛岗上缘，斜方肌和岗上肌中；有颈横动、静脉降支，深层为肩胛上动、静脉肌支；布有第二胸神经后支外侧皮支、副神经，深层为肩胛上神经肌支",
		"goodfor":"肩胛疼痛",
		"method":"直刺或斜刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"SI14",
		"belonging":"手太阳小肠经",
		"name":"肩外俞",
		"pos":"在背部，当第1胸椎棘突下，旁开3寸",
		"anatomy":"在肩胛骨内侧角边缘，表层为斜方肌，深层为肩胛提肌和菱形肌；有颈横动、静脉，布有第一神经后支内侧皮支，肩胛背神经和副神经",
		"goodfor":"肩背疼痛，颈项强急",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"SI15",
		"belonging":"手太阳小肠经",
		"name":"肩中俞",
		"pos":"在背部，当第7颈椎棘突下，旁开2寸",
		"anatomy":"在第一胸椎横突端，在肩胛骨内侧角边缘，表层为斜方肌，深层为肩胛提肌和菱形肌；有颈横动、静脉；布有第一胸神经后支内侧皮支，肩胛神经和副神经",
		"goodfor":"咳嗽，气喘，肩背疼痛，目视不明",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"SI16",
		"belonging":"手太阳小肠经",
		"name":"天窗",
		"pos":"在颈外侧部，胸锁乳突肌的后缘，扶突后，与喉结相平",
		"anatomy":"在斜方肌前缘，肩胛提肌后缘，深层为头夹肌；有耳后动、静脉及枕动、静脉分支；布有颈皮神经，正当耳大神经丛的发出部及枕小神经",
		"goodfor":"耳鸣 ，耳聋 ，咽喉肿痛，颈项强痛，暴喑",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"SI17",
		"belonging":"手太阳小肠经",
		"name":"天容",
		"pos":"在颈外侧部，当下颌角的后方，胸锁乳突肌的前缘凹陷中",
		"anatomy":"在下颌角后方，胸锁乳突肌停止部前缘，二腹肌后腹的下缘；前方有颈外浅静脉、颈内动、静脉；布有耳大神经的前支，面神经的颈支、副神经，其深层为交感神经于的颈上神经节",
		"goodfor":"耳鸣，耳聋，咽喉肿痛，颈项强痛",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"SI18",
		"belonging":"手太阳小肠经",
		"name":"颧髎",
		"pos":"当目外眦直下，颧骨下缘凹陷处",
		"anatomy":"在颧骨下颌突的后下缘稍后，咬肌的起始部，颧肌中；有面横动、静分支；布有面神经及眶下神经",
		"goodfor":"口眼歪斜，眼睑瞤动，齿痛，颊肿 ，面瘫",
		"method":"直刺0.3 - 0.5寸，斜刺或平刺0.5 - 1寸",
		"extra":"(l)手少阳，太阳经交会穴；(2)《图翼》：禁灸"
	}, {
		"id":"SI19",
		"belonging":"手太阳小肠经",
		"name":"听宫",
		"pos":"耳屏前，下颌骨髁状突的后方，张口时呈凹陷处",
		"anatomy":"有颞浅动、静脉的耳前支；布有面神经及 三叉神经的第三支的耳颞神经",
		"goodfor":"耳鸣，耳聋，聤耳，齿痛（癫狂痫）",
		"method":"张口，直刺1 - 1.5寸留针时应保持一定的张口姿势",
		"extra":"手、足少阳与手太阳经交会穴"
	}, {
		"id":"BL1",
		"belonging":"足太阳膀胱经",
		"name":"睛明",
		"pos":"在面部，目内眦角稍内上方凹陷处",
		"anatomy":"在眶内缘睑内侧韧带中，深部为眼内直肌； 有内眦动、静脉和滑车上下动、静脉，深层上方有眼动、静脉本干；布有滑车上、下神经，深层为眼神经，上方 为鼻睫神经",
		"goodfor":"目赤肿痛，流泪，视物不明，目眩，近视，夜盲，色盲",
		"method":"嘱患者闭目，医者左手轻推眼球向外侧固定，左手缓慢进针，紧 靠眶缘直刺0.5 - 1寸不捻转，不提插(或只轻微地捻转和提插)出针后按压针孔片刻， 以防出血本穴禁灸",
		"extra":"手足太阳、足阳明、阴跷、阳跷五脉交会穴(《素问·气府论·注》)"
	}, {
		"id":"BL2",
		"belonging":"足太阳膀胱经",
		"name":"攒竹",
		"pos":"在面部，当眉头凹陷中，目内眦直上",
		"anatomy":"有额肌及皱眉肌；当额动、静脉处；布有 额神经内侧支",
		"goodfor":"①目疾：流泪 目视不明 近视 目赤肿痛 ②眼睑瞤动 面瘫 眼睑下垂　③头痛　眉棱骨痛",
		"method":"平刺0.5 - 0.8寸禁灸",
		"extra":""
	}, {
		"id":"BL3",
		"belonging":"足太阳膀胱经",
		"name":"眉冲",
		"pos":"在头部，当攒竹直上入发际0.5寸，神庭与曲差连线之间",
		"anatomy":"有额肌；当额动、静脉处；布有额神经内侧支",
		"goodfor":"头痛，眩晕，鼻塞，癫痫",
		"method":"平刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"BL4",
		"belonging":"足太阳膀胱经",
		"name":"曲差",
		"pos":"在头部，当前发际正中直上0.5寸，旁开1.5寸，即神庭与头维连线的内1 / 3与中1 / 3交点",
		"anatomy":"有额肌；当额动、静脉处；布有额神经内侧支",
		"goodfor":"头痛，鼻塞，鼽衄，目视不明",
		"method":"平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL5",
		"belonging":"足太阳膀胱经",
		"name":"五处",
		"pos":"在头部，当前发际正中直上1寸，旁开1.5寸",
		"anatomy":"有额肌；当额动、静脉处；布有额神经内侧支",
		"goodfor":"头痛，目眩，癫痫",
		"method":"平刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL6",
		"belonging":"足太阳膀胱经",
		"name":"承光",
		"pos":"在头部，当前发际正中直上2.5寸，旁开1.5寸",
		"anatomy":"有帽状腱膜；有额动、静脉，颞浅动、静脉及枕动、静脉的吻合网；当额神经外侧支和枕大神经会合支处",
		"goodfor":"头痛，目眩，鼻塞，热病",
		"method":"平刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"BL7",
		"belonging":"足太阳膀胱经",
		"name":"通天",
		"pos":"在头部，当前发际正中直上4寸，旁开1.5寸",
		"anatomy":"有帽状腱膜；有颞浅动、静脉和枕动、 静脉的吻合网；布有枕大神经分支",
		"goodfor":"头痛，眩晕，鼻塞，鼻衄，鼻渊",
		"method":"平刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"BL8",
		"belonging":"足太阳膀胱经",
		"name":"络却",
		"pos":"在头部，当前发际正中直上5.5寸，旁开1.5寸",
		"anatomy":"在枕肌停止处；有枕动、静脉分支；布有枕大 神经分支",
		"goodfor":"头晕，目视不明，耳鸣",
		"method":"平刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"BL9",
		"belonging":"足太阳膀胱经",
		"name":"玉枕",
		"pos":"在后头部，当后发际正中直上2.5寸，旁开1.3寸平枕外隆凸上缘的凹陷处",
		"anatomy":"有枕肌；有枕动、静脉；布有枕大神经分支",
		"goodfor":"头项痛，目痛，鼻塞",
		"method":"平刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"BL10",
		"belonging":"足太阳膀胱经",
		"name":"天柱",
		"pos":"在项部大筋（斜方肌）外缘之后发际凹陷中，约当后发际正中旁开1.3寸",
		"anatomy":"在斜方肌起部，深层为头半棘肌：有枕 动、静脉干；布有枕大神经干",
		"goodfor":"①头痛 项强 肩背痛 ②鼻塞　热病 ③癫狂痫",
		"method":"直刺或斜刺0.5 - 0.8寸，不可向内上方深刺，以免伤及延髓",
		"extra":""
	}, {
		"id":"BL11",
		"belonging":"足太阳膀胱经",
		"name":"大杼",
		"pos":"在背部，当第1胸椎棘突下，旁开1.5寸",
		"anatomy":"有斜方肌，菱形肌，上后锯肌，最深层为最长肌；有第一肋间动、静脉后支布有第一胸神经后支的皮支，深层为第一胸神经后支外侧支",
		"goodfor":"①咳嗽　气喘 ②头痛　项强　肩背痛 ③发热　治与骨有关的病症",
		"method":"斜刺0.5 - 0.8寸本经背部诸穴，不宜深刺，以免伤及内部重要脏器",
		"extra":"八会穴之一，骨会大杼；手足太阳经交会穴"
	}, {
		"id":"BL12",
		"belonging":"足太阳膀胱经",
		"name":"风门",
		"pos":"在背部，当第2胸椎棘突下，旁开1.5寸",
		"anatomy":"有斜方肌，菱形肌，上后锯肌，深层为最肌；有第二肋间动、静脉后支；布有二、三胸神经后支的皮支，深层为第三胸神经后支外侧支",
		"goodfor":"①咳嗽　气喘 ②头痛　项强　肩背痛 ③发热　祛风要穴，治伤风",
		"method":"向脊柱斜刺0.5 - 0.8寸",
		"extra":"足太阳经与督脉交会穴"
	}, {
		"id":"BL13",
		"belonging":"足太阳膀胱经",
		"name":"肺俞",
		"pos":"在背部，当第3胸椎棘突下，旁开1.5寸",
		"anatomy":"有斜方肌、菱形肌，深层为最长肌；有第 三肋间动、静脉后支；布有第三或第四胸 神经后支的皮支，深层为第三胸神经后支 外侧支",
		"goodfor":"①咳嗽 气喘　咳血　骨蒸潮热　盗汗 ②鼻疾　皮肤病　　③项背痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"肺的背俞穴"
	}, {
		"id":"BL14",
		"belonging":"足太阳膀胱经",
		"name":"厥阴俞",
		"pos":"在背部，当第4胸椎棘突下，旁开1.5寸",
		"anatomy":"有斜方肌、菱形肌，深层为最长肌；布有第 四肋间动、静脉后支；正当第四或第五胸神经后支的皮支，深层为第四胸神经后支外侧 支",
		"goodfor":"咳嗽，心痛，胸闷， 呕吐",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"心包背俞穴"
	}, {
		"id":"BL15",
		"belonging":"足太阳膀胱经",
		"name":"心俞",
		"pos":"在背部，当第5胸椎棘突下，旁开1.5寸",
		"anatomy":"有斜方肌，菱形肌，深层为最长肌；有第五肋间动、静脉后支；布有第五或第六胸神经后支的皮支，深层为第五胸神经后支外侧支",
		"goodfor":"①心痛　心悸　心烦 ②失眠　健忘　癫狂痫 ③咳嗽　吐血　盗汗",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"心的背俞穴"
	}, {
		"id":"BL16",
		"belonging":"足太阳膀胱经",
		"name":"督俞",
		"pos":"在背部，当第6胸椎棘突下，旁开1.5寸",
		"anatomy":"有斜方肌，背阔肌肌腱，最长肌；有第六肋间动、静脉后支，颈横动脉降支；布有肩胛背神经，第六或第七胸神经后支的皮支，深层为第六胸神经后支外侧支",
		"goodfor":"心痛，胸闷，腹痛，寒热、气喘",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL17",
		"belonging":"足太阳膀胱经",
		"name":"膈俞",
		"pos":"在背部，当第7胸椎棘突下，旁开1.5寸",
		"anatomy":"在斜方肌下缘，有背阔肌，最长肌；布有第七肋间动、静脉后支；布有第七或第八胸神经后支的皮支，深层为第七胸神经后支外侧支",
		"goodfor":"①呕吐　呃逆　饮食不下　 ②血症：吐衄　血虚　崩漏等 风疹 ③咳喘　潮热　盗汗　　④背痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"八会穴之一，血会膈俞"
	}, {
		"id":"BL18",
		"belonging":"足太阳膀胱经",
		"name":"肝俞",
		"pos":"在背部，当第9胸椎棘突下，旁开1.5寸",
		"anatomy":"在背阔肌，最长肌和髂肋肌之间；有第九肋间动、静脉后支；布有第九或第十胸神经后支的皮支，深层为第九胸神经后支外侧支",
		"goodfor":"①胁痛　口苦　黄疸 ②脊背痛③目赤 夜盲 近视 目眩④癫狂痫⑤吐血　鼻衄",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"肝的背俞穴"
	}, {
		"id":"BL19",
		"belonging":"足太阳膀胱经",
		"name":"胆俞",
		"pos":"在背部，当第10胸椎棘突下，旁开1.5寸",
		"anatomy":"在背阔肌，最长肌和腱肋肌之间；有第十肋间动、静脉后支；布有第十胸神经后支的皮支，深层为第十胸神经后支的外侧支",
		"goodfor":"①胁痛　口苦　黄疸　　②脊背痛　③咳喘　肺痨 潮热",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"胆的背俞穴"
	}, {
		"id":"BL20",
		"belonging":"足太阳膀胱经",
		"name":"脾俞",
		"pos":"在背部，当第11胸椎棘突下，旁开1.5寸",
		"anatomy":"在背阔肌，最长肌和髂肋肌之间；有第十一肋间动、静脉后支；布有第十一胸神经后支的皮支，深层为第十一胸神经后支肌支",
		"goodfor":"①胃痛　呕吐　腹胀　泄泻　肠鸣　痢疾　②腰背痛 ③衄血　便血　崩漏④水肿　肌肉萎缩",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"脾的背俞穴"
	}, {
		"id":"BL21",
		"belonging":"足太阳膀胱经",
		"name":"胃俞",
		"pos":"在背部，当第12胸椎棘突下，旁开1.5寸",
		"anatomy":"在腰背筋膜，最长肌和髂肋肌之间；有肋下 动、静脉后支；布有第十二胸神经后支的皮 支，深层为第十二胸神经后支外侧支",
		"goodfor":"①胃痛　呕吐　腹胀　泄泻　肠鸣　痢疾　②腰背痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"胃的背俞穴"
	}, {
		"id":"BL22",
		"belonging":"足太阳膀胱经",
		"name":"三焦俞",
		"pos":"在腰部，当第1腰椎棘突下，旁开1.5寸",
		"anatomy":"在腰背筋膜，最长肌和髂肋肌之间；有第一腰动、静脉后支；布有第十胸神经后支的皮支，深层为第一腰神经后支外侧支",
		"goodfor":"肠鸣，腹胀，呕吐，泄泻，痢疾，水肿，腰背强痛",
		"method":"直刺0.5 - 1寸",
		"extra":"三焦背俞穴"
	}, {
		"id":"BL23",
		"belonging":"足太阳膀胱经",
		"name":"肾俞",
		"pos":"在腰部，当第2腰椎棘突下，旁开1.5寸",
		"anatomy":"在腰背筋膜，最长肌和髂肋肌之间：有第二腰动、静脉后支；布有第一腰神经后支的外侧支，深层为第一腰丛",
		"goodfor":"①月经不调　带下　不孕不育　遗精 阳萎　遗尿　水肿 小便不利　②腰腿痛 ③耳鸣　耳聋",
		"method":"直刺0.5 - 1寸",
		"extra":"肾的背俞穴"
	}, {
		"id":"BL24",
		"belonging":"足太阳膀胱经",
		"name":"气海俞",
		"pos":"在腰部，当第3腰椎棘突下，旁开1.5寸",
		"anatomy":"在腰背筋膜，最长肌和髂肋肌之间；有第二腰动、静脉后支；布有第二腰神经后支的外侧支，深层为第一腰丛",
		"goodfor":"肠鸣腹胀，痔漏，痛经，腰痛",
		"method":"直刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"BL25",
		"belonging":"足太阳膀胱经",
		"name":"大肠俞",
		"pos":"在腰部，当第4腰椎棘突下，旁开1.5寸",
		"anatomy":"在腰背筋膜，最长肌和髂肋肌之间；有第四腰动、静脉后支；布有第三腰神经皮支，深层为腰丛",
		"goodfor":"①腹胀　肠鸣　泄泻　便秘 痔疾 ②腰腿痛",
		"method":"直刺0.8 - 1.2寸",
		"extra":"大肠背俞穴"
	}, {
		"id":"BL26",
		"belonging":"足太阳膀胱经",
		"name":"关元俞",
		"pos":"在腰部，当第5腰椎棘突下，旁开1.5寸",
		"anatomy":"有骶棘肌，有腰最下动、静脉后支的内侧支；布有第五腰神经后支",
		"goodfor":"腹胀、泄泻，小便频数或不利，遗尿，腰痛",
		"method":"直刺0.8 - l.2寸",
		"extra":""
	}, {
		"id":"BL27",
		"belonging":"足太阳膀胱经",
		"name":"小肠俞",
		"pos":"在骶部，当骶正中嵴旁1.5寸，平第1骶后孔",
		"anatomy":"在骶髂肌起始部和臀大肌起始部之间；有骶外侧动、静脉后支的外侧支；布有第一骶神经后支外侧支，第五腰神经后支",
		"goodfor":"遗精，遗尿，尿血，白带，小腹胀痛，泄泻，痢疾，疝气，腰腿疼",
		"method":"直刺或斜刺0.8 - 1寸；灸3 - 7壮",
		"extra":""
	}, {
		"id":"BL28",
		"belonging":"足太阳膀胱经",
		"name":"膀胱俞",
		"pos":"在骶部，当骶正中嵴旁1.5寸，平第2骶后孔",
		"anatomy":"在骶棘肌起部和臀大肌起部之间；有骶外侧动、静脉后支；布有臀中皮神经分支",
		"goodfor":"小便不利，遗尿，泄泻，便秘，腰脊强痛",
		"method":"直刺或斜刺0.8 - 1.2寸",
		"extra":"膀胱背俞穴"
	}, {
		"id":"BL29",
		"belonging":"足太阳膀胱经",
		"name":"中膂俞",
		"pos":"在骶部，当骶正中嵴旁1.5寸，平第3骶后孔",
		"anatomy":"有臀大肌，深层为骶结节韧带起始部；当臀下动、静脉的分支处，布有臀下皮神经",
		"goodfor":"泄泻，疝气，腰脊强痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL30",
		"belonging":"足太阳膀胱经",
		"name":"白环俞",
		"pos":"在骶部，当骶正中嵴旁1.5寸，平第4骶后孔",
		"anatomy":"在臀大肌，骶结节韧带下内缘；有臀下动、静脉，深层为阴部内动、静脉；布有皮神经，深层为阴部神经",
		"goodfor":"遗尿，疝气，遗精，月经不调，白带，腰部疼痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL31",
		"belonging":"足太阳膀胱经",
		"name":"上髎",
		"pos":"在骶部，当髂后上棘与中线之间，适对第1骶后孔处",
		"anatomy":"在骶棘肌起始部及臀大肌起始部；当额外侧动、静脉后支处；布有第一髂神经后支",
		"goodfor":"大小便不利，月经不调，带下，阴挺，遗精，阳萎，腰痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL32",
		"belonging":"足太阳膀胱经",
		"name":"次髎",
		"pos":"第二骶后孔中，当髂后上棘内下方",
		"anatomy":"在臀大肌起始部；当骶外侧动、静脉后支处；为第二骶神经后支通过处",
		"goodfor":"①月经不调　痛经　带下 阴挺　不孕不育　阳萎　遗精 ②小便不利　疝气 ③腰骶痛　下肢痿痹",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL33",
		"belonging":"足太阳膀胱经",
		"name":"中髎",
		"pos":"在骶部，当次髎下内方，适对第4骶后孔处",
		"anatomy":"在臀大肌起始部；当骶外侧动、静脉后支处；为第三骶神经后支通过处",
		"goodfor":"便秘，泄泻，小便不利，月经不调，带下 ，腰痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL34",
		"belonging":"足太阳膀胱经",
		"name":"下髎",
		"pos":"在骶部，当[定位]在骶部，当中髎下内方，适对第4骶后孔处",
		"anatomy":"在臀大肌起始部；有臀下动、静脉分支；当第四骶神经后支通过处",
		"goodfor":"腹痛，便秘，小便不利，带下，腰痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL35",
		"belonging":"足太阳膀胱经",
		"name":"会阳",
		"pos":"在骶部，尾骨端旁开0.5寸",
		"anatomy":"有臀大肌；有臀下动、静脉分支；布有尾 骨神经；深部有阴部神经干",
		"goodfor":"泄泻，便血，痔疾，阳萎，带下",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL36",
		"belonging":"足太阳膀胱经",
		"name":"承扶",
		"pos":"在大腿后面，臀下横纹的中点",
		"anatomy":"在臀大肌下缘；有坐骨神经伴行的动、静脉；布有股后皮神经，深层为坐骨神经",
		"goodfor":"腰骶臀股部疼痛，痔疾",
		"method":"直刺1 - 2寸",
		"extra":""
	}, {
		"id":"BL37",
		"belonging":"足太阳膀胱经",
		"name":"殷门",
		"pos":"在大腿后面，当承扶与委中的连线上，承扶下6寸",
		"anatomy":"在半腱肌与股二头肌之间，深层为大收肌；外侧为股深动、静脉第三穿支；布有股后皮神经，深层正当坐骨神经",
		"goodfor":"腰痛，下肢痿痹",
		"method":"直刺1 - 2寸",
		"extra":""
	}, {
		"id":"BL38",
		"belonging":"足太阳膀胱经",
		"name":"浮郄",
		"pos":"在腘横纹外侧端，委阳上1寸，股二头肌腱的内侧",
		"anatomy":"在股二头肌键内侧；有膝上外侧动、静脉；布有股后皮神经，正当腓总神经处",
		"goodfor":"便秘，股腘部疼痛，麻木",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL39",
		"belonging":"足太阳膀胱经",
		"name":"委阳",
		"pos":"在腘横纹外侧端，当股二头肌腱的内侧",
		"anatomy":"在股二头肌键内侧；有膝上外侧动、静脉；布有股后皮神经，正当腓总神经处",
		"goodfor":"腹满，小便不利，腰脊强痛，腿足挛痛",
		"method":"直刺1 - 1.5寸",
		"extra":"三焦经下合穴"
	}, {
		"id":"BL40",
		"belonging":"足太阳膀胱经",
		"name":"委中",
		"pos":"在腘横纹中点，当股二头肌腱与半腱肌肌腱的中间",
		"anatomy":"在腘窝正中，有腘筋膜；皮下有股腘静脉，深层内侧为腘静脉，最深层为腘动有股后皮神经，正当胫神经处",
		"goodfor":"①腰背痛　下肢痿痹　 ②小便不利　遗尿③腹痛　吐泻　④丹毒",
		"method":"直刺1 - 1.5寸，或用三棱针点刺腘静脉出血",
		"extra":"足太阳经所入为[合]"
	}, {
		"id":"BL41",
		"belonging":"足太阳膀胱经",
		"name":"附分",
		"pos":"在背部，当第2胸椎棘突下，旁开3寸",
		"anatomy":"在肩胛岗内端边缘，有斜方肌，菱形肌，深层为髂肋肌；有颈横动脉降支，当第二肋间动、静脉后支；布有第二胸神经后支",
		"goodfor":"颈项强痛，肩背拘急，肘臂麻木",
		"method":"斜刺0.5 - 0.8寸",
		"extra":"手、足太阳经交会穴"
	}, {
		"id":"BL42",
		"belonging":"足太阳膀胱经",
		"name":"魄户",
		"pos":"在背部，当第3胸椎棘突下，旁开3寸",
		"anatomy":"在肩胛骨脊柱缘，有斜方肌，菱形肌，深层为髂肋肌；有第三肋间动、静脉背侧支颈横动脉降支；布有第二、三胸神经后支",
		"goodfor":"咳嗽，气喘，肺痨，项强，肩背痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL43",
		"belonging":"足太阳膀胱经",
		"name":"膏肓",
		"pos":"在背部，当第4胸椎棘突下，旁开3寸",
		"anatomy":"在肩胛骨脊柱缘，有斜方肌、菱形肌，深层为髂肋肌；有第四肋间动、静脉背侧支及颈横动脉降支；布有第三、四胸神经后支",
		"goodfor":"①咳嗽　气喘 吐血　肺痨②健忘　遗精③完谷不化",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL44",
		"belonging":"足太阳膀胱经",
		"name":"神堂",
		"pos":"在背部，当第5胸椎棘突下，旁开3寸",
		"anatomy":"在肩胛骨脊柱缘，有斜方肌，菱形肌，深层为髂肋肌；有第五肋间动静脉背侧支及颈横动脉降支；布有第四、五胸神经后支",
		"goodfor":"咳嗽，气喘，胸闷，脊背强病",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL45",
		"belonging":"足太阳膀胱经",
		"name":"譩譆",
		"pos":"在背部，当第6胸椎棘突下，旁开3寸",
		"anatomy":"在斜方肌外缘，有髂肋肌；有第六肋间动、静脉背侧支；布有第五、六胸神经后支",
		"goodfor":"咳嗽，气喘，疟疾，热病，肩背痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL46",
		"belonging":"足太阳膀胱经",
		"name":"膈关",
		"pos":"在背部，当第7胸椎棘突下，旁开3寸",
		"anatomy":"有背阔肌，髂肋肌；有第七肋间动、静脉背侧支；布有第六胸神经后支",
		"goodfor":"胸闷，嗳气，呕吐，脊背强痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL47",
		"belonging":"足太阳膀胱经",
		"name":"魂门",
		"pos":"在背部，当第9胸椎棘突下，旁开3寸",
		"anatomy":"有背阔肌，髂肋肌；有第九肋间动、静脉背侧支；布有第八、九胸神经后支",
		"goodfor":"胸胁痛，呕吐，泄泻，背痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL48",
		"belonging":"足太阳膀胱经",
		"name":"阳纲",
		"pos":"在背部，当第10胸椎棘突下，旁开3寸",
		"anatomy":"有背阔肌，髂肋肌；有第十肋间动、静脉背侧支；布有第九、十胸神经后支",
		"goodfor":"肠鸣，腹痛，泄泻，黄疸，消渴",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL49",
		"belonging":"足太阳膀胱经",
		"name":"意舍",
		"pos":"在背部，当第11胸椎棘突下，旁开3寸",
		"anatomy":"有背阔肌，髂肋肌；有第十一肋间动、静脉背侧支；布有第十、十一胸神经后支",
		"goodfor":"腹胀、肠鸣、呕吐、泄泻",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL50",
		"belonging":"足太阳膀胱经",
		"name":"胃仓",
		"pos":"在背部，当第12胸椎棘突下，旁开3寸",
		"anatomy":"有背阔肌，髂肋肌；有肋下动、静脉背侧支；布有第十二、十三胸神经后支",
		"goodfor":"胃脘痛，腹胀，小儿食积，水肿，背脊痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL51",
		"belonging":"足太阳膀胱经",
		"name":"肓门",
		"pos":"在腰部，当第1腰椎棘突下，旁开3寸",
		"anatomy":"有背阔肌，髂肋肌；有第一腰动、静脉背侧支；布有第十二胸神经后支",
		"goodfor":"腹痛，便秘，痞块，乳疾",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL52",
		"belonging":"足太阳膀胱经",
		"name":"志室",
		"pos":"在腰部，当第2腰椎棘突下，旁开3寸",
		"anatomy":"背阔肌、髂肋肌；有第二腰动、静脉背侧支；布有第十二胸神经后支外侧支，第一腰神经外侧支",
		"goodfor":"①遗精　阳萎　不育②小便不利　水肿③腰脊强痛",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"BL53",
		"belonging":"足太阳膀胱经",
		"name":"胞肓",
		"pos":"在臀部，平第2骶后孔，骶正中嵴旁开3寸",
		"anatomy":"有臀大肌，臀中肌及臀小肌；正当臀上动、静脉；布有臀上皮神经，深层为臀上神经",
		"goodfor":"肠鸣，腹胀，便秘，癃闭，腰脊强痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL54",
		"belonging":"足太阳膀胱经",
		"name":"秩边",
		"pos":"在臀部，平第4骶后孔，骶正中嵴旁开3寸",
		"anatomy":"有臀大肌，在梨状肌下缘；正当臀下动、静脉深层当臀下神经及股后皮神经，外侧为坐骨神经",
		"goodfor":"小便不利，便秘，痔疾，腰骶痛，下肢痿痹",
		"method":"直刺1.5 - 2寸",
		"extra":""
	}, {
		"id":"BL55",
		"belonging":"足太阳膀胱经",
		"name":"合阳",
		"pos":"在小腿后面，当委中与承山的连线上，委中下2寸",
		"anatomy":"在腓肠肌二头之间；有小隐静脉，深层为腘动、静脉；布有腓肠肌内侧皮神经，深层为腓神经",
		"goodfor":"腰脊强痛，下肢痿痹，疝气，崩漏",
		"method":"直刺1 - 2寸",
		"extra":""
	}, {
		"id":"BL56",
		"belonging":"足太阳膀胱经",
		"name":"承筋",
		"pos":"在小腿后面，当委中与承山的连线上，腓肠肌肌腹中央，委中下5寸",
		"anatomy":"在腓肠肌两肌腹之间；有小隐静脉，深层为腓后动、静脉；布有腓肠内侧皮神经，深层为腓神经",
		"goodfor":"痔疾，腰腿拘急疼痛",
		"method":"直刺1 - 1.5寸",
		"extra":""
	}, {
		"id":"BL57",
		"belonging":"足太阳膀胱经",
		"name":"承山",
		"pos":"在小腿后面正中，委中与昆仑之间，当伸直小腿或足跟上提时腓肠肌肌腹下出现尖角凹陷处",
		"anatomy":"在腓肠肌两肌腹交界下端；有小隐静脉，深层为股后动、静脉；布有腓肠内侧皮神经，深层为腓神经",
		"goodfor":"痔疾，脚气，便秘，腰腿拘急疼痛",
		"method":"直刺1 - 2寸",
		"extra":""
	}, {
		"id":"BL58",
		"belonging":"足太阳膀胱经",
		"name":"飞扬",
		"pos":"在小腿后面，外踝后，昆仑直上7寸，承山穴外下方1寸处",
		"anatomy":"有腓肠肌及比目鱼肌；布有腓肠外侧皮神经",
		"goodfor":"头痛，目眩，腰腿疼痛，痔疾",
		"method":"直刺1 - 1.5寸",
		"extra":"足太阳经络穴"
	}, {
		"id":"BL59",
		"belonging":"足太阳膀胱经",
		"name":"跗阳",
		"pos":"在小腿后面，外踝后，昆仑穴直上3寸",
		"anatomy":"在腓骨的后部，跟腱外前缘，深层为拇长屈肌；有小隐静脉，深层为腓动脉末支；布有腓肠神经",
		"goodfor":"头痛，腰骶痛，下肢痿痹，外踝肿痛",
		"method":"直刺0.8 - 1.2寸",
		"extra":"阳跷脉郄穴"
	}, {
		"id":"BL60",
		"belonging":"足太阳膀胱经",
		"name":"昆仑",
		"pos":"在足部外踝后方，当外踝尖与跟腱之间的凹陷处",
		"anatomy":"有腓骨短肌；有小隐静脉及外踝后动、静脉；布有腓肠神经",
		"goodfor":"①下肢痿痹　足跟肿痛　踝部肿痛②头痛 项强 鼻衄　癫狂痫　眩晕③难产",
		"method":"直刺0.5 - 0.8寸孕妇禁用，经期慎用",
		"extra":"(l)足太阳经所行为[经](2)《针灸大成》：[妊妇刺之落胎]"
	}, {
		"id":"BL61",
		"belonging":"足太阳膀胱经",
		"name":"仆参",
		"pos":"在足外侧部，外踝后下方，昆仑直下，跟骨外侧，赤白肉际处",
		"anatomy":"有腓动、静脉的跟骨外侧支；布有腓肠神经跟骨外侧支",
		"goodfor":"下肢痿痹，足跟痛，癫痫",
		"method":"直刺0.3 - 0.5寸",
		"extra":""
	}, {
		"id":"BL62",
		"belonging":"足太阳膀胱经",
		"name":"申脉",
		"pos":"在足外侧部，外踝直下方凹陷中",
		"anatomy":"在腓骨长短肌腱上缘；有外踝动脉网及小隐静脉；布有腓肠神经的足背外侧皮神经分支",
		"goodfor":"①下肢痿痹　足跟肿痛　踝部肿痛②头痛 项强 鼻衄　癫狂痫　眩晕 ③失眠",
		"method":"直刺0.3 - 0.5寸",
		"extra":"八脉交会穴之一，通阳跷脉"
	}, {
		"id":"BL63",
		"belonging":"足太阳膀胱经",
		"name":"金门",
		"pos":"在足外侧部，当外踝前缘直下，骰骨下缘处",
		"anatomy":"在腓骨长肌腱和小趾外展肌之间；有足底外侧动、静脉；布有足背外侧皮神经，深层为足底外侧神经",
		"goodfor":"头痛，癫痫，小儿惊风，腰痛，下肢痿痹，外踝痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"足太阳经郄穴"
	}, {
		"id":"BL64",
		"belonging":"足太阳膀胱经",
		"name":"京骨",
		"pos":"在足外侧部，第5跖骨粗隆下方，赤白肉际处",
		"anatomy":"在小趾外展肌下方；有足底外侧动、静脉； 布有足背外侧皮神经，深层为足底外侧神经",
		"goodfor":"头痛，项强，目翳，癫痫，腰痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"足太阳经所过为[原]"
	}, {
		"id":"BL65",
		"belonging":"足太阳膀胱经",
		"name":"束骨",
		"pos":"在足外侧，足小趾本节（第5跖趾关节）的后方，赤白肉际处",
		"anatomy":"在小趾外展肌下方；有第四趾跖侧总动、 静脉；有第四趾跖侧神经及足背外侧皮神经分布",
		"goodfor":"头痛，项强，目眩，癫狂，腰腿痛",
		"method":"直刺0.3 - 0.5寸",
		"extra":"足太阳经所注为[输]"
	}, {
		"id":"BL66",
		"belonging":"足太阳膀胱经",
		"name":"足通谷",
		"pos":"在足外侧，足小趾本节（第5跖趾关节）的前方，赤白肉际处",
		"anatomy":"有趾跖侧动、静脉；布有趾跖侧固有神经及足背外侧皮神经",
		"goodfor":"头痛，项强，目眩，鼻衄，癫狂",
		"method":"直刺0.2 - 0.3寸",
		"extra":"足太阳经所溜为[荥]"
	}, {
		"id":"BL67",
		"belonging":"足太阳膀胱经",
		"name":"至阴",
		"pos":"足小趾外侧趾甲根角旁0.1寸",
		"anatomy":"有趾背动脉及趾跖侧固有动脉形成的动脉网；布有趾跖侧固有神经及足背外侧皮神经",
		"goodfor":"①胎位不正（首选，灸） 难产②头痛　目痛 鼻塞　鼻衄",
		"method":"浅刺0.1寸 胎位不正用灸法孕妇禁针",
		"extra":"足太阳经所出为[井]"
	}, {
		"id":"KI1",
		"belonging":"足少阴肾经",
		"name":"涌泉",
		"pos":"在足底部，卷足时足前部凹陷处，约当第2、3趾趾指缝纹头端与足跟连线的前1 / 3与后2 / 3交点上",
		"anatomy":"有指短屈肌腱，指长屈肌腱，第二蚓状肌，深层为骨间肌；有来自胫前动脉的足底弓；布有足底内侧神经支",
		"goodfor":"①急救：小儿惊风　癫狂痫 昏厥 中暑②头痛　眩晕　失眠③咽喉肿痛　失音④小便不利　便秘　足心热",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"肾经井穴"
	}, {
		"id":"KI2",
		"belonging":"足少阴肾经",
		"name":"然谷",
		"pos":"在足内侧缘，足舟骨粗隆下方，赤白肉际",
		"anatomy":"有拇指外展肌，有跖内侧动脉及跗内侧动脉分支；布有小腿内侧皮神经末支及足底内侧神经",
		"goodfor":"月经不调，阴挺，阴痒，白浊，遗精，阳痿，小便不利，泄泻，胸胁胀痛，咳血，小儿脐风，口噤不开，消渴，黄疸，下肢痿痹，足跗痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"肾经荥穴"
	}, {
		"id":"KI3",
		"belonging":"足少阴肾经",
		"name":"太溪",
		"pos":"内踝高点与跟腱后缘连线的中点凹陷处",
		"anatomy":"有胫后动、静脉；布有小腿内侧皮神经，当胫神经之经过处",
		"goodfor":"①月经不调　闭经　遗精 阳萎 小便频数②失眠　多梦　健忘 ③咳喘　咳血　便秘 ④咽喉肿痛　齿痛　耳聋 耳鸣 ⑤腰膝酸痛　足跟痛　内踝痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"肾经腧穴、原穴"
	}, {
		"id":"KI4",
		"belonging":"足少阴肾经",
		"name":"大钟",
		"pos":"在足内侧，内踝下方，当跟腱附着部的内侧前方凹陷处",
		"anatomy":"有胫后动脉跟内侧支；布有小腿内侧皮神经及胫神经的跟骨内侧神经",
		"goodfor":"咳血，气喘，腰脊强痛，痴呆，嗜卧，足跟痛，二便不利，月经不调",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"肾经络穴"
	}, {
		"id":"KI5",
		"belonging":"足少阴肾经",
		"name":"水泉",
		"pos":"在足内侧，内踝后下方，当太溪直下1寸，跟骨结节的内侧凹陷处",
		"anatomy":"有胫后动脉跟内侧支；布有小腿内侧皮神经及胫神经的跟骨内侧神经",
		"goodfor":"月经不调，痛经，阴挺，小便不利，目昏花，腹痛",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"肾经郄穴"
	}, {
		"id":"KI6",
		"belonging":"足少阴肾经",
		"name":"照海",
		"pos":"内踝高点正下缘凹陷处",
		"anatomy":"在拇趾外展肌止点；后方有胫后动、静脉；布有小腿内侧皮神经，深部为胫神经本干",
		"goodfor":"①月经不调　带下　阴挺 阴痒　小便不利②便秘《玉龙赋》照海支沟通大便之秘 ③咽干喉痛　④癫狂痫　失眠",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"八脉交会穴 - 通阴跷脉"
	}, {
		"id":"KI7",
		"belonging":"足少阴肾经",
		"name":"复溜",
		"pos":"在小腿内侧，太溪直上2寸，跟腱的前方",
		"anatomy":"在比目鱼肌下端移行于跟腱处之内侧；前方有胫后动、静脉；布有腓肠内侧皮神经，小腿内侧皮神经，深层为胫神经",
		"goodfor":"①盗汗　热病汗不出或汗出不止②腹胀　肠鸣　泄泻　水肿 ③下肢痿痹",
		"method":"直刺0.8 - 1寸；可灸",
		"extra":"肾经经穴"
	}, {
		"id":"KI8",
		"belonging":"足少阴肾经",
		"name":"交信",
		"pos":"在小腿内侧，当太溪直上2寸，复溜前0.5寸，胫骨内侧缘的后方",
		"anatomy":"在趾长屈肌中；深层为胫后动、静脉；布有小腿内侧皮神经，后方为胫神经本干",
		"goodfor":"月经不调，崩漏，阴挺，泄泻，大便难，睾丸肿痛，五淋，疝气，阴痒，泻痢赤白，膝、股、内廉痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"阴跷脉郄穴"
	}, {
		"id":"KI9",
		"belonging":"足少阴肾经",
		"name":"筑宾",
		"pos":"在小腿内侧，当太溪与阴谷的连线上，太溪上5寸，腓肠肌肌腹的内下方",
		"anatomy":"在腓肠肌和趾长屈肌之间；深部有胫后动、静脉；布有腓肠内侧皮神经和小腿内侧皮神经，深层为胫神经本干",
		"goodfor":"癫狂，痫证，呕吐涎沫，疝痛，小儿脐疝，小腿内侧痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"阴维脉郄穴"
	}, {
		"id":"KI10",
		"belonging":"足少阴肾经",
		"name":"阴谷",
		"pos":"在腘窝内侧，屈膝时，当半腱肌肌腱与半膜肌肌腱之间",
		"anatomy":"在半腱肌腱和半膜肌腱之间；有膝上内侧动、静脉；布有股内侧皮神经",
		"goodfor":"阳痿，疝痛，月经不调，崩漏，小便难，阴中痛，癫狂，膝股内侧痛",
		"method":"直刺0.8 - 1.2寸；",
		"extra":"肾经合穴"
	}, {
		"id":"KI11",
		"belonging":"足少阴肾经",
		"name":"横骨",
		"pos":"在下腹部，当脐中下5寸，前正中线旁开0.5寸",
		"anatomy":"有腹内、外斜肌腱膜，腹横肌腱膜及腹直肌；有腹壁下动、静脉及阴部外动脉；布有髂腹下神经分支",
		"goodfor":"阴部痛，少腹痛，遗精，阳痿，遗尿，小便不通，疝气",
		"method":"直刺0.8 - 1.2寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI12",
		"belonging":"足少阴肾经",
		"name":"大赫",
		"pos":"在下腹部，当脐中下4寸，前正中线旁开0.5寸",
		"anatomy":"在腹内、外斜肌腱膜，腹横肌腱膜及腹直肌中；有腹壁下动、静脉肌支；布有第十二肋间神经及髂腹下神经",
		"goodfor":"阴部痛，子宫脱垂，遗精，带下，月经不调，痛经，不妊，泄泻，痢疾",
		"method":"直刺0.8 - 1.2寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI13",
		"belonging":"足少阴肾经",
		"name":"气穴",
		"pos":"在下腹部，当脐中下3寸，前正中线旁开0.5寸",
		"anatomy":"在腹内、外斜肌腱膜，腹横肌腱膜及腹直肌中；有腹壁下动、静脉肌支；布有第十二肋间神经及髂腹下神经",
		"goodfor":"月经不调，白带，小便不通，泄泻，痢疾，腰脊痛，阳痿",
		"method":"直刺或斜刺0.8 - 1.2寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI14",
		"belonging":"足少阴肾经",
		"name":"四满",
		"pos":"在下腹部，当脐中下2寸，前正中线旁开0.5寸",
		"anatomy":"在腹内、外斜肌腱膜，腹横肌腱膜及腹直肌中；有腹壁下动、静脉肌支；布有第十一肋间神经",
		"goodfor":"月经不调，崩漏，带下，不孕，产后恶露不净，小腹痛，遗精，遗尿，疝气，便秘，水肿",
		"method":"直刺0.8 - 1.2寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI15",
		"belonging":"足少阴肾经",
		"name":"中注",
		"pos":"在下腹部，当脐中下1寸，前正中线旁开0.5寸",
		"anatomy":"在腹内、外斜肌腱膜，腹横肌腱膜及腹直肌中；有腹壁下动、静脉肌支；布有第十肋间神经",
		"goodfor":"月经不调，腰腹疼痛，大便燥结，泄泻，痢疾",
		"method":"直刺0.8 - 1.2寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI16",
		"belonging":"足少阴肾经",
		"name":"肓俞",
		"pos":"在腹中部，当脐中旁开0.5寸",
		"anatomy":"在腹内、外斜肌腱膜，腹横肌腱膜及腹直肌中；有腹壁下动、静脉肌支；布有第十肋间神经",
		"goodfor":"腹痛绕脐，呕吐，腹胀，痢疾，泄泻，便秘，疝气，月经不调，腰脊痛",
		"method":"直刺0.8 - 1.2寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI17",
		"belonging":"足少阴肾经",
		"name":"商曲",
		"pos":"在上腹部，当脐中上2寸，前正中线旁开0.5寸",
		"anatomy":"在腹直肌内缘，有腹壁上下动、静脉分支；布有第九肋间神经",
		"goodfor":"腹痛，泄泻，便秘，腹中积聚",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI18",
		"belonging":"足少阴肾经",
		"name":"石关",
		"pos":"在上腹部，当脐中上3寸，前正中线旁开0.5寸",
		"anatomy":"在腹直肌内缘，有腹壁上动、静脉分支；布有第九肋间神经",
		"goodfor":"呕吐，腹痛，便秘，产后腹痛，妇人不孕",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI19",
		"belonging":"足少阴肾经",
		"name":"阴都",
		"pos":"在上腹部，当脐中上4寸，前正中线旁开0.5寸",
		"anatomy":"在腹直肌内缘，有腹壁上动、静脉分支；布有第八肋间神经",
		"goodfor":"腹胀，肠鸣，腹痛，便秘，妇人不孕，胸胁满，疟疾",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI20",
		"belonging":"足少阴肾经",
		"name":"腹通谷",
		"pos":"在上腹部，当脐中上5寸，前正中线旁开0.5寸",
		"anatomy":"在腹直肌内缘，有腹壁上动、静脉分支；布有第八肋间神经",
		"goodfor":"腹痛，腹胀，呕吐，心痛，心悸，胸痛，暴喑",
		"method":"直刺或斜刺0.5 - 0.8寸；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI21",
		"belonging":"足少阴肾经",
		"name":"幽门",
		"pos":"在上腹部，当脐中上6寸，前正中线旁开0.5寸",
		"anatomy":"在腹直肌内缘，有腹壁上动、静脉分支；布有第七肋间神经",
		"goodfor":"腹痛，呕吐，善哕，消化不良，泄泻，痢疾",
		"method":"直刺0.5 - 0.8寸，不可深刺，以免伤及内脏；可灸",
		"extra":"冲脉、足少阴会穴"
	}, {
		"id":"KI22",
		"belonging":"足少阴肾经",
		"name":"步廊",
		"pos":"在胸部，当第5肋间隙，前正中线旁开2寸",
		"anatomy":"在胸大肌起始部，有肋间外韧带及肋间内肌；有第五肋间动、静脉；布有第五肋间神经前皮支，深部为第五肋间神经",
		"goodfor":"胸痛，咳嗽，气喘，呕吐，不嗜食，乳痈",
		"method":"斜刺或平刺0.5 - 0.8寸，不可深刺，以免伤及内脏，可灸",
		"extra":""
	}, {
		"id":"KI23",
		"belonging":"足少阴肾经",
		"name":"神封",
		"pos":"在胸部，当第4肋间隙，前正中线旁开2寸",
		"anatomy":"在胸大肌中，有肋间外韧带及肋间内肌；有第四肋间动、静脉；布有第四肋间神经前皮支，深部为第四肋间神经",
		"goodfor":"咳嗽，气喘，胸胁支满，呕吐，不嗜食，乳痈",
		"method":"斜刺或平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"KI24",
		"belonging":"足少阴肾经",
		"name":"灵墟",
		"pos":"在胸部，当第3肋间隙，前正中线旁开2寸",
		"anatomy":"在胸大肌中，有肋间外韧带及肋间内肌；有第三肋间动、静脉；布有第三肋间神经前皮支，深层为第三肋间神经",
		"goodfor":"咳嗽，气喘，痰多，胸胁胀痛，呕吐，乳痈",
		"method":"斜刺或平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"KI25",
		"belonging":"足少阴肾经",
		"name":"神藏",
		"pos":"在胸部，当第2肋间隙，前正中线旁开2寸",
		"anatomy":"在胸大肌中，有肋间外韧带及肋间内肌；有第二肋间动、静脉；布有第二肋间神经前皮支，深层正当第二肋间神经",
		"goodfor":"咳嗽，气喘，胸痛，烦满，呕吐，不嗜食",
		"method":"斜刺或平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"KI26",
		"belonging":"足少阴肾经",
		"name":"彧中",
		"pos":"在胸部，当第1肋间隙，前正中线旁开2寸",
		"anatomy":"在胸大肌中，有肋间外韧带及肋间内肌；有第一肋间动、静脉；布有第一肋间神经前皮支，深层为第一肋间神经，皮下有锁骨上神经前支",
		"goodfor":"咳嗽，气喘，痰壅，胸胁胀满，不嗜食",
		"method":"斜刺或平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"KI27",
		"belonging":"足少阴肾经",
		"name":"俞府",
		"pos":"在胸部，当锁骨下缘，前正中线旁开2寸",
		"anatomy":"在胸大肌中；有胸内动、静脉的前穿支；布有锁骨上神经前支",
		"goodfor":"咳嗽，气喘，胸痛，呕吐，不嗜食",
		"method":"斜刺或平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"PC1",
		"belonging":"手厥阴心包经",
		"name":"天池",
		"pos":"在胸部，当第4肋间隙，乳头外1寸，前正中线旁开5寸",
		"anatomy":"在胸大肌外下部，胸小肌下部起端，深层为第四肋间内、外肌；有胸腹壁静脉，胸外侧动、静脉分支；布有胸前神经肌支及第四肋间神经",
		"goodfor":"胸闷，心烦，咳嗽，痰多，气喘，胸痛，腋下肿痛，瘰疬，疟疾，乳痈",
		"method":"斜刺或平刺0.5 - 0.8寸；可灸本穴正当胸腔，内容心、肺，不宜深刺",
		"extra":"手厥阴、足少阳之会穴"
	}, {
		"id":"PC2",
		"belonging":"手厥阴心包经",
		"name":"天泉",
		"pos":"在臂内侧，当腋前纹头下2寸，肱二头肌的长、短头之间",
		"anatomy":"在肱二头肌的长短头之间；有肱动、静脉肌支；为臂内侧皮神经及肌皮神经分布处",
		"goodfor":"心痛，胸胁胀满，咳嗽，胸背及上臂内侧痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"PC3",
		"belonging":"手厥阴心包经",
		"name":"曲泽",
		"pos":"肘微屈，肘横纹中，当肱二头肌腱的尺侧缘",
		"anatomy":"在肱二头肌腱的尺侧；当肱动、静脉处；布有正中神经的本干",
		"goodfor":"①心痛　心悸 ②胃痛　呕吐　泄泻 ③肘臂痛 ④热病",
		"method":"直刺0.8 - 1寸，或者用三棱针刺血；可灸",
		"extra":"心包经合穴"
	}, {
		"id":"PC4",
		"belonging":"手厥阴心包经",
		"name":"郄门",
		" pos":"腕横纹上5寸，掌长肌腱与桡侧腕屈肌腱之间曲泽与大陵的连线上 ",
		"anatomy":"在桡侧腕屈肌腱与掌长肌腱之间，有指浅屈肌，深部为指深屈肌；有前臂正中动、静脉，深部为前臂掌侧骨间动、静脉；布有前臂内侧皮神经，其下为正中神经，深层有前臂掌侧骨间神经",
		"goodfor":"①心痛　心悸　胸胁痛 ②癫狂痫　③肘臂痛 ④呕血　咳血　呕吐　呃逆",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"心包经郄穴"
	}, {
		"id":"PC5",
		"belonging":"手厥阴心包经",
		"name":"间使",
		"pos":"在前臂掌侧，当曲泽与大陵的连线上，腕横纹上3寸，掌长肌腱与桡侧腕屈肌腱之间",
		"anatomy":"在桡侧腕屈肌腱与掌长肌腱之间，有指浅屈肌，深部为指深屈肌；有前臂正中动、静脉，深层为前臂掌侧骨间动、静脉；布有前臂内侧皮神经，前臂外侧皮神经，其下为正中神经掌皮支，最深层为前臂掌侧骨间神经",
		"goodfor":"①心痛　心悸　胸胁痛 ②癫狂痫　③肘臂痛 ④疟疾 ⑤胃痛　呕吐",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"心包经经穴"
	}, {
		"id":"PC6",
		"belonging":"手厥阴心包经",
		"name":"内关",
		"pos":"在前臂掌侧，当曲泽与大陵的连线上，腕横纹上2寸，掌长肌腱与桡侧腕屈肌腱之间",
		"anatomy":"在桡侧腕屈肌腱与掌长肌腱之间，有指浅屈肌，深层为指深屈肌；有前臂正中动、静脉，深层为前臂掌侧骨间动、静脉；布有前臂内侧皮神经，下为正中神经掌皮支，最深层为前臂掌侧骨间神经",
		"goodfor":"①心悸 心痛 心烦 胸闷②癫狂痫 癔病 失眠 眩晕③胃痛　呕吐　呃逆④肘臂痛　胸胁痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"心包经络穴，八脉交会穴 - 通阴维脉"
	}, {
		"id":"PC7",
		"belonging":"手厥阴心包经",
		"name":"大陵",
		"pos":"在腕掌横纹的中点处，当掌长肌腱与桡侧腕屈肌腱之间",
		"anatomy":"在掌长肌腱与桡侧腕屈肌腱之间，有拇长屈肌和指深屈肌腱；有腕掌侧动、静脉网；布有前臂内侧皮神经，正中神经掌皮支，深层为正中神经本干",
		"goodfor":"①心悸　心痛　胸胁痛②癫狂痫　　　③口舌生疮　口臭 ④手腕疼痛　　　　　",
		"method":"直刺0.3 - 05寸；可灸",
		"extra":"心包经输穴、原穴"
	}, {
		"id":"PC8",
		"belonging":"手厥阴心包经",
		"name":"劳宫",
		"pos":"掌心横纹中，第2、3掌骨之间偏于第3掌骨，握拳屈指的中指尖处",
		"anatomy":"在第二、三掌骨间，下为掌腱膜，第二蚓状肌及指浅、深屈肌腱，深层为拇指内收肌横头的起端，有骨间肌；有指掌侧总动脉；布有正中神经的第二指掌侧总神经",
		"goodfor":"①心悸　心痛　胸胁痛②癫狂痫　　　③口舌生疮　口臭 ④掌心热",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"心包经荥穴"
	}, {
		"id":"PC9",
		"belonging":"手厥阴心包经",
		"name":"中冲",
		"pos":"中指尖端中央",
		"anatomy":"有指掌侧固有动、静脉所形成的动、静脉网；为正中神经之指掌侧固有神经分布处",
		"goodfor":"①急救：昏迷　中暑　中风 小儿高热抽搐②心痛　心烦　　 ③舌强肿痛　热病",
		"method":"浅刺0.1寸；或用三棱针点刺出血",
		"extra":"心包经井穴"
	}, {
		"id":"SJ1",
		"belonging":"手少阳三焦经",
		"name":"关冲",
		"pos":"无名指尺侧指甲根角旁0.1寸",
		"anatomy":"有指掌固有动、静脉形成的动、静脉网；布有来自尺神经的指掌侧固有神经",
		"goodfor":"①头痛　目赤痛　咽喉痛　②热病　昏厥",
		"method":"浅刺0.1寸，或有三棱针点刺出血；可灸",
		"extra":"三焦经井穴"
	}, {
		"id":"SJ2",
		"belonging":"手少阳三焦经",
		"name":"液门",
		"pos":"在手背部，当第4、5指间，指蹼缘后方赤白肉际处",
		"anatomy":"有来自尺动脉的指背动脉；布有来自尺神经的手背支",
		"goodfor":"头痛，目赤，耳痛，耳鸣，耳聋，喉痹，疟疾，手臂痛",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"三焦经荥穴"
	}, {
		"id":"SJ3",
		"belonging":"手少阳三焦经",
		"name":"中渚",
		"pos":"手背，无名指掌指关节后方，第四、五掌骨间凹陷中",
		"anatomy":"有第四骨间肌；皮下有手背静脉网及第四掌背动脉；布有来自尺神经的手背支",
		"goodfor":"①耳聋　耳鸣　②头痛 目赤　咽喉肿痛③肘臂痛　小指麻木屈伸不利",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"三焦经输穴"
	}, {
		"id":"SJ4",
		"belonging":"手少阳三焦经",
		"name":"阳池",
		"pos":"在腕背横纹中，当指总伸肌腱的尺侧缘凹陷处",
		"anatomy":"皮下有手背静脉网，第四掌背动脉；布有尺神经手背支及前臂背侧皮神经末支",
		"goodfor":"①腕关节痛　②目赤肿痛　耳聋 咽喉肿痛",
		"method":"直刺0.3 - 0.5寸；可灸",
		"extra":"三焦经原穴"
	}, {
		"id":"SJ5",
		"belonging":"手少阳三焦经",
		"name":"外关",
		"pos":"腕背横纹上2寸，尺骨与桡骨之间",
		"anatomy":"在桡骨与尺骨之间，指总伸肌与拇长伸肌之间，屈肘俯掌时则在指总伸肌的桡侧；深层有前臂骨间背侧动脉和掌侧动、静脉；布有前臂背侧皮神经，深层有前臂骨间背侧及掌侧神经",
		"goodfor":"①耳聋　耳鸣　②胁肋痛　上肢痿痹、瘫痪③热病　头痛　目赤痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"三焦经络穴，八脉交会穴 - 通阳维脉"
	}, {
		"id":"SJ6",
		"belonging":"手少阳三焦经",
		"name":"支沟",
		"pos":"腕背横纹上3寸，尺骨与桡骨之间",
		"anatomy":"在桡骨与尺骨之间，指总伸肌与拇长伸肌之间，屈肘俯掌时则在指总伸肌的桡侧；深层有前臂骨间背侧和掌侧动、静脉；布有前臂背侧皮神经，深层有前臂骨间背侧及掌侧神经",
		"goodfor":"①耳聋　耳鸣　②胁肋痛　上肢痿痹、瘫痪 ③便秘",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"三焦经经穴"
	}, {
		"id":"SJ7",
		"belonging":"手少阳三焦经",
		"name":"会宗",
		"pos":"在前臂背侧，当腕背横纹上3寸，支沟尺侧，尺骨的桡侧缘",
		"anatomy":"尺骨桡侧缘，在小指固有伸肌和尺侧腕伸肌之间；有前臂骨间背侧动、静脉；布有前臂背侧皮神经，深层有前臂骨间背侧神经和骨间掌侧神经",
		"goodfor":"耳聋，痫证，上肢肌肤痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"三焦经郄穴"
	}, {
		"id":"SJ8",
		"belonging":"手少阳三焦经",
		"name":"三阳络",
		"pos":"在前臂背侧，腕背横纹上4寸，尺骨与桡骨之间",
		"anatomy":"在指总伸肌与拇长展肌起端之间；有前臂骨间背侧动、静脉；布有前臂背侧皮神经，深层为前臂骨间背侧神经",
		"goodfor":"暴喑，耳聋，手臂痛，龋齿痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ9",
		"belonging":"手少阳三焦经",
		"name":"四渎",
		"pos":"在前臂背侧，当阳池与肘尖的连线上，肘尖下5寸，尺骨与桡骨之间",
		"anatomy":"在指总伸肌和尺侧腕伸肌之间；深层有前臂骨间背侧动、静脉；布有前臂背侧皮神经，深层有前臂骨间背侧神经",
		"goodfor":"暴喑，暴聋，齿痛，呼吸气短，咽阻如梗，前臂痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ10",
		"belonging":"手少阳三焦经",
		"name":"天井",
		"pos":"在臂外侧，屈肘时，当肘尖直上1寸凹陷处",
		"anatomy":"在肱骨下端后面鹰嘴窝中，有肱三头肌腱；肘关节动、静脉网；布有臂背侧皮神经和桡神经肌支",
		"goodfor":"偏头痛，胁肋、颈项、肩臂痛，耳聋，瘰疬，瘿气，癫痫",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"三焦经[合]穴"
	}, {
		"id":"SJ11",
		"belonging":"手少阳三焦经",
		"name":"清冷渊",
		"pos":"在臂外侧，屈肘时，当肘尖直上2寸，即天井上1寸",
		"anatomy":"在肱三头肌下部；有中侧副动、静脉末支；布有臂背侧皮神经及桡神经肌支",
		"goodfor":"头痛，目黄，肩臂痛不能举",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ12",
		"belonging":"手少阳三焦经",
		"name":"消泺",
		"pos":"在臂外侧，当清冷渊与臑会连线中点处",
		"anatomy":"在肱三头肌肌腹的中间；有中侧副动、静脉；布有臂背侧皮神经及桡神经",
		"goodfor":"头痛，颈项强痛，臂痛，齿痛，癫疾",
		"method":"直刺0.8 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ13",
		"belonging":"手少阳三焦经",
		"name":"臑会",
		"pos":"在臂外侧，当肘尖与肩髎的连线上，肩髎下3寸，三角肌的后下缘",
		"anatomy":"在肱三头肌长头与外侧头之间；有中侧副动、静脉；布有臂背侧皮神经，桡神经肌支，深层为桡神经",
		"goodfor":"肩臂痛，瘿气，瘰疬，目疾，肩胛肿痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ14",
		"belonging":"手少阳三焦经",
		"name":"肩髎",
		"pos":"在肩部，肩髃后方，当臂外展时，于肩峰后下方呈现凹陷处",
		"anatomy":"在三角肌中；有旋肱后动脉；布有腋神经的肌支",
		"goodfor":"臂痛，肩重不能举",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ15",
		"belonging":"手少阳三焦经",
		"name":"天髎",
		"pos":"在肩胛部，肩井与曲垣的中间，当肩胛骨上角处",
		"anatomy":"有斜方肌、冈上肌；有颈横动脉降支，深层为肩胛上动脉肌支；布有第一胸神经后支外侧皮支，副神经，深层为肩胛上神经肌支",
		"goodfor":"肩臂痛，颈项强痛，胸中烦满",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"SJ16",
		"belonging":"手少阳三焦经",
		"name":"天牖",
		"pos":"在颈侧部，当乳突的后下方，平下颌角，胸锁乳突肌的后缘",
		"anatomy":"在胸锁乳突肌后缘；有枕动脉的肌支，耳后动、静脉及颈后浅静脉；布有枕小神经本干，深层为副神经，颈神经",
		"goodfor":"头晕，头痛，面肿，目昏，暴聋，项强",
		"method":"直刺0.8 - 1寸；可灸",
		"extra":""
	}, {
		"id":"SJ17",
		"belonging":"手少阳三焦经",
		"name":"翳风",
		"pos":"在耳垂后方，当乳突与下颌角之间的凹陷处",
		"anatomy":"有耳后动、静脉，颈外浅静脉；布有耳大神经，深部为面神经干从颅骨穿出处",
		"goodfor":"①耳鸣　耳聋　耳部肿痛②面瘫　面颊肿 齿痛　牙关紧闭",
		"method":"直刺0.8 - 1寸；可灸，勿直接灸",
		"extra":""
	}, {
		"id":"SJ18",
		"belonging":"手少阳三焦经",
		"name":"瘛脉",
		"pos":"在头部，耳后乳突中央，当角孙与翳风之间，沿耳轮连线的中、下1 / 3的交点处",
		"anatomy":"在耳后肌上；有耳后动、静脉；布有耳大神经耳后支",
		"goodfor":"头痛，耳聋，耳鸣，小儿惊痫，呕吐，泄痢",
		"method":"平刺0.3 - 0.5寸，或点刺出血；可灸",
		"extra":""
	}, {
		"id":"SJ19",
		"belonging":"手少阳三焦经",
		"name":"颅息",
		"pos":"在头部，当角孙与翳风之间，沿耳轮连线的上、中1 / 3的交点处",
		"anatomy":"有耳后动、静脉；布有耳大神经和枕大神经的吻合支",
		"goodfor":"头痛、耳鸣、耳痛、小儿惊痫，呕吐涎沫",
		"method":"平刺0.2 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"SJ20",
		"belonging":"手少阳三焦经",
		"name":"角孙",
		"pos":"在头部，折耳廓向前，当耳尖直上入发际处",
		"anatomy":"有耳上肌；颞浅动、静脉耳前支；布有耳颞神经分支",
		"goodfor":"耳部肿痛，目赤肿痛，目翳，齿痛，唇燥，项强，头痛",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"SJ21",
		"belonging":"手少阳三焦经",
		"name":"耳门",
		"pos":"在面部，当耳屏上切迹的前方，下颌骨髁状突后缘，张口有凹陷处",
		"anatomy":"有颞浅动、静脉耳前支；布有耳颞神经，面神经分支",
		"goodfor":"①耳聋　耳鸣 ②下颌关节痛　齿痛",
		"method":"直刺0.5 - 1寸；可灸张口取穴",
		"extra":""
	}, {
		"id":"SJ22",
		"belonging":"手少阳三焦经",
		"name":"耳和髎",
		"pos":"在头侧部，当鬓发后缘，平耳廓根之前方，颞浅动脉的后缘",
		"anatomy":"有颞肌和颞浅动、静脉；布有耳颞神经分支，面神经颞支",
		"goodfor":"头重痛，耳鸣，牙关拘急，颔肿，鼻准肿痛，口渴",
		"method":"斜刺0.3 - 0.5；可灸",
		"extra":""
	}, {
		"id":"SJ23",
		"belonging":"手少阳三焦经",
		"name":"丝竹空",
		"pos":"当眉梢凹陷处",
		"anatomy":"有眼轮匝肌；颞浅动、静脉额支；布有面神经颧眶支及耳颞神经分支",
		"goodfor":"①目赤痛　眼睑瞤动②偏头痛　眉棱骨痛",
		"method":"平刺0.5 - 1寸不宜灸",
		"extra":""
	}, {
		"id":"GB1",
		"belonging":"足少阳胆经",
		"name":"瞳子髎",
		"pos":"目外眦旁，当眶外侧缘处",
		"anatomy":"有眼轮匝肌，深层为颞肌；当颧眶动、静脉分布处；布有颧面神经和颧颞神经，面神经的额颞支",
		"goodfor":"①目赤肿痛 目翳　青盲等目疾②偏头痛",
		"method":"向后刺或斜刺0.3 - 0.5寸；或用三棱针点刺出血",
		"extra":"手太阳，手、足少阳之会"
	}, {
		"id":"GB2",
		"belonging":"足少阳胆经",
		"name":"听会",
		"pos":"在面部，当耳屏间切迹的前方，下颌骨髁突的后缘，张口有凹陷处",
		"anatomy":"有颞浅动脉耳前支，深部为颈外动脉及面后静脉；布有耳大神经，皮下为面神经",
		"goodfor":"耳鸣，耳聋，流脓，齿痛，下颌脱臼，口眼喎斜，面痛，头痛",
		"method":"直刺0.5寸；可灸微张口取穴",
		"extra":""
	}, {
		"id":"GB3",
		"belonging":"足少阳胆经",
		"name":"上关",
		"pos":"在耳前，下关直下，当颧弓的上缘凹陷处",
		"anatomy":"在颞肌中；有颧眶动、静脉；布有面神经的颧眶支及三叉神经小分支",
		"goodfor":"头痛，耳鸣，耳聋，聤耳，口眼喎斜，面痛，齿痛，惊痫，瘛疭",
		"method":"直刺0.5 - 0.8寸：可灸",
		"extra":"手少阳、足阳明之会"
	}, {
		"id":"GB4",
		"belonging":"足少阳胆经",
		"name":"颔厌",
		"pos":"在头部鬓发上，当头维与曲鬓弧形连线的上四分之一与下四分之三交点处",
		"anatomy":"在颞肌中；有颞浅动、静脉额支；布有耳颞神经颞支",
		"goodfor":"头痛，眩晕，目外眦痛，齿痛，耳鸣，惊痫",
		"method":"直刺0.3 - 0.4寸；可灸",
		"extra":"手少阳、足阳明之会"
	}, {
		"id":"GB5",
		"belonging":"足少阳胆经",
		"name":"悬颅",
		"pos":"在头部鬓发上，当头维与曲鬓弧形连线的中点处",
		"anatomy":"在颞肌中；有颞浅动、静脉额支；布有耳颞神经颞支",
		"goodfor":"偏头痛，面肿，目外眦痛，齿痛",
		"method":"向后平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"GB6",
		"belonging":"足少阳胆经",
		"name":"悬厘",
		"pos":"在头部鬓发上，当头维与曲鬓弧形连线的上四分之三与下四分之一交点处",
		"anatomy":"在颞肌中；有颞浅动、静脉额支；布有耳颞神经颞支",
		"goodfor":"偏头痛，面肿，目外眦痛，耳鸣，上齿痛",
		"method":"向后平刺0.5 - 0.8寸；可灸",
		"extra":"手、足少阳，阳明之会"
	}, {
		"id":"GB7",
		"belonging":"足少阳胆经",
		"name":"曲鬓",
		"pos":"在头部，当耳前鬓角发际后缘的垂线与耳尖水平线交点处",
		"anatomy":"在颞肌中；有颞浅动、静脉额支；布有耳颞神经颞支",
		"goodfor":"偏头痛，颔颊肿，牙关紧闭，呕吐，齿痛，目赤肿痛，项强不得顾",
		"method":"向后平刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、少阳之会"
	}, {
		"id":"GB8",
		"belonging":"足少阳胆经",
		"name":"率谷",
		"pos":"在头部，当耳尖直上入发际1.5寸，角孙直上方",
		"anatomy":"在颞肌中；有颞动、静脉顶支；布有耳颞神经和枕大神经会合支",
		"goodfor":"头痛，眩晕，呕吐，小儿惊风",
		"method":"平刺0.5 - 1寸；可灸",
		"extra":"足太阳、少阳之会"
	}, {
		"id":"GB9",
		"belonging":"足少阳胆经",
		"name":"天冲",
		"pos":"在头部，当耳根后缘直上入发际2寸，率谷后0.5寸",
		"anatomy":"有耳后动、静脉；布有耳大神经支",
		"goodfor":"头痛，齿龈肿痛，癫痫，惊恐，瘿气",
		"method":"平刺0.5 - 1寸；可灸",
		"extra":"足太阳、少阳之会"
	}, {
		"id":"GB10",
		"belonging":"足少阳胆经",
		"name":"浮白",
		"pos":"在头部，当耳后乳突的后上方，天冲与完骨的弧形连线的中三分之一与上三分之一交点处",
		"anatomy":"有耳后动、静脉分支；布有耳大神经之分支",
		"goodfor":"头痛，颈项强痛，耳鸣，耳聋，齿痛，瘰疬，瘿气，臂痛不举，足痿不行",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、少阳之会"
	}, {
		"id":"GB11",
		"belonging":"足少阳胆经",
		"name":"头窍阴",
		"pos":"在头部，当耳后乳突的后上方，天冲与完骨的弧形连线的中三分之一与下三分之一交点处",
		"anatomy":"有耳后动、静脉之支；布有枕大神经和枕小神经会合支",
		"goodfor":"头痛，眩晕，颈项强痛，胸胁痛，口苦，耳鸣，耳聋，耳痛",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、少阳之会"
	}, {
		"id":"GB12",
		"belonging":"足少阳胆经",
		"name":"完骨",
		"pos":"在头部，当耳后乳突的后下方凹陷处",
		"anatomy":"在胸锁乳突肌附着部上方，有耳后动、静脉之支；布有枕小神经本干",
		"goodfor":"头痛，颈项强痛，颊肿，喉痹，龋齿，口眼歪斜，癫痫，疟疾",
		"method":"斜刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、少阳之会"
	}, {
		"id":"GB13",
		"belonging":"足少阳胆经",
		"name":"本神",
		"pos":"在头部，当前发际上0.5寸，神庭旁开3寸，神庭与头维连线的内三分之二与外三分之一交点处",
		"anatomy":"在额肌中；有颞浅动、静脉额支和额动、静脉外侧支；布有额神经外侧支",
		"goodfor":"头痛，目眩，癫痫，小儿惊风，颈项强痛，胸胁痛，半身不遂",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、阳维之会"
	}, {
		"id":"GB14",
		"belonging":"足少阳胆经",
		"name":"阳白",
		"pos":"目正视，当瞳孔直上，眉上1寸",
		"anatomy":"在额肌中；有额动、静脉外侧支；布有额神经外侧支",
		"goodfor":"①头痛 目赤痛 视物不明②面瘫　眼睑瞤动 眼睑下垂",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、阳维之会"
	}, {
		"id":"GB15",
		"belonging":"足少阳胆经",
		"name":"头临泣",
		"pos":"在头部，当瞳孔直上入前发际0.5寸，神庭与头维连线的中点处",
		"anatomy":"在额肌中；有额动、静脉；布有额神经内、外支会合支",
		"goodfor":"头痛，目眩，目赤痛，流泪，目翳，鼻塞，鼻渊，耳聋，小儿惊痫，热病",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足太阳、少阳、阳维之会"
	}, {
		"id":"GB16",
		"belonging":"足少阳胆经",
		"name":"目窗",
		"pos":"在头部，当前发际上1.5寸，头正中线旁开2.25寸",
		"anatomy":"在帽状腱膜中；有颞浅动、静脉额支；布有额神经内、外侧支会合支",
		"goodfor":"头痛，目眩，目赤肿痛，远视，近视，面浮肿，上齿龋肿，小儿惊痫",
		"method":"平刺0.5 - 0.8寸可灸",
		"extra":"足少阳、阳维之会"
	}, {
		"id":"GB17",
		"belonging":"足少阳胆经",
		"name":"正营",
		"pos":"在头部，当前发际上2.5寸，头正中线旁开2.25寸",
		"anatomy":"在帽状腱膜中；有颞浅动、静脉顶支和枕动、静脉吻合网；布有额神经和枕大神经的会合支",
		"goodfor":"头痛，头晕，目眩，唇吻强急，齿痛",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足少阳、阳维之会"
	}, {
		"id":"GB18",
		"belonging":"足少阳胆经",
		"name":"承灵",
		"pos":"在头部，当前发际上4寸，头正中线旁开2.25寸",
		"anatomy":"在帽状腱膜中；有枕动、静脉分支；布有枕大神经之支",
		"goodfor":"头晕，眩晕，目痛，鼻渊，鼻衄，鼻窒，多涕",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足少阳、阳维之会"
	}, {
		"id":"GB19",
		"belonging":"足少阳胆经",
		"name":"脑空",
		"pos":"在头部，当枕外隆凸的上缘外侧，头正中线旁开2.25寸，平脑户",
		"anatomy":"在枕肌中；有枕动、静脉分支；布有枕大神经之支",
		"goodfor":"头痛，颈项强痛，目眩，目赤肿痛，鼻痛，耳聋，癫痫，惊悸，热病",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"足少阳、阳维之会"
	}, {
		"id":"GB20",
		"belonging":"足少阳胆经",
		"name":"风池",
		"pos":"在项部，当枕骨之下，与风府相平，胸锁乳突肌与斜方肌上端之间的凹陷处",
		"anatomy":"在胸锁乳突肌与斜方肌上端附着部之间的凹陷中，深层为头夹肌；有枕动、静脉分支；布有枕小神经之支",
		"goodfor":"①感冒发热　头痛 项背强痛 \ ②眩晕　癫狂痫　③目赤肿痛　青盲　鼻渊　鼻鼽 鼻衄④瘿气　疟疾",
		"method":"针尖微下，向鼻尖方向斜刺0.5 - 0.8寸，或平刺透风府穴；可灸",
		"extra":"足少阳、阳维之会"
	}, {
		"id":"GB21",
		"belonging":"足少阳胆经",
		"name":"肩井",
		"pos":"第七颈椎棘突下与肩峰端连线的中点",
		"anatomy":"有斜方肌，深层为肩胛提肌与冈上肌；有颈横动、静脉分支；布有腋神经分支，深层上方为桡神经",
		"goodfor":"①颈项强痛　肩背痛　上肢瘫痪②难产　乳汁不下 乳痈",
		"method":"直刺0.5 - 0.8寸，深部正当肺尖，慎不可深刺；可灸孕妇禁针",
		"extra":"足少阳、阳维之会"
	}, {
		"id":"GB22",
		"belonging":"足少阳胆经",
		"name":"渊腋",
		"pos":"在侧胸部，举臂，当腋中线上，腋下3寸，第4肋间隙中",
		"anatomy":"有前锯肌和肋间内、外肌；有胸腹壁静脉，胸外侧动、静脉及第四肋间动、静脉；布有第四肋间神经外侧皮支，胸长神经之支",
		"goodfor":"胸满，肋痛，腋下肿，臂痛不举",
		"method":"斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"GB23",
		"belonging":"足少阳胆经",
		"name":"辄筋",
		"pos":"在侧胸部，渊腋前1寸，平乳头，第4肋间隙中",
		"anatomy":"在胸大肌外缘，有前锯肌，肋间内、外肌；有胸外侧动、静脉；布有第四肋间神经外侧皮支",
		"goodfor":"胸肋痛，喘息，呕吐，吞酸，腋肿，肩臂痛",
		"method":"斜刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"GB24",
		"belonging":"足少阳胆经",
		"name":"日月",
		"pos":"乳头直下，第7肋间隙",
		"anatomy":"有肋间内、外肌，肋下缘有腹外斜肌腱膜，腹内斜肌，腹横肌；有肋间动、静脉；布有第七或第八肋间神经",
		"goodfor":"胁肋疼痛，胀满，呕吐，吞酸，呃逆，黄疸",
		"method":"向外斜刺0.5 - 0.8寸；可灸",
		"extra":"足太阴、少阳之会胆经募穴"
	}, {
		"id":"GB25",
		"belonging":"足少阳胆经",
		"name":"京门",
		"pos":"在侧腰部，章门后1.8寸，当十二肋骨游离端的下方",
		"anatomy":"有腹内、外斜肌及腹横肌；有第十一肋间动、静脉；布有第十一肋间神经",
		"goodfor":"肠鸣，泄泻，腹胀，腰胁痛",
		"method":"斜刺0.5 - 0.8寸；可灸",
		"extra":"肾经募穴"
	}, {
		"id":"GB26",
		"belonging":"足少阳胆经",
		"name":"带脉",
		"pos":"在侧腹部，章门下1.8寸，第11肋骨游离端直下平脐处",
		"anatomy":"有腹内、外斜肌及腹横肌；有第十二肋间动、静脉；布有第十二肋间神经",
		"goodfor":"月经不调，赤白带下，疝气，腰胁痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"足少阳、带脉二经之会"
	}, {
		"id":"GB27",
		"belonging":"足少阳胆经",
		"name":"五枢",
		"pos":"在侧腹部，当髂前上棘的前方，横平脐下3寸处",
		"anatomy":"有腹内、外斜肌及腹横肌；有旋髂浅、深动、静脉；布有髂腹下神经",
		"goodfor":"阴挺，赤白带下，月经不调，疝气，少腹痛，便秘，腰胯痛",
		"method":"直刺0.8 - 1.5寸；可灸",
		"extra":"足少阳、带脉二经之会"
	}, {
		"id":"GB28",
		"belonging":"足少阳胆经",
		"name":"维道",
		"pos":"在侧腹部，当髂前上棘的前下方，五枢前下0.5寸",
		"anatomy":"在髂前上棘前内方，有腹内、外斜肌及腹横肌；有旋髂浅、深动、静脉；布有髂腹股沟神经",
		"goodfor":"腰胯痛，少腹痛，阴挺，疝气，带下，月经不调，水肿",
		"method":"向前下方斜刺0.8 - 1.5寸；可灸",
		"extra":"足少阳、带脉之会"
	}, {
		"id":"GB29",
		"belonging":"足少阳胆经",
		"name":"居髎",
		"pos":"在髋部，当髂前上棘与股骨大转子最凸点连线的中点处",
		"anatomy":"有臀中肌，臀小肌；有臀上动、静脉下支；布有臀上皮神经及臀上神经",
		"goodfor":"腰腿痹痛，瘫痪，足痿，疝气",
		"method":"直刺或斜刺1.5 - 2寸；可灸",
		"extra":"阳跷、足少阳之会"
	}, {
		"id":"GB30",
		"belonging":"足少阳胆经",
		"name":"环跳",
		"pos":"在股外侧部，侧卧屈股，当股骨大转子最凸点与骶管裂孔连线的外三分之一与中三分之一交点处",
		"anatomy":"在臀大肌、梨状肌下缘；内侧为臀下动、静脉；布有臀下皮神经，臀下神经，深部正当坐骨神经",
		"goodfor":"腰胯疼痛，半身不遂，下肢痿痹，遍身风疹，挫闪腰疼，膝踝肿痛不能转侧",
		"method":"直刺2 - 2.5寸；可灸",
		"extra":"足少阳、太阳二脉之会"
	}, {
		"id":"GB31",
		"belonging":"足少阳胆经",
		"name":"风市",
		"pos":"在大腿外侧部的中线上，当腘横纹上7寸或直立垂手时，中指尖处",
		"anatomy":"在阔筋膜下，股外侧肌中；有旋股外侧动、静脉肌支；布有股外侧皮神经，股神经肌支",
		"goodfor":"中风半身不遂，下肢痿痹、麻木，遍身瘙痒，脚气",
		"method":"直刺1 - 1.5寸；可灸",
		"extra":""
	}, {
		"id":"GB32",
		"belonging":"足少阳胆经",
		"name":"中渎",
		"pos":"在大腿外侧，当风市下2寸，或腘横纹上5寸，股外肌与股二头肌之间",
		"anatomy":"在阔筋膜下，股外侧肌中；有旋股外侧动、静脉肌支；布有股外侧皮神经，股神经肌支",
		"goodfor":"下肢痿痹、麻木，半身不遂",
		"method":"直刺1 - 1.5寸；可灸",
		"extra":""
	}, {
		"id":"GB33",
		"belonging":"足少阳胆经",
		"name":"膝阳关",
		"pos":"在膝外侧，当股骨外上髁上方的凹陷处",
		"anatomy":"在髂胫束后方，股二头肌腱前方；有膝上外侧动、静脉；布有股外侧皮神经末支",
		"goodfor":"膝膑肿痛，腘筋挛急，小腿麻木",
		"method":"直刺0.8 - 1寸",
		"extra":""
	}, {
		"id":"GB34",
		"belonging":"足少阳胆经",
		"name":"阳陵泉",
		"pos":"在小腿外侧，当腓骨小头前下方凹陷处",
		"anatomy":"在腓骨长、短肌中；有膝下外侧动、静脉；当腓总神经分为腓浅神经及腓深神经处",
		"goodfor":"①胁痛　口苦 呕吐　黄疸　②下肢痿痹　膝肿痛 筋脉拘挛　下肢瘫痪③小儿惊风",
		"method":"直刺或斜向下刺1 - 1.5寸；可灸失眠配曲池",
		"extra":"胆经[合]穴胆下合穴；八会穴之筋会"
	}, {
		"id":"GB35",
		"belonging":"足少阳胆经",
		"name":"阳交",
		"pos":"在小腿外侧，当外踝尖上7寸，腓骨后缘",
		"anatomy":"在腓骨长肌附着部；布有腓肠外侧皮神经",
		"goodfor":"胸胁胀满疼痛，面肿，惊狂，癫疾，瘈疭，膝股痛，下肢痿痹",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"阳维脉郄穴"
	}, {
		"id":"GB36",
		"belonging":"足少阳胆经",
		"name":"外丘",
		"pos":"在小腿外侧，当外踝尖上7寸，腓骨前缘，平阳交",
		"anatomy":"在腓骨长肌和趾总伸肌之间，深层为腓骨短肌；有胫前动、静脉肌支；布有腓浅神经",
		"goodfor":"颈项强痛，胸胁痛，疯犬伤毒不出，下肢痿痹，癫疾，小儿龟胸",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"胆经郄穴"
	}, {
		"id":"GB37",
		"belonging":"足少阳胆经",
		"name":"光明",
		"pos":"在小腿外侧，当外踝尖上5寸，腓骨前缘",
		"anatomy":"在趾长伸肌和腓骨短肌之间；有胫前动、静脉分支；布有腓浅神经",
		"goodfor":"①目赤痛　夜盲　青盲　近视②乳胀痛　　　③下肢痿痹",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"胆经络穴"
	}, {
		"id":"GB38",
		"belonging":"足少阳胆经",
		"name":"阳辅",
		"pos":"在小腿外侧，当外踝尖上4寸，腓骨前缘稍前方",
		"anatomy":"在趾长伸肌和腓骨短肌之间；有胫前动、静脉分支；布有腓浅神经",
		"goodfor":"偏头痛，目外眦痛，缺盆中痛，腋下痛，瘰疬，胸、胁、下肢外侧痛，疟疾，半身不遂",
		"method":"直刺0.5 - 0.8寸",
		"extra":"胆经[经]穴"
	}, {
		"id":"GB39",
		"belonging":"足少阳胆经",
		"name":"悬钟（绝骨）",
		"pos":"在小腿外侧，当外踝尖上3寸，腓骨前（后）缘",
		"anatomy":"在腓骨短肌与趾长伸肌分歧处；有胫前动、静脉分支；布有腓浅神经",
		"goodfor":"半身不遂，颈项强痛，胸腹胀满，胁肋疼痛，膝腿痛，脚气，腋下肿痴呆中风等CNS疾病",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"八会穴--髓会"
	}, {
		"id":"GB40",
		"belonging":"足少阳胆经",
		"name":"丘墟",
		"pos":"在外踝的前下方，当趾长伸肌腱的外侧凹陷处",
		"anatomy":"在趾短伸肌起点；有外踝前动、静脉分支；布有足背中间皮神经分支及腓浅神经分支",
		"goodfor":"颈项痛，腋下肿，胸胁痛，下肢痿痹，外踝肿痛，疟疾，疝气，目赤肿痛，目生翳膜，中风偏瘫老年痴呆",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"胆经原穴"
	}, {
		"id":"GB41",
		"belonging":"足少阳胆经",
		"name":"足临泣",
		"pos":"在足背外侧，第4趾跖关节的后方，小趾伸肌腱的外侧凹陷处",
		"anatomy":"有足背静脉网，第四趾背侧动、静脉；布有足背中间皮神经",
		"goodfor":"偏头痛，目外眦痛，目眩，乳痈，瘰疬，胁肋痛，疟疾，中风偏瘫，痹痛不仁，足跗肿痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"胆经[输]穴；八脉交会穴--通带脉"
	}, {
		"id":"GB42",
		"belonging":"足少阳胆经",
		"name":"地五会",
		"pos":"在足背外侧，当足4趾本节（第4趾关节）的后方，第4、5趾骨之间，小趾伸肌腱的内侧缘",
		"anatomy":"有足背静脉网，第四跖背侧动、静脉；布有足背中间皮神经",
		"goodfor":"头痛，目赤痛，耳鸣，耳聋，胸满，胁痛，腋肿，乳痈，跗肿",
		"method":"直刺或斜刺0.5 - 0.8寸",
		"extra":""
	}, {
		"id":"GB43",
		"belonging":"足少阳胆经",
		"name":"侠溪",
		"pos":"在足背外侧，当第4、5趾间，趾蹼缘后方赤白肉际处",
		"anatomy":"有趾背侧动、静脉；布有足背中间皮神经之趾背侧神经",
		"goodfor":"头痛，眩晕，惊悸，耳鸣，耳聋，目外眦赤痛，颊肿，胸胁痛，膝股痛，足跗肿痛，疟疾疏肝",
		"method":"直刺或斜刺0.3 - 0.5寸；可灸",
		"extra":"胆经[荥]穴"
	}, {
		"id":"GB44",
		"belonging":"足少阳胆经",
		"name":"足窍阴",
		"pos":"在第4趾末节外侧，距趾甲角0.1寸",
		"anatomy":"有趾背侧动、静脉和趾跖动脉形成的动脉网；布有趾背侧神经",
		"goodfor":"偏头痛，目眩，目赤肿痛，耳聋，耳鸣，喉痹，胸胁痛，足跗肿痛，多梦，热病",
		"method":"直刺0.1 - 0.2寸；可灸",
		"extra":"胆经[井]穴"
	}, {
		"id":"LR1",
		"belonging":"足厥阴肝经",
		"name":"大敦",
		"pos":"在足大指外侧趾甲根角旁0.1寸",
		"anatomy":"有足趾背动、静脉；布有腓神经的趾背神经",
		"goodfor":"①闭经　崩漏　阴挺等月经病及前阴病②癫狂痫　　　③疝气　阴肿，尿血癃闭等泌尿系疾病",
		"method":"斜刺0.1 - 0.2寸，或用三陵针点刺出血；可灸",
		"extra":"肝经井穴"
	}, {
		"id":"LR2",
		"belonging":"足厥阴肝经",
		"name":"行间",
		"pos":"第1、2趾间趾蹼缘的上方纹头处",
		"anatomy":"有足背静脉网；第一趾背侧动、静脉；腓神经的跖背侧神经分为趾背神经的分歧处",
		"goodfor":"①胁肋痛　头痛　目眩　　②痛经　带下　阴肿　月经不调　崩漏 疝气③目赤肿痛　面瘫　　④癫狂痫　小儿惊风",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"肝经荥穴泻肝火"
	}, {
		"id":"LR3",
		"belonging":"足厥阴肝经",
		"name":"太冲",
		"pos":"第1、2跖骨结合前凹陷处",
		"anatomy":"在拇长伸肌腱外缘；有足背静脉网，第一跖背侧动脉；布有腓深神经的跖背侧神经，深层为胫神经足底内侧神经",
		"goodfor":"①胁肋痛　头痛　目眩　　②痛经　带下　阴肿　月经不调　崩漏　疝气③目赤肿痛　面瘫　　④癫狂痫　小儿惊风 ⑤呕逆　下肢痿痹、瘫痪",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"肝经输穴、原穴偏补肝肾"
	}, {
		"id":"LR4",
		"belonging":"足厥阴肝经",
		"name":"中封",
		"pos":"在足背侧，当足内踝前，商丘与解溪连线之间，胫骨前肌腱的内侧凹陷处",
		"anatomy":"在胫骨前肌腱的内侧；有足背静脉网；布有足背侧皮神经的分支及隐神经",
		"goodfor":"疝气，阴茎痛，遗精，小便不利，黄疸，胸腹胀满，腰痛，足冷，内踝肿痛",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":"肝经经穴"
	}, {
		"id":"LR5",
		"belonging":"足厥阴肝经",
		"name":"蠡沟",
		"pos":"在小腿内侧，当足内踝尖上5寸，胫骨内侧面的中央",
		"anatomy":"在胫骨内侧面下三分之一处；其内后侧有大隐静脉；布有隐神经的前支",
		"goodfor":"月经不调，赤白带下，阴挺，阴痒（盆腔炎之）；疝气，小便不利，睾丸肿痛；小腹痛，腰背拘急不可俯仰，胫部酸痛",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"肝经络穴"
	}, {
		"id":"LR6",
		"belonging":"足厥阴肝经",
		"name":"中都",
		"pos":"在小腿内侧，当足内踝尖上7寸，胫骨内侧面的中央",
		"anatomy":"在胫骨内侧面中央；其内后侧有大隐静脉；布有隐神经的中支",
		"goodfor":"胁痛，腹胀，泄泻，疝气，小腹痛，崩漏，恶露不尽",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":"肝经郄穴"
	}, {
		"id":"LR7",
		"belonging":"足厥阴肝经",
		"name":"膝关",
		"pos":"在小腿内侧，当胫骨内髁的后下方，阴陵泉后1寸，腓肠肌内侧头的上部",
		"anatomy":"在胫骨内侧后下方，腓肠肌内侧头的上部；深部有胫后动脉；布有腓肠内侧皮神经，深层为胫神经",
		"goodfor":"膝膑肿痛，寒湿走注，历节风痛，下肢痿痹",
		"method":"直刺0.8 - 1寸；可灸",
		"extra":""
	}, {
		"id":"LR8",
		"belonging":"足厥阴肝经",
		"name":"曲泉",
		"pos":"在膝内侧，屈膝，当膝关节内侧端，股骨内侧髁的后缘，半腱肌、半膜肌止端的前缘凹陷处",
		"anatomy":"在胫骨内髁后缘，半膜肌、半腱肌止点前上方；有大隐静脉，膝最上动脉；布有隐神经、闭孔神经，深向腘窝可及胫神经",
		"goodfor":"月经不调，痛经，白带，阴挺，阴痒，产后腹痛，遗精，阳痿，疝气，小便不利，头痛，目眩，癫狂，膝膑肿痛，下肢痿痹",
		"method":"直刺1 - 1.5寸；可灸",
		"extra":"肝经合穴"
	}, {
		"id":"LR9",
		"belonging":"足厥阴肝经",
		"name":"阴包",
		"pos":"在大腿内侧，当股骨上髁上4寸，股内肌与缝匠肌之间",
		"anatomy":"在股内肌与缝匠肌之间，内收长肌中点，深层为内收短肌；有股动、静脉，旋股内侧动脉浅支；布有股前皮神经，闭孔神经浅、深支",
		"goodfor":"月经不调，遗尿，小便不利，腰骶痛引小腹",
		"method":"直刺0.8 - 1寸；可灸",
		"extra":""
	}, {
		"id":"LR10",
		"belonging":"足厥阴肝经",
		"name":"足五里",
		"pos":"在大腿内侧，当气冲直下3寸，大腿根部，耻骨结节的下方，长收肌的外缘",
		"anatomy":"有内收长肌，内收短肌；有股内侧动脉浅支；布有闭孔神经浅支和深支",
		"goodfor":"少腹胀痛，小便不通，阴挺，睾丸肿痛，嗜卧，四肢倦怠，颈疬",
		"method":"直刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"LR11",
		"belonging":"足厥阴肝经",
		"name":"阴廉",
		"pos":"在大腿内侧，当气冲直下2寸，大腿根部，耻骨结节的下方，长收肌的外缘",
		"anatomy":"有内收长肌和内收短肌；有旋股内侧动、静脉的分支；布有股神经的内侧皮支，深层为闭孔神经的浅支和深支",
		"goodfor":"月经不调，赤白带下，少腹疼痛，股内侧痛，下肢挛急",
		"method":"直刺0.8 - 1寸；可灸",
		"extra":""
	}, {
		"id":"LR12",
		"belonging":"足厥阴肝经",
		"name":"急脉",
		"pos":"在耻骨结节的外侧，当气冲外下腹股沟股动脉搏动处，前正中线旁开2.5寸",
		"anatomy":"有阴部外动、静脉分支及腹壁下动、静脉的耻骨支，外方有股静脉；布有髂腹股沟神经，深层为闭孔神经的分支",
		"goodfor":"疝气，阴挺，阴茎痛，少腹痛，股内侧痛",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"LR13",
		"belonging":"足厥阴肝经",
		"name":"章门",
		"pos":"在侧腹部，当第11肋游离端的下方",
		"anatomy":"有腹内、外斜肌及腹横肌；有肋间动脉末支；布有第十、十一肋间神经；右侧当肝脏下缘，左侧当脾脏下缘",
		"goodfor":"腹痛，腹胀，肠鸣，泄泻，呕吐，神疲肢倦，胸胁痛，黄疸，痞块，小儿疳积，腰脊痛",
		"method":"斜刺0.5 - 0.8寸；可灸",
		"extra":"脾经募穴，八会穴之脏会"
	}, {
		"id":"LR14",
		"belonging":"足厥阴肝经",
		"name":"期门",
		"pos":"在胸部，当乳头直下，第6肋间隙，前正中线旁开4寸",
		"anatomy":"有腹直肌，肋间肌；有肋间动、静脉；布有第六、七肋间神经",
		"goodfor":"胸胁胀满疼痛，呕吐，呃逆，吞酸，腹胀，泄泻，咳喘，奔豚，疟疾，伤寒热入血室乳痈（哺乳期急性乳腺炎）",
		"method":"向外斜刺0.5 - 0.8寸；可灸",
		"extra":"肝经募穴"
	}, {
		"id":"DU1",
		"belonging":"督脉",
		"name":"长强",
		"pos":"在尾骨端下，当尾骨端与肛门连线的中点处",
		"anatomy":"在肛尾膈中；有肛门动、静脉分支，棘间静脉丛之延续部；布有尾神经及肛门神经",
		"goodfor":"①便血 痔疾（ + 承山） 脱肛 泄泻　便秘②癫狂痫（埋线）③腰脊痛",
		"method":"斜刺，针尖向上与骶骨平行刺入0.5 - 1寸不得刺穿直肠，以防感染，不灸",
		"extra":"络穴"
	}, {
		"id":"DU2",
		"belonging":"督脉",
		"name":"腰俞",
		"pos":"在骶部，当后正中线上，适对骶管裂孔",
		"anatomy":"在骶后韧带、腰背筋膜中；有骶中动、静脉后支，棘间静脉丛；布有尾神经分支",
		"goodfor":"腰脊强痛，腹泻，便秘，痔疾，脱肛，便血，癫痫，淋浊，月经不调，下肢痿痹",
		"method":"向上斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU3",
		"belonging":"督脉",
		"name":"腰阳关",
		"pos":"在腰部，当后正中线上，第4腰椎棘突下凹陷中，约与髂嵴相平",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有腰动脉后支，棘间皮下静脉丛；布有腰神经后支的内侧支",
		"goodfor":"①月经不调　带下等妇科疾病　阳萎　遗精，不育等男科②腰脊痛③下肢痿痹",
		"method":"直刺0.5 - 1寸；多灸",
		"extra":""
	}, {
		"id":"DU4",
		"belonging":"督脉",
		"name":"命门",
		"pos":"在腰部，当后正中线上，第2腰椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有腰动脉后支及棘间皮下静脉丛；布有腰神经后支内侧支",
		"goodfor":"①月经不调　带下等妇科病阳萎　遗精 小便频数②腰脊痛 小腹冷痛③五更泄泻",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU5",
		"belonging":"督脉",
		"name":"悬枢",
		"pos":"在腰部，当后正中线上，第1腰椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有腰动脉后支及棘间皮下静脉丛；布有腰神经后支内侧支",
		"goodfor":"腰脊强痛，腹胀，腹痛，完谷不化，泄泻，痢疾",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU6",
		"belonging":"督脉",
		"name":"脊中",
		"pos":"在背部，当后正中线上，第11胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第十一肋间动脉后支，棘间皮下静脉丛；布有第十一胸神经后支内侧支",
		"goodfor":"腰脊强痛，黄疸，腹泻，痢疾，小儿疳积，痔疾，脱肛，便血，癫痫",
		"method":"斜刺0.5 - 1寸",
		"extra":""
	}, {
		"id":"DU7",
		"belonging":"督脉",
		"name":"中枢",
		"pos":"在背部，当后正中线上，第10胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第十肋间动脉后支，棘间皮下静脉丛；布有第十胸神经后支之内侧支",
		"goodfor":"黄疸，呕吐，腹满，胃痛，食欲不振，腰背痛",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU8",
		"belonging":"督脉",
		"name":"筋缩",
		"pos":"在背部，当后正中线上，第9胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第九肋间动脉后支，棘间皮下静脉丛；布有第九胸神经后支内侧支",
		"goodfor":"癫狂，惊痫，抽搐，脊强，背痛，胃痛，黄疸，四肢不收，筋挛拘急",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU9",
		"belonging":"督脉",
		"name":"至阳",
		"pos":"后正中线上，第7胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第七肋间动脉后支，棘间皮下静脉丛；布有第七胸神经后支内侧支",
		"goodfor":"胸胁胀痛，腹痛黄疸等肝胆病症，咳嗽气喘，腰背疼痛，脊强，身热",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU10",
		"belonging":"督脉",
		"name":"灵台",
		"pos":"在背部，当后正中线上，第6胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第六肋间动脉后支，棘间皮下静脉丛；布有第六胸神经后支内侧支",
		"goodfor":"咳嗽，气喘，项强，脊痛，身热，疔疮",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU11",
		"belonging":"督脉",
		"name":"神道",
		"pos":"在背部，当后正中线上，第5胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第五肋间动脉后支，棘间皮下静脉丛；布有第五胸神经后支内侧支",
		"goodfor":"心痛，惊悸，怔忡，失眠健忘，中风不语，癫痫，腰脊强，肩背痛，咳嗽，气喘",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU12",
		"belonging":"督脉",
		"name":"身柱",
		"pos":"在背部，当后正中线上，第3胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第三肋间动脉后支，棘间皮下静脉丛；布有第三胸神经后支内侧支",
		"goodfor":"身热头痛，咳嗽，气喘等外感（好），惊厥，癫狂痫证，腰脊强痛，疔疮发背（好）",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU13",
		"belonging":"督脉",
		"name":"陶道",
		"pos":"在背部，当后正中线上，第1胸椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有第一肋间动脉后支，棘间皮下静脉丛；布有第一胸神经后支内侧支",
		"goodfor":"头痛项强，恶寒发热，咳嗽，气喘，骨蒸潮热，胸痛，脊背痠痛，疟疾，癫狂，角弓反张",
		"method":"斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU14",
		"belonging":"督脉",
		"name":"大椎",
		"pos":"在后正中线上，第7颈椎棘突下凹陷中",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有颈横动脉分支，棘间皮下静脉丛；布有第八颈神经后支内侧支",
		"goodfor":"①外感热病　风疹　疟疾②咳嗽　气喘　骨蒸盗汗③头项强痛　肩背痛　　　④癫狂痫",
		"method":"向上斜刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"DU15",
		"belonging":"督脉",
		"name":"哑门",
		"pos":"在项部，当后发际正中直上0.5寸，第1颈椎下",
		"anatomy":"在项韧带和项肌中，深部为弓间韧带和脊髓；有枕动、静脉分支及棘间静脉丛；布有第三颈神经和枕大神经支",
		"goodfor":"①中风不语偏瘫②癫狂痫　　③头痛项强④哑症",
		"method":"伏案正坐位，使头微前倾，项肌放松，向下颌方向缓慢刺入0.5 - 1寸",
		"extra":""
	}, {
		"id":"DU16",
		"belonging":"督脉",
		"name":"风府",
		"pos":"在项部，当后发际正中直上1寸，枕外隆凸直下，两侧斜方肌之间凹陷处",
		"anatomy":"在项韧带和项肌中，深部为环枕后膜和小脑延髓池；有枕动、静脉分支及棘间静脉丛；布有第三颈神经和枕大神经支",
		"goodfor":"①中风不语偏瘫 \ ②癫狂痫　　③头痛项强 ④眩晕 外感 咽喉肿痛",
		"method":"伏案正坐位，使头微前倾，项肌放松，向下颌方向缓慢刺入0.5 - 1寸针尖不可向上，以免刺入枕骨大孔，误伤延髓",
		"extra":""
	}, {
		"id":"DU17",
		"belonging":"督脉",
		"name":"脑户",
		"pos":"在头部，后发际正中直上2.5寸，风府上1.5寸，枕外隆凸的上缘凹陷处",
		"anatomy":"在左右枕骨肌之间；有左右枕动、静脉分支，深层常有导血管；布有枕大神经分支",
		"goodfor":"头重，头痛，面赤，目黄，眩晕，面痛、音哑，项强，癫狂痫证，舌本出血，瘿瘤",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"DU18",
		"belonging":"督脉",
		"name":"强间",
		"pos":"在头部，当后发际正中直上4寸（脑户上1.5寸）",
		"anatomy":"在浅筋膜、帽状腱膜中；有左右枕动、静脉吻合网；布有枕大神经分支",
		"goodfor":"头痛，目眩，颈项强痛，癫狂痫证，烦心，失眠",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"DU19",
		"belonging":"督脉",
		"name":"后顶",
		"pos":"在头部，当后发际正中直上5.5寸（脑户上3寸）",
		"anatomy":"在浅筋膜、帽状腱膜中；有左右枕动、静脉网；布有枕大神经分支",
		"goodfor":"头痛，眩晕，项强，癫狂痫证，烦心，失眠",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"DU20",
		"belonging":"督脉",
		"name":"百会",
		"pos":"在头部，当前发际正中直上5寸，或头部正中线与两耳尖连线交点处",
		"anatomy":"在帽状腱膜中；有左右颞浅动、静脉及左右枕动、静脉吻合网；布有枕大神经及额神经分支",
		"goodfor":"①头痛　眩晕　晕厥②中风不语　偏瘫　癫狂痫　不寐③脱肛　阴挺等下陷性病证",
		"method":"平刺0.5 - 0.8寸；升阳举陷多灸",
		"extra":""
	}, {
		"id":"DU21",
		"belonging":"督脉",
		"name":"前顶",
		"pos":"在头部，当前发际正中直上3.5寸（百会前0.5寸）",
		"anatomy":"在帽状腱膜中；有左右颞浅动、静脉吻合网；布有额神经分支和枕大神经分支会合处",
		"goodfor":"癫痫，头晕，目眩，头顶痛，鼻渊，目赤肿痛，小儿惊风",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"DU22",
		"belonging":"督脉",
		"name":"囟会",
		"pos":"在头部，当前发际正中直上2寸（百会前3寸）",
		"anatomy":"在帽状腱膜中；有左右颞浅动、静脉吻合网；布有额神经分支",
		"goodfor":"头痛，目眩，面赤暴肿，鼻渊，鼻衄，鼻痔，鼻痈，癫疾，嗜睡，小儿惊风",
		"method":"平刺0.3 - 0.5寸，小儿禁刺；可灸",
		"extra":""
	}, {
		"id":"DU23",
		"belonging":"督脉",
		"name":"上星",
		"pos":"在头部，当前发际正中直上1寸",
		"anatomy":"在左右额肌交界处；有额动、静脉分支，颞浅动、静脉分支；有额神经分支",
		"goodfor":"头痛，眩晕，目赤肿痛，迎风流泪，面赤肿，鼻渊，鼻衄，鼻痔，鼻痈，癫狂，痫证，小儿惊风，疟疾，热病",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"DU24",
		"belonging":"督脉",
		"name":"神庭",
		"pos":"在头部，当前发际正中直上0.5寸",
		"anatomy":"在左右额肌之交界处；有额动、静脉分支；布有额神经分支",
		"goodfor":"头痛，眩晕，目赤肿痛，泪出，目翳，雀目，鼻渊，鼻衄，癫狂，痫证，角弓反张",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"DU25",
		"belonging":"督脉",
		"name":"素髎",
		"pos":"在面部，当鼻尖的正中央",
		"anatomy":"在鼻尖软骨中；有面动、静脉鼻背支；布有筛前神经鼻外支（眼神经分支）",
		"goodfor":"鼻塞，鼻衄，鼻流清涕，鼻中肉，鼻渊，酒鼻，惊厥，昏迷，新生儿窒息",
		"method":"向上斜刺0.3 - 0.5寸，或点刺出血；不灸",
		"extra":""
	}, {
		"id":"DU26",
		"belonging":"督脉",
		"name":"水沟",
		"pos":"人中沟上１／３与下２／３交点处",
		"anatomy":"在口轮匝肌中；有上唇动、静脉；布有眶下神经支及面神经颊支",
		"goodfor":"①急救要穴：昏迷　晕厥　中暑　小儿惊风 牙关紧闭 癫狂痫②面瘫　面肿　③腰脊强痛",
		"method":"向上斜刺0.3 - 0.5寸，或用指甲按掐；不灸",
		"extra":""
	}, {
		"id":"DU27",
		"belonging":"督脉",
		"name":"兑端",
		"pos":"在面部，当上唇的尖端，人中沟下端的皮肤与唇的移行部",
		"anatomy":"在口轮匝肌中；有上唇动、静脉；布有面神经颊支及眶下神经分支",
		"goodfor":"昏迷，晕厥，癫狂，癔病，消渴嗜饮，口疮臭秽，齿痛，口噤，鼻塞",
		"method":"斜刺0.2 - 0.3寸；不灸",
		"extra":""
	}, {
		"id":"DU28",
		"belonging":"督脉",
		"name":"龈交",
		"pos":"在上唇内，唇系带与上齿龈的相接处",
		"anatomy":"有上唇系带；有上唇动、静脉；布有上颌内槽神经分支",
		"goodfor":"齿龈肿痛，口臭，齿衄，处鼻渊，面赤颊肿，唇吻强急，面部疮癣，两腮生疮，癫狂，项强",
		"method":"向上斜刺0.2 - 0.3寸；不灸",
		"extra":""
	}, {
		"id":"RN1",
		"belonging":"任脉经",
		"name":"会阴",
		"pos":"在会阴部，男性当阴囊根部与肛门连线的中点，女性当大阴唇后联合与肛门连线的中点",
		"anatomy":"在球海绵体中央，有会阴浅、深横肌；有会阴动、静脉分支；布有会阴神经分支",
		"goodfor":"溺水窒息，昏迷，癫狂，惊痫，小便难，遗尿，阴痛，阴痒，阴部汗湿，脱肛，阴挺，疝气，痔疾，遗精，月经不调",
		"method":"直刺0.5 - 1寸，孕妇慎用；可灸",
		"extra":"任脉别络，侠督脉、冲脉之会"
	}, {
		"id":"RN2",
		"belonging":"任脉经",
		"name":"曲骨",
		"pos":"在下腹部，当前正中线上，耻骨联合上缘的中点处",
		"anatomy":"在腹白线上；有腹壁下动脉及闭孔动脉的分支；布有髂腹下神经分支",
		"goodfor":"少腹胀满，小便淋沥，遗尿，疝气，遗精阳痿，阴囊湿痒，月经不调，赤白带下，痛经",
		"method":"直刺0.5 - 1寸，内为膀胱，应在排尿后进行针刺；可灸",
		"extra":"任脉、足厥阴之会"
	}, {
		"id":"RN3",
		"belonging":"任脉经",
		"name":"中极",
		"pos":"在下腹部，前正中线上，当脐中下4寸",
		"anatomy":"在腹白线上，深部为乙状结肠；有腹壁浅动、静脉分支，腹壁下动、静脉分支；布有髂腹下神经的前皮支",
		"goodfor":"①遗精　阳萎　崩漏　月经不调　带下　阴痒　闭经　痛经　不孕　不育②遗尿　癃闭　小便不利　疝气 以治泌尿系病变为主",
		"method":"直刺0.5 - 1寸；可灸孕妇慎用",
		"extra":"足三阴、任脉之会"
	}, {
		"id":"RN4",
		"belonging":"任脉经",
		"name":"关元",
		"pos":"在下腹部，前正中线上，当脐中下3寸",
		"anatomy":"在腹白线上，深部为小肠；有腹壁浅动、静脉分支，腹壁下动、静脉分支；布有第十二肋间神经前皮支的内侧支",
		"goodfor":"①遗精　阳萎　崩漏　月经不调　带下 阴痒 阴挺　闭经　痛经　不孕　不育②遗尿　癃闭　小便不利　疝气 ③中风脱症　虚劳　脱肛　泄泻　眩晕④强壮作用，为保健的要穴",
		"method":"直刺0.5 - 1寸；可灸孕妇慎用",
		"extra":"足三阴、任脉之会"
	}, {
		"id":"RN5",
		"belonging":"任脉经",
		"name":"石门",
		"pos":"在下腹部，前正中线上，当脐中下2寸",
		"anatomy":"在腹白线上，深部为小肠；有腹壁浅动、静脉分支，腹壁下动、静脉分支；布有第十一肋间神经前皮支的内侧支",
		"goodfor":"腹胀，泄利，绕脐疼痛，奔豚疝气，水肿，小便不利，遗精，阳萎，经闭，带下，崩漏，产后恶露不止",
		"method":"直刺0.5 - 1寸；可灸孕妇慎用",
		"extra":"手少阳之募穴"
	}, {
		"id":"RN6",
		"belonging":"任脉经",
		"name":"气海",
		"pos":"在下腹部，前正中线上，当脐中下1.5寸",
		"anatomy":"在腹白线上，深部为小肠；有腹壁浅动脉、静脉分支，腹壁下动、静脉分支；布有第十一肋间神经前皮支的内侧支",
		"goodfor":"①遗精　阳萎　崩漏　月经不调　带下 阴挺　阴痒　闭经　痛经　不孕　不育②遗尿　癃闭　小便不利　疝气③中风脱症　虚劳　脱肛　　泄泻　眩晕等④强壮作用，为保健的要穴",
		"method":"直刺0.5 - 1寸；可灸孕妇慎用",
		"extra":"肓之原穴"
	}, {
		"id":"RN7",
		"belonging":"任脉经",
		"name":"阴交",
		"pos":"在下腹部，前正中线上，当脐中下1寸",
		"anatomy":"在腹白线上，深部为小肠；有腹壁浅动脉、静脉分支，腹壁下动、静脉分支；布有第十肋间神经前皮支的内侧支",
		"goodfor":"绕脐冷痛，腹满水肿，泄泻，疝气，阴痒，小便不利，奔豚，血崩，带下，产后恶露不止，小儿陷囟，腰膝拘挛",
		"method":"直刺0.5 - 1寸；可灸孕妇慎用",
		"extra":"任脉、冲脉、少阴之会"
	}, {
		"id":"RN8",
		"belonging":"任脉经",
		"name":"神阙",
		"pos":"在腹中部，脐中央",
		"anatomy":"在脐窝正中，深部为小肠；有腹壁下动、静脉；布有第十肋间神经前皮支的内侧支",
		"goodfor":"①虚脱 脱肛 阴挺②绕脐腹痛　腹胀 泄泻　水肿臌胀",
		"method":"禁刺；可灸多用艾条灸或艾柱隔盐灸",
		"extra":""
	}, {
		"id":"RN9",
		"belonging":"任脉经",
		"name":"水分",
		"pos":"在上腹部，前正中线上，当脐中上1寸",
		"anatomy":"在腹白线上，深部为小肠；有腹壁下动脉、静脉分支，腹壁下动、静脉分支；布有第八、九肋间神经前皮支的内侧支",
		"goodfor":"腹痛，腹胀，肠鸣，泄泻，翻胃，水肿，小儿陷囟，腰脊强急",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"RN10",
		"belonging":"任脉经",
		"name":"下脘",
		"pos":"在上腹部，前正中线上，当脐中上2寸",
		"anatomy":"在腹白线上，深部为横结肠；有腹壁上、下动、静脉交界处的分支；布有第八肋间神经前皮支的内侧支",
		"goodfor":"脘痛，腹胀，呕吐，呃逆，食谷不化，肠鸣，泄泻，痞块，虚肿",
		"method":"刺0.5 - 1寸；可灸",
		"extra":"足太阴、任脉之会"
	}, {
		"id":"RN11",
		"belonging":"任脉经",
		"name":"建里",
		"pos":"在上腹部，前正中线上，当脐中上3寸",
		"anatomy":"在腹白线上，深部为横结肠；有腹壁上、下动、静脉交界处的分支；布有第八肋间神经前皮支的内侧支",
		"goodfor":"胃脘疼痛，腹胀，呕吐，食欲不振，肠中切痛，水肿",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"RN12",
		"belonging":"任脉经",
		"name":"中脘",
		"pos":"在上腹部，前正中线上，当脐中上4寸或脐与胸剑联合连线的中点处",
		"anatomy":"在腹白线上，深部为胃幽门部；有腹壁上动、静脉；布有第七、八肋间神经前皮支的内侧支",
		"goodfor":"①胃脘痛　腹胀　呕吐吞酸 泄泻　黄疸②癫狂痫",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"胃经募穴，八会穴之腑会，手太阳、少阳、足阳明、任脉之会"
	}, {
		"id":"RN13",
		"belonging":"任脉经",
		"name":"上脘",
		"pos":"在上腹部，前正中线上，当脐中上5寸",
		"anatomy":"在腹白线上，深部为肝下缘及胃幽门部；有腹壁上动、静脉分支；布有第七肋间神经前皮支的内侧支",
		"goodfor":"胃脘疼痛，腹胀，呕吐，呃逆，纳呆，食不化，黄疸，泄利，虚劳吐血，咳嗽痰多，癫痫",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"任脉、足阳明、手太阳之会"
	}, {
		"id":"RN14",
		"belonging":"任脉经",
		"name":"巨阙",
		"pos":"在上腹部，前正中线上，当脐中上2寸",
		"anatomy":"在腹白线上，深部为肝脏；有腹壁上动、静脉分支；布有第七肋间神经前皮支的内侧支",
		"goodfor":"胸痛，心痛，心烦，惊悸，尸厥，癫狂，痫证，健忘，胸满气短，咳逆上气，腹胀暴痛，呕吐，呃逆，噎嗝，吞酸，黄疸，泄利",
		"method":"直刺0.5 - 1寸；可灸",
		"extra":"心经募穴"
	}, {
		"id":"RN15",
		"belonging":"任脉经",
		"name":"鸠尾",
		"pos":"在上腹部，前正中线上，当胸剑结合部下1寸",
		"anatomy":"在腹白线上，腹直肌起始部，深部为肝脏；有腹壁上动、静脉分支；布有第六肋间神经前皮支的内侧支",
		"goodfor":"心痛，心悸，心烦，癫痫，惊狂，胸中满痛，咳嗽气喘，呕吐，呃逆，反胃，胃痛",
		"method":"斜向下刺0.5 - 1寸；可灸",
		"extra":""
	}, {
		"id":"RN16",
		"belonging":"任脉经",
		"name":"中庭",
		"pos":"在胸部，当前正中线上，平第5肋间，即胸剑结合部",
		"anatomy":"有胸廓（乳房）内动、静脉的前穿支；布有第五肋间神经前皮支的内侧支",
		"goodfor":"胸腹胀满，噎嗝，呕吐，心痛，梅核气",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"RN17",
		"belonging":"任脉经",
		"name":"膻中",
		"pos":"在胸部，当前正中线上，平第4肋间，两乳头连线的中点",
		"anatomy":"在胸骨体上；有胸廓（乳房）内动、静脉的前穿支；布有第四肋间神经前皮支的内侧支",
		"goodfor":"①咳嗽　气喘　胸痛　②心痛　心悸　③噎膈　呕吐　　　④乳汁少　乳痈 + 梁丘宽胸理气",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":"心包经之募穴，八会穴之气会"
	}, {
		"id":"RN18",
		"belonging":"任脉经",
		"name":"玉堂",
		"pos":"在胸部，当前正中线上，平第3肋间",
		"anatomy":"在胸骨体中点；有胸廓（乳房）内动、静脉的前穿支；布有第三肋间神经前皮支的内侧支",
		"goodfor":"膺胸疼痛，咳嗽，气短，喘息，喉痹咽肿，呕吐寒痰，两乳肿痛",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"RN19",
		"belonging":"任脉经",
		"name":"紫宫",
		"pos":"在胸部，当前正中线上，平第2肋间",
		"anatomy":"在胸骨体上；有胸廓（乳房）内动、静脉的前穿支；布有第二肋间神经前皮支的内侧支",
		"goodfor":"咳嗽，气喘，胸胁支满，胸痛，喉痹，吐血，呕吐，饮食不下",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"RN20",
		"belonging":"任脉经",
		"name":"华盖",
		"pos":"在胸部，当前正中线上，平第1肋间",
		"anatomy":"在胸骨角上；有胸廓（乳房）内动、静脉的前穿支；布有第一肋间神经前皮支的内侧支",
		"goodfor":"咳嗽，气喘，胸痛，胁肋痛，喉痹，咽肿",
		"method":"平刺0.3 - 0.5寸，可灸",
		"extra":""
	}, {
		"id":"RN21",
		"belonging":"任脉经",
		"name":"璇玑",
		"pos":"在胸部，当前正中线上，天突下1寸",
		"anatomy":"在胸骨柄上；有胸廓（乳房）内动、静脉的前穿支；布有锁骨上神经前支",
		"goodfor":"咳嗽，气喘，胸满痛，喉痹咽肿，胃中有积",
		"method":"平刺0.3 - 0.5寸；可灸",
		"extra":""
	}, {
		"id":"RN22",
		"belonging":"任脉经",
		"name":"天突",
		"pos":"在颈部，当前正中线上胸骨上窝中央",
		"anatomy":"在左右胸锁乳突肌之间，深层左右为胸骨舌骨肌和胸骨甲状肌；皮下有颈静脉弓、甲状腺下动脉分支；深部为气管，再向下，在胸骨柄后方为无名静脉及主动脉弓；布有锁骨上神经前支",
		"goodfor":"①咳嗽　哮喘　胸痛②喉痒咽干　咽喉肿痛　梅核气 瘿气　暴喑　噎膈 若刺破气管壁，可引起剧烈的咳嗽及血痰等现象如刺中气管壁，针下有硬而轻度弹性的感觉，病人出现喉痒欲咳等现象",
		"method":"先直刺0.2 - 0.3寸，然后沿胸骨柄后缘，气管前缘缓慢向下刺入0.5 - 1寸；可灸本穴针刺不能过深，也不宜向左右刺，以防刺伤锁骨下动脉及肺尖；",
		"extra":"阴维、任脉之会如刺中无名静脉或主动脉弓时，针下可有柔软而有弹力的阻力或病人有疼痛感觉，应即退针"
	}, {
		"id":"RN23",
		"belonging":"任脉经",
		"name":"廉泉",
		"pos":"在颈部，当前正中线上，结喉上方，舌骨上缘凹陷处",
		"anatomy":"在甲状软骨和舌骨之间，深部为会厌，下方为喉门，有甲状舌骨肌、舌肌；有颈前浅静脉，甲状腺上动、静脉；布有颈皮神经，深层有舌下神经分支",
		"goodfor":"①舌下肿痛　流涎　舌强不语②哑症　暴喑③吞咽困难　咽喉肿痛",
		"method":"直刺0.5 - 0.8寸，不留针；可灸",
		"extra":"阴维、任脉之会"
	}, {
		"id":"RN24",
		"belonging":"任脉经",
		"name":"承浆",
		"pos":"在面部，当颏唇沟的正中凹陷处",
		"anatomy":"在口轮匝肌和颏肌之间；有下唇动、静脉分支；布有面神经及颏神经分支",
		"goodfor":"①面瘫后期　流涎　②齿痛　龈肿　齿衄③癫狂痫 失眠（ + 印堂）",
		"method":"斜刺0.3 - 0.5寸；可灸",
		"extra":"足阳明、任脉之会"
	}, {
		"id":"EXHN1",
		"belonging":"头部",
		"name":"四神聪",
		"pos":"在头顶部，当百会前后左右各1寸，共四穴",
		"anatomy":"在帽状腱膜中；有枕动、静脉、颞浅动、静脉顶支和眶上动、静脉的吻合网；布有枕大神经、耳颞神经及眶上神经分支",
		"goodfor":"头痛，眩晕，失眠，健忘，癫狂，痫证，偏瘫，脑积水，大脑发育不全",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"EXHN2",
		"belonging":"头部",
		"name":"当阳",
		"pos":"在头顶部，当瞳孔直上，前发际上1寸",
		"anatomy":"",
		"goodfor":"目疾肿痛，前头痛",
		"method":"平刺0.5 - 0.8寸；可灸",
		"extra":""
	}, {
		"id":"EXHN3",
		"belonging":"头部",
		"name":"印堂",
		"pos":"在额部，当两眉头之中间",
		"anatomy":"在掣眉肌中；两侧有额内动、静脉分支；布有来自三叉神经的滑车上神经",
		"goodfor":"头痛，头晕，鼻渊，鼻衄，目赤肿痛，重舌，呕吐，产妇血晕，子痫，急、慢惊风，不寐，颜面疔疮以及三叉神经痛",
		"method":"提捏局部皮肤，向下平刺0.3-0.5寸；或用三棱针点刺出血；可灸",
		"extra":""
	}, {
		"id":"EXHN4",
		"belonging":"头部",
		"name":"鱼腰",
		"pos":"在额部，瞳孔直上，眉毛中",
		"anatomy":"在眼轮匝肌中；有额动、静脉外侧支；布有眶上神经、面神经的分支",
		"goodfor":"目赤肿痛，目翳，眼睑动，眼睑下垂，眶上神经痛",
		"method":"平刺0.3-0.5寸；禁灸",
		"extra":""
	}, {
		"id":"EXHN5",
		"belonging":"头部",
		"name":"太阳",
		"pos":"在颞部，当眉梢与目外眦之间，向后约一横指的凹陷处",
		"anatomy":"在颞筋膜及颞肌中；有颞浅动、静脉；布有三叉神经第二、三支分支，面神经颞支",
		"goodfor":"偏正头痛，目赤肿痛，目眩，目涩，牙痛，三叉神经痛",
		"method":"直刺或斜刺0.3-0.5寸；或用三棱针点刺出血禁灸",
		"extra":""
	}, {
		"id":"EXHN6",
		"belonging":"头部",
		"name":"耳尖",
		"pos":"在耳廓的上方，当折耳向前，耳廓上方的尖端处",
		"anatomy":"有耳后动、静脉；布有耳颞神经",
		"goodfor":"目赤肿痛，上目翳，偏正头痛，喉痹，以及麦粒肿",
		"method":"直刺0.1-0.2寸；或用三棱针点刺出血可灸",
		"extra":""
	}, {
		"id":"EXHN7",
		"belonging":"头部",
		"name":"球后",
		"pos":"在面部，当眶下缘外四分之一与内四分之三交界处",
		"anatomy":"在眼轮匝肌中，深部为眼肌；浅层有面动、静脉；布有面神经颧支和眶下神经、结状神经结和视神经，深层有眼神经",
		"goodfor":"目疾如视神经炎，视神经萎缩，视网膜色素变性，青光眼，早期白内障，近视",
		"method":"沿眶下缘从外下向内上，向视神经孔方向刺0.5-1寸",
		"extra":""
	}, {
		"id":"EXHN8",
		"belonging":"头部",
		"name":"上迎香",
		"pos":"在面部，当鼻翼软骨与鼻甲的交界处，近鼻唇沟上端处",
		"anatomy":"在上唇方肌中；有面动、静脉之支；布有筛前神经、眶下神经分支及滑车下神经",
		"goodfor":"头痛，鼻塞，鼻中瘜肉，暴发火眼，迎风流泪",
		"method":"向内上方斜刺0.3-0.5寸；可灸",
		"extra":""
	}, {
		"id":"EXHN9",
		"belonging":"头部",
		"name":"内迎香",
		"pos":"在鼻孔，当鼻翼软骨与鼻甲的粘膜处",
		"anatomy":"在鼻腔底部粘膜上；有面、动、静脉的鼻背支；布有筛前神经的鼻外支",
		"goodfor":"目赤肿痛，鼻疾，喉痹，热病，中暑，眩晕",
		"method":"用三棱针点刺出血有出血体质的人忌用",
		"extra":""
	}, {
		"id":"EXHN10",
		"belonging":"头部",
		"name":"聚泉",
		"pos":"在口腔内，当舌背正中缝的中点处",
		"anatomy":"在舌肌中；有面神经鼓索、舌动脉；布有三叉神经第三支分支、舌神经",
		"goodfor":"舌强，舌缓，消渴，哮喘，咳嗽及味觉减退",
		"method":"直刺0.1-0.2寸；或用三棱针点刺出血",
		"extra":""
	}, {
		"id":"EXHN11",
		"belonging":"头部",
		"name":"海泉",
		"pos":"在口腔内，当舌下系带中点处",
		"anatomy":"",
		"goodfor":"舌疾、口腔炎、喉痹",
		"method":"用三棱针或毫针点刺出血；勿灸",
		"extra":""
	}, {
		"id":"EXHN12",
		"belonging":"头部",
		"name":"金津",
		"pos":"在口腔内，当舌下系带左侧的静脉上",
		"anatomy":"有舌下静脉；布有舌下神经、舌神经",
		"goodfor":"舌强，舌肿，口疮，消渴，喉痹",
		"method":"点刺出血",
		"extra":""
	}, {
		"id":"EXHN13",
		"belonging":"头部",
		"name":"玉液",
		"pos":"在口腔内，当舌下系带右侧的静脉上",
		"anatomy":"有舌下静脉；布有舌下神经、舌神经",
		"goodfor":"舌强，口疮，喉痹，失语",
		"method":"点刺出血",
		"extra":""
	}, {
		"id":"EXHN14",
		"belonging":"头部",
		"name":"翳明",
		"pos":"在项部，当翳风后1寸",
		"anatomy":"在胸锁乳突肌上；有耳后动、静脉；布有耳大神经和枕小神经",
		"goodfor":"目疾，如近视，远视，雀目，青盲，早期白内障；头痛，眩晕，耳鸣，失眠，精神病",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXHN15",
		"belonging":"头部",
		"name":"颈百劳",
		"pos":"在项部，当大椎直上2寸，后正中线旁开1寸",
		"anatomy":"",
		"goodfor":"骨蒸潮热，盗汗自汗，瘰疬，咳嗽，气喘，颈项强痛",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXCA1",
		"belonging":"腹部",
		"name":"子宫",
		"pos":"在下腹部，当脐中下4寸，中极旁开3寸",
		"anatomy":"在腹内、外斜肌处；有腹壁浅动、静脉；布有髂腹下神经",
		"goodfor":"子宫脱垂，月经不调，痛经，崩漏，不孕，疝气，腰痛",
		"method":"直刺0.8-1.2寸；可灸",
		"extra":""
	}, {
		"id":"EXB1",
		"belonging":"背部",
		"name":"定喘",
		"pos":"在背部，当第7颈椎棘突下，旁开0.5寸",
		"anatomy":"在斜方肌、菱形肌、头夹肌、最长肌中；有颈横动脉和颈深动脉分支；布有第七、八颈神经后支",
		"goodfor":"哮喘，咳嗽，落枕，肩背痛，上肢疼痛不举，荨麻疹",
		"method":"直刺，0.8-1.2寸；可灸",
		"extra":""
	}, {
		"id":"EXB2",
		"belonging":"背部",
		"name":"夹脊",
		"pos":"在背腰部，当第1胸椎至第5腰椎棘突下两侧，后正中线旁开0.5寸，一侧十七穴",
		"anatomy":"在横突间的韧带和肌肉中因穴位位置不同，涉及的肌肉也不同一般分为三层，浅层为斜方肌、背阔肌和菱形肌；中层有上、下锯肌；深层有骶棘肌和横突棘突间的短肌每穴都有相应椎骨下方发出的脊神经后支及其伴行的动脉和静脉丛分布",
		"goodfor":"适应范围较广其中上胸部的穴位治疗心肺、上肢疾病；下胸部的穴位治疗胃肠疾病；腰部的穴位治疗腰、腹及下肢疾病",
		"method":"直刺0.3-0.5寸，或用梅花针叩刺；可灸",
		"extra":""
	}, {
		"id":"EXB3",
		"belonging":"背部",
		"name":"胃脘下俞",
		"pos":"在背部，当第8胸椎棘突下，旁开1.5寸",
		"anatomy":"在斜方肌下缘，有背阔肌，最长肌；有第八肋间动、静脉背侧支的内侧支；布有第八胸神经后支内侧皮支，深层为第八胸神经后支外侧支",
		"goodfor":"胃痛，胰腺炎，胸胁痛，消渴，咳嗽，咽干",
		"method":"斜刺0.3-0.5寸；可灸",
		"extra":""
	}, {
		"id":"EXB4",
		"belonging":"背部",
		"name":"痞根",
		"pos":"在腰部，当第1腰椎棘突下，旁开3.5寸",
		"anatomy":"在背阔肌、髂肋肌处；有第一腰动、静脉背侧支；布有第十二胸神经后支外侧支，深层为第一腰神经后支",
		"goodfor":"痞块，肝脾肿大，疝痛，腰痛，翻胃",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXB5",
		"belonging":"背部",
		"name":"下极俞",
		"pos":"在腰部，第3椎腰棘突下，当后正中线上",
		"anatomy":"在腰背筋膜、棘上韧带及棘间韧带中；有腰动脉后支，棘间皮下静脉丛；布有腰神经后支内侧支",
		"goodfor":"腰痛，腹痛，腹泻，小便不利，遗尿，下肢痠痛，腹泻，小便不利，遗尿，下肢痠痛",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXB6",
		"belonging":"背部",
		"name":"腰宜",
		"pos":"在腰部，当第4腰椎棘突下，旁开3寸",
		"anatomy":"",
		"goodfor":"腰挫伤、腰腿痛、泌尿生殖疾患",
		"method":"直刺1.0-1.5寸；或针后拔罐",
		"extra":""
	}, {
		"id":"EXB7",
		"belonging":"背部",
		"name":"腰眼",
		"pos":"在腰部，当第4腰椎棘突下旁开约3.5寸凹陷中",
		"anatomy":"在背阔肌、髂肋肌处；有第二腰动、静脉背侧支；布有第十二胸神经后支外侧支，第一腰神经外侧支",
		"goodfor":"腰痛，尿频，消渴，虚旁，赢瘦，妇科疾患",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXB8",
		"belonging":"背部",
		"name":"十七椎",
		"pos":"在腰部，当后正中线上，第5腰椎棘突下",
		"anatomy":"",
		"goodfor":"腰骶痛，腿痛，转胞，痛经，崩漏，遗尿",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXB9",
		"belonging":"背部",
		"name":"腰奇",
		"pos":"在骶部，当尾骨端直上2寸，骶角之间凹陷中",
		"anatomy":"当棘上韧带处；有第二、三骶动、静脉；布有第二、三骶神经后支",
		"goodfor":"癫痫，头痛，失眠，便秘",
		"method":"向上平刺1-1.5寸；可灸",
		"extra":""
	}, {
		"id":"EXUE1",
		"belonging":"上肢",
		"name":"肘尖",
		"pos":"在肘后部，屈肘，当尺骨鹰嘴的尖端",
		"anatomy":"有浅筋膜；肘关节动脉网；布有前臂背侧皮神经",
		"goodfor":"瘰疬，痈疽，疔疮，肠痈，霍乱",
		"method":"灸",
		"extra":""
	}, {
		"id":"EXUE2",
		"belonging":"上肢",
		"name":"二白",
		"pos":"在前臂掌侧，腕横纹上4寸，桡侧腕屈肌腱的两侧，一侧二穴",
		"anatomy":"有指浅屈肌；桡动、静脉和骨间掌侧动、静脉；布有前臂内侧皮神经、前臂外侧皮神经、正中神经和桡神经",
		"goodfor":"痔疮，脱肛，前臂痛，胸胁痛",
		"method":"直刺0.5-0.8寸；可灸",
		"extra":""
	}, {
		"id":"EXUE3",
		"belonging":"上肢",
		"name":"中泉",
		"pos":"在腕背侧横纹中，当指总伸肌腱桡侧的凹陷处",
		"anatomy":"在拇长伸肌腱与食指固有伸肌腱之间，有腕背侧韧带；有桡神经腕背支，腕背静脉网；布有桡神经浅支",
		"goodfor":"胸胁胀满，咳嗽气喘，胃脘疼痛，心痛，唾血，目翳，掌中热，腹胀腹痛",
		"method":"直刺0.3-0.5寸；可灸",
		"extra":""
	}, {
		"id":"EXUE4",
		"belonging":"上肢",
		"name":"中魁",
		"pos":"在中指背侧近侧指间关节的中点处",
		"anatomy":"有指背神经和动脉",
		"goodfor":"噎膈，翻胃，呕吐，呃逆，牙痛，鼻出血，白癜风",
		"method":"灸",
		"extra":""
	}, {
		"id":"EXUE5",
		"belonging":"上肢",
		"name":"大骨空",
		"pos":"在拇指背侧指间关节的中点处",
		"anatomy":"有指背神经和动脉",
		"goodfor":"目痛，目翳，内障，吐泻，衄血",
		"method":"灸",
		"extra":""
	}, {
		"id":"EXUE6",
		"belonging":"上肢",
		"name":"小骨空",
		"pos":"在小指背侧近侧指间关节的中点处",
		"anatomy":"有指背神经和动脉",
		"goodfor":"目赤肿痛，目翳，喉痛，指关节痛",
		"method":"灸",
		"extra":""
	}, {
		"id":"EXUE7",
		"belonging":"上肢",
		"name":"腰痛点",
		"pos":"在手背侧，当第2、3掌骨及第4、5掌骨之间，当腕横纹与掌指关节校点处，一侧二穴",
		"anatomy":"在第二、四掌骨背侧骨间肌中；有掌背动脉；布有掌背神经，指掌侧总神经",
		"goodfor":"急性腰扭伤，头痛，卒死，痰壅气促，小儿急、慢惊风，手背红肿疼痛",
		"method":"直刺0.3-0.5寸；可灸",
		"extra":""
	}, {
		"id":"EXUE8",
		"belonging":"上肢",
		"name":"外劳宫",
		"pos":"在手背侧，第2、3掌骨之间，掌指关节后0.5寸",
		"anatomy":"有骨间背侧肌；有掌背动脉，手背静脉网；布有桡神经分支",
		"goodfor":"手背红肿，手指麻木，落枕，五指不能屈伸，小儿消化不良，脐风，以及颈椎综合征",
		"method":"直刺0.5-0.8寸；可灸",
		"extra":""
	}, {
		"id":"EXUE9",
		"belonging":"上肢",
		"name":"八邪",
		"pos":"在手背侧，微握拳，第1-5指间，指蹼缘后方赤白肉际处，左右共八穴",
		"anatomy":"当骨间肌处；有手背静脉网、掌背动脉；布有尺、桡神经的手背支",
		"goodfor":"手背肿痛，手指麻木，头项强痛，咽痛，齿痛，目痛，烦热，毒蛇咬伤",
		"method":"向上斜刺0.5-0.8寸；或点刺出血可灸",
		"extra":""
	}, {
		"id":"EXUE10",
		"belonging":"上肢",
		"name":"四缝",
		"pos":"在第2-5指掌面侧，近端指关节的中点，一侧四穴",
		"anatomy":"入皮后有指纤维鞘、指滑液鞘、屈指深肌腱、深部为指关节腔；有指掌侧固有动、静脉分支；布有指掌侧固有神经",
		"goodfor":"疳积，百日咳，肠虫症，小儿腹泄，咳嗽气喘",
		"method":"点刺0.1-0.2寸，挤量黄白色透明样粘液或出血",
		"extra":""
	}, {
		"id":"EXUE11",
		"belonging":"上肢",
		"name":"十宣",
		"pos":"在手十指尖端，距指甲游离缘0.1寸，左右共十穴",
		"anatomy":"有指掌侧固有动、静脉形成的动、静脉网；布有指掌侧固有神经和丰富的痛觉感受器",
		"goodfor":"昏迷，晕厥，中暑，热病，小儿惊厥，咽喉肿痛，指端麻木",
		"method":"直刺0.1-0.2寸；或用三棱针点刺出血",
		"extra":""
	}, {
		"id":"EXLE1",
		"belonging":"下肢",
		"name":"髋骨",
		"pos":"在大腿前面下部，当梁丘两旁各1.5寸，一侧二穴",
		"anatomy":"",
		"goodfor":"膝关节炎、下肢痿痹瘫",
		"method":"直刺0.3-0.5寸；可灸",
		"extra":""
	}, {
		"id":"EXLE2",
		"belonging":"下肢",
		"name":"鹤顶",
		"pos":"在膝上部，髌底的中点上方凹陷处",
		"anatomy":"在髌骨上缘股四头肌腱中；有膝关节动脉网；布有股神经前皮支及肌支",
		"goodfor":"膝关节痠痛，腿足无力，鹤膝风，脚气",
		"method":"直刺0.5-0.8寸；可灸",
		"extra":""
	}, {
		"id":"EXLE3",
		"belonging":"下肢",
		"name":"百虫窝",
		"pos":"屈膝，在大腿内侧，髌底内侧端上3寸，即血海上1寸",
		"anatomy":"在股内侧肌中；有股动、静脉；布有股神经前皮支，深层有股神经肌支",
		"goodfor":"皮肤瘙痒，风疹块，下部生疮，蛔虫病",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXLE4",
		"belonging":"下肢",
		"name":"内膝眼",
		"pos":"屈膝，在髌韧带内侧凹陷处",
		"anatomy":"",
		"goodfor":"膝关节周围炎、下肢运动障碍",
		"method":"向膝中斜刺0.5-1寸，或向对侧透刺；可灸",
		"extra":""
	}, {
		"id":"EXLE5",
		"belonging":"下肢",
		"name":"膝眼",
		"pos":"屈膝，在髌韧带两侧凹陷处，在内侧的称内膝眼，在外侧的称外膝眼",
		"anatomy":"在髌韧带两侧；有膝关节动、静脉网；布有隐神经分支、股外侧皮神经分支，深层有胫腓总神经分支",
		"goodfor":"膝关节痠痛，鹤膝风，脚气，腿痛",
		"method":"向膝中斜刺0.5-1寸，或透刺对侧膝眼；可灸",
		"extra":""
	}, {
		"id":"EXLE6",
		"belonging":"下肢",
		"name":"胆囊",
		"pos":"在小腿外侧上部，当腓骨小头前下方凹陷处（阳陵泉）直下2寸",
		"anatomy":"在腓骨长肌与趾长伸肌处；有胫前动、静脉分支；布有腓肠外侧皮神经、腓浅神经",
		"goodfor":"急、慢性胆囊炎，胆石症，胆道蛔虫症，胆绞痛，胁痛，下肢萎痹",
		"method":"直刺1-1.5寸；可灸",
		"extra":""
	}, {
		"id":"EXLE7",
		"belonging":"下肢",
		"name":"阑尾",
		"pos":"在小腿前侧上部，当犊鼻下5寸，胫骨前缘旁开一横指",
		"anatomy":"在胫骨前肌、趾长伸肌中；有胫前动、静脉；布有腓肠外侧皮神经、腓深神经",
		"goodfor":"急、慢性阑尾炎，胃脘疼痛，消化不良，下肢萎痹",
		"method":"直刺0.5-1寸；可灸",
		"extra":""
	}, {
		"id":"EXLE8",
		"belonging":"下肢",
		"name":"内踝尖",
		"pos":"在足内侧面，内踝的凸起处",
		"anatomy":"",
		"goodfor":"牙痛，扁桃体炎，足内侧缘痉挛",
		"method":"灸法",
		"extra":""
	}, {
		"id":"EXLE9",
		"belonging":"下肢",
		"name":"外踝尖",
		"pos":"在足外侧面，外踝的凸起处",
		"anatomy":"",
		"goodfor":"牙痛，脚气，偏瘫",
		"method":"用三棱针点刺出血",
		"extra":""
	}, {
		"id":"EXLE10",
		"belonging":"下肢",
		"name":"八风",
		"pos":"在足背侧，第1-5趾间，趾蹼缘后方赤白肉际处，一侧四穴，左右共八穴",
		"anatomy":"在趾骨小头间前跖骨间肌中；有趾背动、静脉；布有腓浅、深神经",
		"goodfor":"足跗肿痛，脚弱无力，头痛，牙痛，疟疾，毒蛇咬伤，足趾青紫症，月经不调",
		"method":"斜刺0.5-0.8寸，或用三棱针点刺出血；可灸",
		"extra":""
	}, {
		"id":"EXLE11",
		"belonging":"下肢",
		"name":"独阴",
		"pos":"在足第2趾的跖侧远侧趾间关节的中点",
		"anatomy":"",
		"goodfor":"卒心痛，胸胁痛，呕吐，吐血，死胎，胸衣不下，月经不调，疝气",
		"method":"直刺0.1-0.2寸；可灸",
		"extra":""
	}, {
		"id":"EXLE12",
		"belonging":"下肢",
		"name":"气端",
		"pos":"在足十趾尖端，距趾甲游离缘0.1寸，左右共十穴",
		"anatomy":"",
		"goodfor":"中风急救，足趾麻木，脚背红肿、疼痛",
		"method":"直刺0.1-0.2寸；可灸",
		"extra":""
	}
];



    callLater(successCallback);

}